{
  "program_title": "Accounting course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/accounting/courses",
  "faculty": [],
  "requirements": {
    "major_in": "32 credits including ACCT-200 or 201, ACCT-202, ACCT-311, ACCT-313, ACCT-314, ACCT-321, ACCT-322,ACCT-456, and 2 credits of electives. Required supporting courses (12 credits): DATA-101, ECON-200 and BUSN-211 or MATH-315.",
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": "16 credits including ACCT-200 or 201, ACCT-202, ACCT-321, and 4 additional accounting credits. Required supporting courses for the major are not required for the minor. A 1.67 grade-point average in accounting classes is required for enrollment in any course beyond ACCT-202.",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=acct",
  "courses_html": "document.write('<p><strong>ACCT-200 Accounting Fundamentals (4 Credits)</strong><br/>(Q) This course is an introduction to fundamental accounting and related business topics to students who are majoring in areas other than accounting or business administration. Topics covered include the accounting cycle, elements of financial statements, preparation and interpretation of financial statements, internal controls, management accounting, payroll accounting and related human resource management issues. (Not open to students having previously completed ACCT-201.)</p><p><strong>ACCT-201 Financial Accounting (4 Credits)</strong><br/>(Q) Basic theory, concepts, and procedures necessary to develop and interpret financial (external) accounting reports.  Q suffix became active as of 04/18/2021.</p><p><strong>ACCT-202 Managerial Accounting (4 Credits)</strong><br/>(Q) Basic theory, concepts, and procedures necessary to develop and interpret managerial (internal) accounting reports. Prerequisite: ACCT-200 or ACCT-201 or permission of instructor.  Q suffix became effect on October 23, 2020 for J-Term 2020-2021 and forward.</p><p><strong>ACCT-311 Accounting Information Systems (4 Credits)</strong><br/>Information systems concepts; computer technology; system analysis; design and application of computer-based accounting systems that provide adequate internal control. Prerequisite: ACCT-200 or ACCT-201.</p><p><strong>ACCT-313 Auditing (4 Credits)</strong><br/>Accounting principles underlying auditing; the objectives and fundamentals of auditing procedures, introduction to the professional code of ethics, classical ethical concepts and models as well as specific ethical guidelines for the accounting profession. Prerequisite: ACCT-321</p><p><strong>ACCT-314 Tax Accounting (4 Credits)</strong><br/>Introduction to the role of taxes in today\\'s society and their impact on individuals and business entities; emphasis on federal individual income taxation and the responsibilities of tax practitioners.</p><p><strong>ACCT-321 Intermediate Accounting I (4 Credits)</strong><br/>In-depth coverage of the theory and practice of financial accounting focusing on assets, including additional topics of conceptual framework of accounting, standard setting, accounting cycle, multi-step income statement, classified balance sheet, and time value of money. Prerequisite: Take ACCT-200 or 201..</p><p><strong>ACCT-322 Intermediate Accounting II (4 Credits)</strong><br/>In-depth coverage of the theory and practice of financial accounting for liabilities and equity, including earnings per share, deferred taxes, pensions, leases, accounting changes, error corrections, and cash flows. Basic theory, concepts, and procedures to effectively conduct research in the accounting professional standards including the Accounting Standards Codification.  Prerequisite: ACCT-321</p><p><strong>ACCT-341 SI-Business Law (2 Credits)</strong><br/>Environmental study of legal influences, concepts, institutions, emphasizing social forces shaping business law. Introduces business students to interrelationships of law and society, jurisprudence and business.</p><p><strong>ACCT-399 Directed Study (1-2 Credits)</strong><br/></p><p><strong>ACCT-400 Independent Study (1-2 Credits)</strong><br/>Research on specific topics for seniors in accounting. Prerequisite: a grade-point average of 3.0 or higher in the major and permission of department.</p><p><strong>ACCT-401 Seminar in Accounting Topics (1 Credits)</strong><br/>The seminar is a one-credit offering to expose students to current topics in accounting not covered elsewhere in the accounting curriculum.</p><p><strong>ACCT-444 VITA Seminar (1 Credits)</strong><br/>Students complete a service learning activity through VITA.</p><p><strong>ACCT-445 Audit Seminar (1 Credits)</strong><br/>Students complete a professional experience activity through the academic audit; enrollment in ACCT445 would be coordinated with ACCT313, Auditing</p><p><strong>ACCT-451 SI-Fraud Detection & Prevention (2 Credits)</strong><br/>Techniques and procedures for fraud prevention, detection, and investigation.</p><p><strong>ACCT-452 SI- Government & Non Profit Accounting (2 Credits)</strong><br/>Theory and practice of governmental and non-profit accounting including financial reporting requirements for government-wide consolidations/reconciliations and annual comprehensive financial report (ACFR).  Prerequisite: ACCT-321</p><p><strong>ACCT-454 SI-Advanced Auditing (2 Credits)</strong><br/>Expand on technical skills students need to conduct audits, reviews, and compilations, focusing on case studies and advanced topics covered in the AUD section of the CPA exam.  Prerequisite: ACCT-313</p><p><strong>ACCT-455 SI-Advanced Managerial Accounting (2 Credits)</strong><br/>Continues the analysis of managerial accounting issues, focusing on advanced tools for assisting managers. Achieve competency in; using the appropriate decision modeling techniques for the situation using capacity analysis, creating balanced scorecard analysis, capital budgeting techniques. Achieve an awareness of; alternative inventory pricing models, complexities of ABC strategies, cost hierarchies, pricing strategies and legal requirements for pricing policies. Prerequisite: ACCT-202</p><p><strong>ACCT-456 SI-Advanced Tax (2 Credits)</strong><br/>This course covers certain common and special federal tax laws for individuals, partnerships, and corporations, estates, trusts, and miscellaneous entities. Topics include income tax returns for partnerships and business corporations as well as survey coverage of corporate tax issues, including formation, taxable income, and distributions. The course also covers IRS audits, exposure to partnerships, estate and gifts, and international taxation.  Prerequisite: ACCT-314</p><p><strong>ACCT-457 SI-Advanced Accounting (2 Credits)</strong><br/>Accounting for business combinations, foreign currency translation, consolidations, and derivatives and hedging, focusing on advanced topics covered in the FAR section of the CPA exam.  Prerequisite: ACCT-321</p>');",
  "scrape_metadata": {
    "original_title": "Accounting",
    "dept_slug": "accounting",
    "original_url": "https://augustana.edu/academics/areas-of-study/accounting",
    "courses_url": "https://augustana.edu/academics/areas-of-study/accounting/courses",
    "scrape_timestamp": "2025-09-26 19:56:39",
    "status": "success"
  }
}