{
  "program_title": "Art History course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/art-history/courses",
  "faculty": [],
  "requirements": {
    "major_in": "28 credits, including ARHI-460; ARHI-461; at least two courses from ARHI-161, ARHI-165, ARHI-166; one course from ARHI-372 or ARHI-374; one course from ARHI-361, ARHI-362, ARHI-363, ARHI-365; one course from ARHI-366, ARHI-367, ARHI-368; and one 4-credit elective course from the following: any ARHI prefix at the 200-level or above; any ART or GRD course; CLAS 330, HIST 232, HIST-260, HIST-330, HIST-337, PHIL-318, SOAN-321, or SOAN-336. Students wishing to complete an SI in another major should speak with their departmental advisor for approval; students approved for completing an SI elsewhere will be required to take another ARHI course at the 300-level instead of ARHI-460 and ARHI-461.",
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": "20 credits, including at least two courses from ARHI-161, ARHI-165, ARHI-166; one course from ARHI-372 or ARHI-374; one course from ARHI-361, ARHI-362, ARHI-363, ARHI-365; one course from ARHI-366, ARHI-367, ARHI-368. Any Studio Art or Graphic Design major can fulfill the minor in Art History with 16 credits, including at least two courses from ARHI-161, ARHI-165, ARHI-166; and two courses from two different 300-level sequences: 1) ARHI-372 or ARHI-374; 2) ARHI-361, ARHI-362, ARHI-363, or ARHI-365; 3) ARHI-366, ARHI-367, or ARHI-368.",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors . -->",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=arhi",
  "courses_html": "document.write('<p><strong>ARHI-101TR Art Appreciation (3 Credits)</strong><br/></p><p><strong>ARHI-102TR Art History Elective (3-4 Credits)</strong><br/></p><p><strong>ARHI-103TR Art History Elec (3-4 Credits)</strong><br/></p><p><strong>ARHI-161 Global Art in Perspective (4 Credits)</strong><br/>(PA, G) Works of art from around the world examined thematically and chronologically as visual evidence of cultural heritage.</p><p><strong>ARHI-161AP AP Art History (4 Credits)</strong><br/></p><p><strong>ARHI-165 Survey World Art I: Prehistoric-Medieval (4 Credits)</strong><br/>(PP, G) A chronological survey of the art and architecture from around the world, from Paleolithic cave paintings to medieval cathedrals and mosques. Students learn to analyze the formal elements of works of art and architecture, examine works within the original cultural and historical contexts, and compare art across cultures and from different time periods.</p><p><strong>ARHI-166 Survey World Art II: Early Mod-Contemp (4 Credits)</strong><br/>(PP, G) A chronological survey of the art and architecture from around the world from the Renaissance in Europe to the contemporary global art market. Students learn to analyze the formal elements of works of art and architecture, examine works within the original cultural and historical contexts, and compare art across cultures and from different time periods.</p><p><strong>ARHI-202TR Art History Elective (3-4 Credits)</strong><br/></p><p><strong>ARHI-270 Art History in Context (4 Credits)</strong><br/>(PA) Focuses on a specific art-historical topic, and students learn to interpret works of art in context while engaging in discussions around that theme  from a broader historical perspective. The class will take field trips to regional museums such as the Figge Art Museum, the Art Institute of Chicago and the University of Iowa\\'s Museum of Art and will study works in Augustana\\'s collection. May be taken more than once as topics change. Please note: this course will have field trips that may extend beyond class time. Fee $40.</p><p><strong>ARHI-361 Greek & Roman Art (4 Credits)</strong><br/>(PP, G) Ancient Greek and Roman art and architecture from early Aegean culture to the fall of the Roman empire examined within political, social, religious and mythological contexts. May be team taught with faculty from Classics.</p><p><strong>ARHI-362 Medieval Art (4 Credits)</strong><br/>(PP,G) Art and architecture of Europe, the Byzantine empire, and the Islamic world, including cathedrals and mosques, stained glass, textiles, and manuscripts, from the early medieval through the Gothic periods (c. 500-1500), examined within their political, social and religious contexts.</p><p><strong>ARHI-363 Renaissance Art (4 Credits)</strong><br/>(PP,G) An examination of European artistic production from predominantly Italy, Frances, Germany, England, and the Netherlands from the 15th and 16th centuries. Issues explored include devotional practices, humanism, patronage across social classes, artistic training and workshop practices, global trade, and developments in production techniques and materials.</p><p><strong>ARHI-365 Baroque and Rococo Art (4 Credits)</strong><br/>(PP,G) An examination of European artistic production in Italy, Spain, France, the Netherlands, and the Americas from the end of the 16th century through the first half of the 18th century. Explores how religious revolution and reformation, scientific discoveries, and political and economic transformations spurred the production of art and architecture, from artists such as Caravaggio, Bernini, Rubens, Rembrandt, and Watteau, within the sacred, political, and private spheres.</p><p><strong>ARHI-366 Modern I: Revolutions to Impressionism (4 Credits)</strong><br/>(PP,G) European art of the mid-18th and 19th centuries examined within the political, social, literary and scientific developments of the historic periods of the Enlightenment, Neo-classicism, Romanticism, Realism, Impressionism and Post-Impressionism including Goya, Courbet, Morisot, Monet and Van Gogh.</p><p><strong>ARHI-367 Modern II: Post-Impress to Contemporary (4 Credits)</strong><br/>(PP,G) American and European art of the late 19th through 21st centuries examined chronologically while exploring the conflicts inherent in the development of modern art and new definitions of the relationship of the work of art to its artist and audience, including Van Gogh, Picasso, O\\'Keeffe, Pollock, Warhol and Gonzáles-Torres.</p><p><strong>ARHI-368 American Art (4 Credits)</strong><br/>(PP,D) American art and architecture from America\\'s indigenous roots and Colonialism through the establishment of modernism in the 20th century examined within the historic struggle toward establishing a national identity, including Copley, Homer, Cassatt, Whistler, Hopper, Stieglitz and Wright.</p><p><strong>ARHI-369 British Art (4 Credits)</strong><br/>(PP,G) British art, architecture and collections from around the world from Neolithic Stonehenge through the early 20th century examined within the context of establishing a national character, including Tudor and Elizabethan portraits, British palaces, churches and castles, as well as illuminated manuscripts and paintings by Gainsborough, Hogarth, Blake, Turner and the Pre-Raphaelites.</p><p><strong>ARHI-371 History of Printmaking (4 Credits)</strong><br/>(PP) Chronological developments in European and American printmaking traced from their origins in early 15th-century woodcuts through the present day. Explores a variety of printmaking techniques within historical contexts, the materiality of prints, and the implications of images in multiples. Emphasis is on study of prints first-hand. Artists discussed include Dürer, Rembrandt, Goya, Cassatt, and Warhol. May be taught during J-term or semester.</p><p><strong>ARHI-372 Asian Art (4 Credits)</strong><br/>(PP,G) Architecture, painting, sculpture and minor arts of the Middle East and Asia, including India, China and Japan. The development of images of Buddha, cave paintings at Ajanta, Chinese bronzes and scroll paintings, Japanese landscape paintings, gardens and ukiyo-e woodblock prints, and relationships with art of the West.</p><p><strong>ARHI-374 African Art (4 Credits)</strong><br/>(PP,G) Arts of past and present African cultures. Examines architecture, sculpture, painting, textiles, ceramics, metals and body arts, and explores the relationships of gender and power, art and ritual, tradition and today\\'s global culture. This course moves geographically throughout the continent as a whole.</p><p><strong>ARHI-377 Art, Medicine, Healing (4 Credits)</strong><br/>This course explores the relationship between medicine, healing, and Western visual culture, from the votive practices of ancient Greek medicine to activist art during the AIDS crisis. We will consider: artistic representations of bodies, health, and disease; the visual and material culture of medicine and healing; and the role of the visual in shaping medical knowledge (and misinformation). This course fits into the &quot;Expression&quot; category for the Integrated Medicine and Humanities minor. May be taught during J-term or semester.</p><p><strong>ARHI-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>ARHI-399 Directed Study (1-2 Credits)</strong><br/>199, 299, 399, 499 Directed Study (1+)  Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and instructor.</p><p><strong>ARHI-400 Independent Study (1-2 Credits)</strong><br/>400 Independent Study (1+)  Independent investigation and research in selected topics in art history. Prerequisite: permission of instructor.</p><p><strong>ARHI-460 Art History SI Methods (2 Credits)</strong><br/>First part of a two-course, two-term SI sequence. Intensive reading and research of art historical methods in preparation of Senior Thesis ARHI-461. Students will also formulate SI topics/research plans and develop bibliographies for spring term research and writing.</p><p><strong>ARHI-461 Art Hist SI Thesis (2 Credits)</strong><br/>Following successful completion of ARHI-460, Senior Seminar, art history majors are required to enroll in one term of ARHI-461, the final component of art history senior inquiry. Students will execute their SI projects and any further research relating to SI. Students will explore research and writing strategies, make connections with other areas of their liberal arts education, work through drafts with instructor and peers, and present their work publicly at Celebration of Learning or another venue. Prerequisite: ARHI 460.</p><p><strong>ARHI-499 Directed Study (1-2 Credits)</strong><br/>199, 299, 399, 499 Directed Study (1+)  Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and instructor.   </p>');",
  "scrape_metadata": {
    "original_title": "Art History",
    "dept_slug": "art-history",
    "original_url": "https://augustana.edu/academics/areas-of-study/art-history",
    "courses_url": "https://augustana.edu/academics/areas-of-study/art-history/courses",
    "scrape_timestamp": "2025-09-26 19:56:52",
    "status": "success"
  }
}