{
  "program_title": "Art courses",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/art/courses",
  "faculty": [],
  "requirements": {
    "major_in": "36 credits, including 101 or 102, 123 or 124, 492, 16 additional credits (including 4 credits at the 300-400 level). A media sequence is required which is included in the 16 credits above: 211 and 302 or 303 or 311 or 228 and 328; or 225 and 325; or 261 and 361; or 231 or 232 and 331; or 241 and 341; or 251 or 252 or 253 or 342 or 343 or 343A and 351. Required supporting courses: 8 credits in ARHI, or ART-377 + 4 credits in ARHI (Students planning to go to graduate school in studio art should take additional studio and art history classes).",
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": "20 credits, including 101, 123 or 124, 8 credits in ART (any level), 4 credits at the 300-400 level. Recommended supporting course: ARHI-161.",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=art",
  "courses_html": "document.write('<p><strong>ART-100TR Art Elective (3-4 Credits)</strong><br/></p><p><strong>ART-101 Drawing (4 Credits)</strong><br/>(PA)Fundamentals of drawing such as value, line, form, space and composition, exploring abstraction as well as traditional subject matters through observational studies. Theory and practice through a variety of drawing media including use of color.  $60.00 lab fees</p><p><strong>ART-101AP AP Drawing (4 Credits)</strong><br/></p><p><strong>ART-102 Drawing Inquiry (4 Credits)</strong><br/>(PA) Fundamentals of drawing, including introductory life drawing, for art majors and minors. Form, space, color and composition explored in a variety of drawing media through contemporary and historical lenses.   For students with drawing experience; highly recommended for art majors and minors in place of ART 101.  $60.00 lab fee.</p><p><strong>ART-123 Design: Two Dimensional (4 Credits)</strong><br/>(PA) Theories of basic design, with emphasis on both formalism and expression in art. Design fundamentals of color, texture, shape, line, value and principles of balance, repetition, variety, harmony and unity explored. A variety of media will be investigated.  $60.00 lab fee</p><p><strong>ART-124 Design: Three Dimensional (4 Credits)</strong><br/>(PA) The theory and language of three-dimensional design and its application to artistic communication, with an emphasis on contemporary practice. Projects emphasize understanding intellectual aspects of three-dimensional form, working processes and techniques in a variety of media.  $60.00 Lab fee</p><p><strong>ART-199 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and the instructor.  </p><p><strong>ART-200TR Art Elective Transfer (3-4 Credits)</strong><br/></p><p><strong>ART-211 Painting (4 Credits)</strong><br/>(PA) Basics of color theory and practice of painting in oil and/or acrylics. Emphasis on developing fundamental painting approaches, conceptual development and individual expressions through color. Art periods, movements and practice researched. $100.00 lab fee</p><p><strong>ART-226 Black & White Photography I (4 Credits)</strong><br/>(PA) Black and white film and darkroom photography. An introduction to the basics of film exposure, processing, and darkroom printing. Individual and collaborative workshop methods are employed to develop competency. While focus is on fundamental techniques, students are encouraged to develop their own unique vision. Film and paper are included in the lab fee. A 35mm Manual SLR film camera is needed; some are available to borrow from the Art Department.  $120.00 lab fee</p><p><strong>ART-228 Digital Photography I (4 Credits)</strong><br/>(PA) An introduction to digital photography: This studio-based class provides an opportunity for students to explore image-making within a culture context. $40.00 lab fee and access to Adobe Photoshop required.   $40.00 lab fee</p><p><strong>ART-231 Ceramics: Hand Construction (4 Credits)</strong><br/>(PA) This course explores methods of hand building in clay with an emphasis on creative thinking and technical facility. Assignments emphasize developing surface design, use of glazes, and a research project. Lectures include viewing and analysis of a broad spectrum of historical and contemporary ceramic work.  $50.00 lab fee</p><p><strong>ART-232 Ceramics: Wheel Thrown Constr. (4 Credits)</strong><br/>(PA) This course focuses on learning to use the potter\\'s wheel and various other techniques as a vehicle for creating expressive forms in clay. Emphasis on creative thinking while developing facility in forming, painting and glazing ceramics. Students will engage in a research project and master study culminating in a visual response. A broad spectrum of historical and contemporary ceramics will be studied.  $60.00 lab fee</p><p><strong>ART-241 Sculpture (4 Credits)</strong><br/>(PA) The emphasis of this course is technical and creative exploration of three-dimensional forms. Working with plane, line, and multiples, students will explore processes including modeling, construction, and mold-making. Materials include paper, wood, plaster, and metal. Course will highlight contemporary sculpture methodologies including collaborative work and digital fabrication through creative projects and a research presentation.  $60 fee</p><p><strong>ART-251 Weaving (4 Credits)</strong><br/>(PA) Exploration of weaving methods on the multi-harness floor loom. Course will explore the relationship between historical and contemporary developments in weaving with discussion and analysis of their intersection with histories of cultural appropriation, labor, and gender. Students will be introduced to color and weave and multi-weft structures and complete a final project in dialogue with a contemporary textile artist.  $65.00 lab fee</p><p><strong>ART-252 Fabric Design (4 Credits)</strong><br/>(PA) Exploration of surface design and off-loom fabric construction. Course will begin by introducing fabric printing, resist dyeing (tie dye), wet felting, quilting, and stitching alongside historical and contemporary developments in surface design and the use of pattern in contemporary art. Students will work towards a visual and conceptual research project culminating in a final project building on processes introduced in class.  $60.00 lab fee</p><p><strong>ART-253 Fibers: Sculpture (4 Credits)</strong><br/>(PA) Exploration of three-dimensional textile structures including three- dimensional sewing, basketry, and hand papermaking. Emphasis on structures as sculptural forms. Survey of historical and contemporary use of the medium including use of textile sculpture in performance and installation. Formal elements of design such as line, space, texture, and shape explored through the fiber medium.  $60.00 lab fee</p><p><strong>ART-261 Relief Printmaking (4 Credits)</strong><br/>(PA) Introduction to basic monotype and relief printmaking methods including linoleum and woodcut techniques. Methods of registering multi-colored prints will be employed. Students will work collectively on a print portfolio with a common theme of their choosing.   $80.00 lab fee</p><p><strong>ART-299 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and the instructor.    </p><p><strong>ART-301 Drawing in Situ (4 Credits)</strong><br/>(PA) Art 301 Drawing in Situ combines introduction of drawing fundamentals with art appreciation in the context of international study and the artistic tradition of the host country. Students practice drawing and color concepts during exposure to great art, architectural gems and culture traditions historical and present in the locations and environment that nursed them. (foreign study only)</p><p><strong>ART-302 Figure Drawing I (4 Credits)</strong><br/>(PA) This class will explore the human figure through a variety of approaches, with an emphasis on structural and expressive possibilities. Graphite, wash and color will be used. Students work primarily from nude models. Prerequisite: ART-101  $60.00 lab fee</p><p><strong>ART-303 Figure Drawing II (4 Credits)</strong><br/>Exploration of the human figure via drawing with emphasis on a basic understanding of the human skeletal and muscular structures in relation to surface appearance. A variety of materials will be used. Students work primarily from nude models. Prerequisite: ART-101,ART-102 or ART-301. One of these courses must be completed prior to taking this course.  $60.00 lab fee.</p><p><strong>ART-311 Painting II (4 Credits)</strong><br/>Theory and practice of painting at intermediate level emphasizing historical and contemporary practice and personal expression. Prerequisite: ART-211.  $100.00 lab fee</p><p><strong>ART-328 Digital Photography II (4 Credits)</strong><br/>Emphasis on visual thinking and exploring the relationship between concept and image while encouraging multiple solutions to any given problem. Prerequisite: ART-228 or permission of instructor.  $60.00 lab fee.</p><p><strong>ART-331 Ceramics II (4 Credits)</strong><br/>Advanced study of clay forms and forming techniques using hand-built, wheel- thrown or a combination of these techniques. Investigations in clay and glaze formulation and kiln firing. Research into contemporary expressions in the ceramic field is a component of this course. Prerequisite: ART-124, ART-231 or ART-232  $60.00 lab fee</p><p><strong>ART-341 Advanced Sculpture (4 Credits)</strong><br/>Investigations of sculptural forms and expressions in a variety of media including continued figurative study. Viewing and analysis of a broad spectrum of historical and contemporary sculpture as a basis.  $75.00 lab fee</p><p><strong>ART-351 Fibers II (4 Credits)</strong><br/>Individualized investigation of advanced fiber and textile techniques. Conceptual fiber arts approaches will be explored while learning advanced fiber methods. Prerequisite: ART-251, 252, or 253, 342, 343, or 343A.  $60.00 Lab fee.</p><p><strong>ART-361 Intaglio Printmaking (4 Credits)</strong><br/>(PA) Etching, engraving, drypoint, and aquatint techniques will be explored along with press operation, printshop etiquette and professional standards in editioning. Emphasis on technical development, aesthetics and contemporary issues in intaglio printmaking. Students will work collectively on a print portfolio with a common theme of their choosing.  $100.00 lab fee</p><p><strong>ART-362 Screen Printing (4 Credits)</strong><br/>(PA) This course explores the techniques and processes of fine art printmaking methods in the category of Screen Printing (Serigraphy). General techniques covered are reduction printing, photo silkscreening, fabric printing, and multi-color registration. These general methods will be accompanied by a discussion of the history of printmaking and the rise of mechanical reproductive technology to provide context.   $90.00 lab fee.</p><p><strong>ART-377 Issues in Contemporary Art (4 Credits)</strong><br/>(PA) This course examines art from the 1960s through the present day, organized around key issues that shaped artistic practice across the globe during this period. The course looks at traditional modes of artmaking (painting, sculpture) while considering the simultaneous rejection of modernist modes in favor of more collaborative, ephemeral, and multimedia approaches that further blur the boundaries between high and mass culture. Emphasis placed on examining artworks and a broader visual culture through the lens of a variety of contextual frameworks: formal, authorial, socio-cultural, and identity-based (race, class, gender, and sexuality, for instance).   $60.00 lab fee</p><p><strong>ART-382 Teaching Elementary Art (4 Credits)</strong><br/>(PA) Introduction to art media, techniques and teaching philosophies relating to the elementary classroom teacher. Design fundamentals, classroom management strategies also covered. Prerequisite: Admission to Teacher Education and EDUC-301.  $60.00 lab fee.</p><p><strong>ART-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>ART-399 Directed Study (1-2 Credits)</strong><br/>199, 299, 399, 499 Directed Study (1+)  Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of the instructor.  $40.00 lab fee may be applicable.</p><p><strong>ART-400 Independent Study (1-2 Credits)</strong><br/></p><p><strong>ART-411 Adv. Studio Problem: Drawing & Painting (4 Credits)</strong><br/>Advanced exploration in two-dimensional media, emphasizing historical and contemporary practice and personal expression. Prerequisite: ART-311. Repeatable for credit.  $100.00 lab fee</p><p><strong>ART-431 Advanced Studio Problem: Ceramics (4 Credits)</strong><br/>Continuation of ART-331 with an emphasis on development of personal expression. Glaze material study and testing is part of the coursework. Prerequisite: ART-331 Repeatable for credit.  $60.00 lab fee.</p><p><strong>ART-441 Advanced Studio Problem: Metals (4 Credits)</strong><br/>Continuation of 341 with emphasis on development of personal expression. Welded and/or cast metal included. Prerequisite: ART-341. Repeatable for credit.  $60.00 lab fee.</p><p><strong>ART-451 Advanced Studio Problem: Fibers (4 Credits)</strong><br/>Continuation of 351 with emphasis on development of personal expression. Research on textile materials and processes, advanced design applications including color theory. Prerequisite: ART-351. Repeatable for credit.  $60.00 lab fee.</p><p><strong>ART-492 Senior Art Inquiry I (4 Credits)</strong><br/>Concentrated study in one medium or related media to produce a coherent body of original work for the senior exhibition. An artist statement is developed. Consists of weekly working sessions and periodic group critiques with faculty in relevant media. Portfolio development and capstone experience culminating in exhibition of the work. Prerequisites: a media sequence by the end of junior year in the media chosen for the exhibition.</p><p><strong>ART-493 Art Education Studio (1 Credits)</strong><br/>A compilation of the work accomplished, demonstrating expertise in five areas of art over four years of coursework in studio art. Capstone experience culminating in exhibition of the work is required. (Art Education Specialist Only)</p><p><strong>ART-499 Directed Study (1-2 Credits)</strong><br/>199, 299, 399, 499 Directed Study (1+)  Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and the instructor.  </p>');",
  "scrape_metadata": {
    "original_title": "Art",
    "dept_slug": "art",
    "original_url": "https://augustana.edu/academics/areas-of-study/art",
    "courses_url": "https://augustana.edu/academics/areas-of-study/art/courses",
    "scrape_timestamp": "2025-09-26 19:56:49",
    "status": "success"
  }
}