{
  "program_title": "Asian Studies course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/asian-studies/courses",
  "faculty": [],
  "requirements": {
    "major_in": "28 credits, of which 16 credits must be at the 300 level or higher. Required courses: ASIA 451, at least 8 credits in Chinese or Japanese language, at least 4 credits in RELG from 284, 287, 384, or 387, and at least 4 credits in HIST 250, 252, 350, 355, or 358. These courses, if not required, can be used as electives. The remaining credits can be fulfilled from the following electives: Chinese or Japanese language 200 levels and above; Non-language courses including ARHI 372, ASIA 200 and ASIA 300 CHST 240, 260, 340, ECON 406, ENGL 295, HIST 150, 151, 250, 252 350, 355, 358, ISS 353/354, ISS 355, JPST 210, 220, 230, 250, 370 KINS 270, POLS 318, RELG 212, 284, 287, 384, 387, and any of the courses not already taken as a required RELG or HIST course. Other courses approved by the Asian Studies program faculty on a case-by-case recommendation may be added.",
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": "20 credits, of which no more than 8 credits may be in Asian languages (Chinese or Japanese), and the remaining 12-20 credits would be from other Asia –focused classes listed below. Other courses approved by the Asian Studies program faculty on a case-by-case recommendation may be added. ARHI-372 (PP, G) Asian Art ASIA-200 (PH, G) Intro to Asian Studies ASIA-300 (PH, G) Intro to Asian Studies ASIA-451 Senior Project CHNS-101 First Year Chinese I CHNS-102 First Year Chinese II CHNS-201 Second Year Chinese I CHNS-202 Second Year Chinese II CHNS-301 Third Year Chinese I CHNS-302 Third Year Chinese II CHNS-401 Fourth Year Chinese I CHNS-402 Fourth Year Chinese II CHST-240 (PH, G) Intro Chinese Culture CHST 260 (PA, G): Intro to Chinese Cinema CHST-340 (PH, G) Intro Chinese Culture ECON-406 (PH, G) Development Economics ENGL-295 (PH, G) Women, Health In/& South Asian Lit HIST-150 (PP, G) Problems in East Asian History to 1600 HIST-151 (PP, G) East Asia Making Modern World HIST-250 (PP, D) Parade of Nations HIST-252 (PP, G) Epic China HIST-350 (PP, G) Modern China in a Century of Revolution HIST-355 (PP, G) Japanese Empire & Its Ashes HIST-358 (PP, G) History Versus Heritage ISS-353 / 354 Beautiful Bangladesh ISS-355 Service Learning in Cambodia JPN-101 First Year Japanese I JPN-102 First Year Japanese II JPN-201 Second Year Japanese I JPN-202 Second Year Japanese II JPN-220 (G, 8 credits) Second Level Japanese JPN-221 (G, 6 credits) Second Level Japanese JPN-301 Third Year Japanese I JPN-302 Third Year Japanese II JPN-320 (G, 8 credits) Third Level Japanese JPN-321 (G, 6 credits) Third Level Japanese JPN-401 (2 credits) Japanese Language Practicum I JPN-402 (2 credits) Japanese Language Practicum II JPN-420 (G, 8 credits) Fourth Level Japanese JPN-421 (G, 6 credits) Fourth Level Japanese JPST-210 (PP, G) Japanese Folk Tales JPST-220 (PL, G) Japanese Masterpieces in Translation JPST-230 (PA, G) Japanese Theatre JPST-250 (PH, G) Japanese Culture & Society JPST-370 (PL, G) Women's Literature From Japan KINS-270 (PS, G) Japan Sport and Culture POLS-318 (PS, G) China in World Affairs RELG-284 (PH, G) Buddhism and Film RELG-287 (PP, G) Religion & Philosophy of India RELG-384 (PH, G) Buddhism and Film RELG-387 (PL, G) Religions of China and Japan",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=asia",
  "courses_html": "document.write('<p><strong>ASIA-100TR Asian Studies Elective (1-12 Credits)</strong><br/></p><p><strong>ASIA-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>ASIA-400 Independent Study (1-2 Credits)</strong><br/></p><p><strong>ASIA-451 Senior Project (4 Credits)</strong><br/>Independent research and seminar supervised by faculty who have offered courses in the Asian Studies program. As part of the seminar, students survey the literature, identify key topics, develop thesis statements, analyze primary and secondary sources, develop original work  and complete an individual research project with the Asian Studies advisor and faculty supervisors.  This course should be taken in the fall of senior year.</p><p><strong>ASIA-499 Directed Study (1-2 Credits)</strong><br/></p>');",
  "scrape_metadata": {
    "original_title": "Asian Studies",
    "dept_slug": "asian-studies",
    "original_url": "https://augustana.edu/academics/areas-of-study/asian-studies",
    "courses_url": "https://augustana.edu/academics/areas-of-study/asian-studies/courses",
    "scrape_timestamp": "2025-09-26 19:56:54",
    "status": "success"
  }
}