{
  "program_title": "Biology course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/biology/courses",
  "faculty": [],
  "requirements": {
    "major_in": "32 credits, including three core courses (BIOL-130, 140, 250), an approved 4 credit SI, and 16 elective credits at the 300-400 level. Also 1 year of General Chemistry (CHEM-131 and 132). A student must take at least one of the following courses (BIOL 324, BIOL 343, BIOL 351, BIOL 360, BIOL 362, BIOL 371, BIOL 375, BIOL 386, BIOL 387). A student who completes a sanctioned SI experience as a requirement of a second major may substitute a non-SI biology course at the 200 level or above for the 4-credit SI experiences listed above, with prior approval granted by the departmental coordinator. A student can count multiple courses from BIOL-464, BIOL-465, BIOL-466 toward the biology major; because the option to enroll in additional SI courses is based on enrollment demands, prior approval must be granted by the departmental coordinator. A student can apply only 2 credits from this list toward the biology major: BIOL-299, BIOL-399, BIOL-499, BIOL-400, BIOL-INTR-xx. Required supporting courses (8 credits): CHEM-131 and CHEM-132 or equivalent. Recommended supporting courses: statistics. Additional recommended supporting courses for students expecting to work toward a M.S. or Ph.D. in the biological sciences: CHEM-321, CHEM-322; MATH-160; PHYS-151, PHYS-152 or PHYS-211, PHYS-212. 28 credits, including BIOL-130, BIOL-140, BIOL-250, BIOL-310, BIOL-343, One of BIOL-360 or BIOL-362, one of BIOL-386 or BIOL -387; one 4 credit SI experience from biology chosen from BIOL-464, BIOL-465, BIOL-466 or the combination of EDUC-422, EDUC-450 and INTR-EDA90 as part of the Secondary Education program. See the Director of Secondary Education for more details. Required supporting courses (28 credits): CHEM-131, CHEM132, PHYS-151, PHYS-152, ASTR-142, GEOG-105, GEOL-101.",
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": "20 credits, including 130, 140, 250, and 8 elective credits at the 300-400 level. Also 1 year of General Chemistry (CHEM-131 and 132). A student can apply only 2 credits from this list toward the biology minor: BIOL-299, BIOL-399, BIOL-499, BIOL-400, BIOL-INTR-xx. Required supporting courses (8 credits): CHEM-131 and CHEM-132 or equivalent.",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=biol",
  "courses_html": "document.write('<p><strong>BIOL-100 Our Microbial World (4 Credits)</strong><br/>(PN) Microorganisms are ubiquitous, even though we cannot see them with our naked eye. During this J-term, we will focus on the role of microbes in many of life\\'s activities. You may be familiar with microbes as disease causing organisms, but we\\'ll also think about the role that microbes play in our diet, health, and civilization. Our discussions and activities will explore the role of microbes in societal topics. This course will include opportunities for hands-on lab activities. Seniors by permission only.</p><p><strong>BIOL-100B Science & Pseudoscience (4 Credits)</strong><br/>(PN) Are vaccines safe? Is evolution real?  We are surrounded by claims about what is safe and healthful, about how nature works, and about extraordinary things. How reliable are these claims? In this class you will research and present a case study on the controversial scientific or pseudoscientific topic of your choice.   This class is intended for non-science majors, and has no prerequisites.  Seniors by permission only.</p><p><strong>BIOL-100C Insects & Society (4 Credits)</strong><br/>(PN) Insects are the little creatures that run the world. In this course we will study the many ways in which insects impact human lives. The strange world of insects provides an exciting lens to examine the mechanisms of evolution. In addition to the study of the insect natural history and its implication on our lives, we will use our study of insects to broadly examine how science informs decision making in terms of risk assessment. Students will examine how the use of insecticides and GMOs are assessed and regulated leading to an understanding of how scientists help make decisions that broadly impact society. In this course students will read and discuss material ranging from news articles and pop culture to peer-reviewed scientific articles. In addition to classroom time students will spend time in the lab immersed in hands-on learning that will incorporate the Augustana Insect Museum collections and live insect cultures.  Seniors by permission only.</p><p><strong>BIOL-100D Expl. Biology-Physics (4 Credits)</strong><br/>(PN) The purpose of this course is to provide you with a conceptual framework for understanding how major principles of physics are use to understand and explain how biology, and life, works. Topics will include how organisms sense their surroundings and move with intention, how plants and animals convert energy into different useable forms, and how radiation is used for destruction and disease treatment. Hands-on labs will be integrated into the course to put the concepts into action. In support of the goal of promoting scientific literacy for all, this course will culminate in a group presentation where you will propose and carry out a lesson plan that seeks to the public on a topic of interest using engaging, hands-on activities.</p><p><strong>BIOL-101A Gen Biology-A Level (4 Credits)</strong><br/></p><p><strong>BIOL-101AP AP Biology (4 Credits)</strong><br/></p><p><strong>BIOL-101IB General Biology IB (4 Credits)</strong><br/></p><p><strong>BIOL-105TR Nutrition Transfer (0-9 Credits)</strong><br/></p><p><strong>BIOL-130 Molecules to Cells (4 Credits)</strong><br/>This course serves as an introduction to macromolecules, cellular processes, and cellular organization of diverse organisms. Emphasis on the molecular mechanisms of cell structure and function, including metabolism, replication, gene expression, signal transduction and cell cycle regulation. Includes one two-hour lab weekly. Prerequisite: This course is intended for Biology Majors. Students can take BIOL-130 and BIOL-140 in any order, but cannot enroll concurrently.</p><p><strong>BIOL-130L Lab for 130 (0 Credits)</strong><br/></p><p><strong>BIOL-140 Organisms to Ecosystems (4 Credits)</strong><br/>An exploration of the diversity of life, its origins, structure, function and interactions among organisms and their environment. We introduce key concepts in evolution and ecology, provide an overview of the features of major taxonomic groups and their evolutionary relationships. Includes one two-hour lab weekly. Prerequisite: This course is intended for Biology Majors. Students can take BIOL-130 and BIOL-140 in any order, but cannot enroll concurrently.</p><p><strong>BIOL-140L Lab for 140 (0 Credits)</strong><br/></p><p><strong>BIOL-171 Clinical Microbiology (4 Credits)</strong><br/>A systematic examination of the microbial world, with an emphasis on pathogens. Topics covered include morphology, physiology, and genetics as well as the metabolic and enzymatic reactions associated. Strategic techniques for the growth, isolation and visualization of microbes are included as are microscopic and diagnostic methods. The causative agents and treatment strategies of various pathogens are emphasized. Viral composition, replication and the associated disease states are also covered in detail. Students must be concurrently registered in the Laboratory section.  This class does not count towards the Biology major.</p><p><strong>BIOL-171L Lab for 171 (0 Credits)</strong><br/></p><p><strong>BIOL-199 Directed Study (1-2 Credits)</strong><br/>199, 299, 399, 499 Directed Study (1+)  Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and instructor.</p><p><strong>BIOL-250 Genetics (4 Credits)</strong><br/>Basic genetic principles of heredity and variation, including transmission genetics, molecular genetics and population genetics. Research methods and techniques are stressed throughout the course. This course extends the study of genetic principles introduced in BIOL-130. Prerequisite: BIOL-130 and BIOL-140.</p><p><strong>BIOL-251 Anatomy & Physiology I (4 Credits)</strong><br/>A concentrated introduction to the biology of human beings. Emphasis on the structure and function of the cell, tissue types, skeletal, muscular, nervous and endocrine systems. Four hours of lecture and two hours of anatomy/physiology laboratory per week. This class does not count towards the Biology major.  Credit in biology will not be given for both BIOL-251 and 252 and BIOL-351 and 362.</p><p><strong>BIOL-251L Lab for 251 (0 Credits)</strong><br/></p><p><strong>BIOL-252 Anatomy & Physiology II (4 Credits)</strong><br/>A concentrated introduction to the biology of human beings. Emphasis on the structure and function of the cardiovascular, lymphatic, digestive, urinary, and reproductive systems. Four hours of lecture and two hours of anatomy/physiology laboratory per week. This class does not count towards the Biology major. Prerequisite: BIOL-251. Credit in biology will not be given for both BIOL-251 and 252 and BIOL-351 and 362.</p><p><strong>BIOL-252L Lab for 252 (0 Credits)</strong><br/></p><p><strong>BIOL-255TR A & P I Transfer (3-4 Credits)</strong><br/></p><p><strong>BIOL-256TR A & P II Transfer (3-4 Credits)</strong><br/></p><p><strong>BIOL-299 Directed Study (1-2 Credits)</strong><br/>199, 299, 399, 499 Directed Study (1+)  Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and instructor.</p><p><strong>BIOL-301 Anatomy of Italy (4 Credits)</strong><br/>Investigate the development of anatomy and medicine in Renaissance Italy. This course explores the roots of anatomy as a modern science. During J-term students and instructors will study in Rome, Florence, and Padua. While in Italy, students will compare anatomical waxes to modern anatomical representations, as well as study the anatomy in works of art by Michelangelo, da Vinci, and others. Visit the universities where anatomy as a modern science began. Walk the same halls as Vesalius and Harvey and stand in the dissection theaters of influential anatomists.</p><p><strong>BIOL-310 Evolutionary Biology (4 Credits)</strong><br/>The mechanisms for evolutionary change at both the population and species level, as well as an overview of the history of life and phylogenetic inference. Prerequisite: BIOL 250 Genetics.</p><p><strong>BIOL-324 Tech in Nat History (4 Credits)</strong><br/>Lab and field based course to learn professional methods used in natural history collections and their value for the advance of science and society. The course will use plants and insects as model organisms and students will learn how to collect, mount and curate specimens. They will also gain skills on digitization, participation in Citizen Science projects, illustration techniques, and DNA extraction.</p><p><strong>BIOL-327 Conservation Biology (4 Credits)</strong><br/>(PH) Discussion based investigation and survey of questions centered on the science of natural resource protection and management including the human dimension. Prerequisite: BIOL-130 and BIOL-140, or  ENVR-100 and ENVR-101 or permission of instructor.</p><p><strong>BIOL-329 Global Change Biology (4 Credits)</strong><br/>This course will provide opportunities for students to examine (a) evidence for global climate change, (b) model forecasts of various climate change scenarios, and (c) predicted responses of living systems, e.g., individuals, species, and ecosystems, to climate change. In class research projects will assess predicted responses of living systems to climate change using relevant published data in journal articles and Internet sources. Includes an appraisal of the human social, economic, and political dimensions (i.e., causes and consequences) of global change biology. Prerequisite: BIOL-140.</p><p><strong>BIOL-335 Entomology (4 Credits)</strong><br/>(PN) Insects impact human life in many important ways as drivers of ecological systems. This discussion based course will give an overview of the diversity and evolution of insects as well as focus on important areas such as medical entomology, agricultural entomology, conservation biology, and cultural entomology. Prerequisite: BIOL-140 or permission of instructor.</p><p><strong>BIOL-343 Microbiology (4 Credits)</strong><br/>An overview of the morphology, physiology, epidemiology, and evolution of diverse microorganisms with an emphasis on bacteria. Students will also investigate the current impact of specific microbes on a human population. Includes one three-hour lab weekly. Prerequisite: BIOL-250 or Permission of Instructor.</p><p><strong>BIOL-343L Lab for 343 (0 Credits)</strong><br/></p><p><strong>BIOL-345 Principles of Immunology (4 Credits)</strong><br/>An overview of the human immune system with an emphasis on understanding the humoral and cell-mediated responses at the cellular and molecular levels. Students will present on current advances in applied immunology (e.g., autoimmunity, vaccination, transplantation, tumor immunology, inherited immunodeficiencies). Prerequisite: BIOL-250.</p><p><strong>BIOL-348 Cell Signaling (4 Credits)</strong><br/>Overview of cell signaling pathways, regulation of cell shape, growth, division, and differentiation. Students will develop an understanding of information flow through the various cell signaling pathways and networks. Prerequisites: BIOL-250.</p><p><strong>BIOL-351 Human Anatomy (4 Credits)</strong><br/>Study of the structure and three-dimensional relationships of the human body, as taught from a regional perspective. Includes one two-hour lab weekly.</p><p><strong>BIOL-351L Lab for 351 (0 Credits)</strong><br/></p><p><strong>BIOL-358 Neuroanatomy (4 Credits)</strong><br/>The structure, three-dimensional relationships and function of the central and peripheral nervous system of humans, correlated with abnormal function. Prerequisite: BIOL-351 or permission of instructor.</p><p><strong>BIOL-360 Comparative Physiology (4 Credits)</strong><br/>This course is a comparative study of animal physiology from a cellular, organ, and organismal perspective. Students will examine nervous, endocrine, muscle, cardiovascular, respiratory, renal, and digestive systems among mammals and other vertebrate animals. Students will develop skills in data acquisition, analysis, and presentation through the use of primary literature and laboratory experiments. Includes one two- hour lab weekly. Credit may not be earned in both Human Physiology and Comparative Physiology. Prerequisites: BIOL-130 and BIOL-140.</p><p><strong>BIOL-360L Lab for 360 (0 Credits)</strong><br/></p><p><strong>BIOL-362 Human Physiology (4 Credits)</strong><br/>Looks at the structural and functional organization of various organ systems, including the endocrine, nervous, muscle, cardiovascular, respiratory, renal, and digestive systems in humans. Furthermore, this course explores the homeostatic control systems as well as mechanisms of coordination between the various organ systems. Students will develop skills in data acquisition, analysis, and presentation through the use of primary literature and laboratory experiments. Includes one two-hour lab weekly. Credit may not be earned in both Human Physiology and Comparative Physiology. Prerequisite: BIOL-130 and Sophomore status.  Both the lecture section and lab section must be taught by the same professor.</p><p><strong>BIOL-362L Lab for 362 (0 Credits)</strong><br/></p><p><strong>BIOL-371 Intro Biomolec Research (4 Credits)</strong><br/>This course provides students opportunities for a rich collaborative research experience. The content will include learning relevant background material around the guiding questions, in addition to the fundamentals of the research process itself, such as productivity skills (organization, planning, preparation, time management), laboratory skills (use of equipment, protocols), experimental skills (experimental design, execution and interpretation, controls), presentation skills (communication), and laboratory/community citizenship. Prerequisite: BIOL 250 or permission of instructor. May not take this course if BIOL-375 has already been taken.</p><p><strong>BIOL-373 Developmental Biology (4 Credits)</strong><br/>This course studies the principles of development in animals. A study of the developmental processes that occur within the organelles, cells, tissues, organs and organ systems of animals. Topics will include fertilization, embryology, growth, differentiation, and morphogenesis. These are examined from classical morphological to experimental perspectives. Lectures include primary literature discussions and conversations about the ethical implications of developmental topics. Prerequisites: BIOL-250. Offered every other year.</p><p><strong>BIOL-375 Molecular Genetics (4 Credits)</strong><br/>A study of the structure, function and regulation of prokaryotic genes with emphasis on the organization of metabolic pathways. This predominantly lab-based course uses techniques commonly performed in a molecular genetics lab, including bioinformatics, recombinant DNA, DNA sequencing, and site-directed mutagenesis. Includes one three-hour lab weekly. Prerequisites: BIOL-250 and permission of instructor. May not take this course if BIOL-371 has already been taken. This course can be taken either as an elective or in fulfillment of SI requirements, but not both.</p><p><strong>BIOL-375L Lab for 375 (0 Credits)</strong><br/></p><p><strong>BIOL-380 Special Topics (4 Credits)</strong><br/>Treatment in depth of selected topics not covered in the general undergraduate offering. Past offerings have included virology, local flora, and animal behavior. May be repeated for credit if course content differs significantly.  Course description for Spring Term 2025 Molecular Mechanisms of Disease  In this course we will explore the molecular underpinnings of human diseases, delving into the molecular and cellular biology that drive the pathology. According to the CDC and WHO, these are the most common causes of death: Heart disease, Cancer, COVID-19, Stroke (cerebrovascular diseases), Chronic lower respiratory diseases, Alzheimer\\'s disease (other neurodegenerative diseases), Diabetes/obesity, Nephritis, nephrotic syndrome, and nephrosis, Chronic liver disease and cirrhosis, Tuberculosis, HIV/AIDS, Malaria. We will cover 4-7 topics from this list above diving into the genomic alterations, cellular signaling, protein misfolding, and any other relevant cellular dysregulation to a specific disease. The course will include interactive discussions of primary research to develop the understanding of topics, including the relationship between mechanisms of disease and the pathway to therapeutics. Pre-req BIOL250 Genetics.</p><p><strong>BIOL-380A Basic Virology (4 Credits)</strong><br/> In this course, students will learn to discern the different families of viruses and understand the characteristics (e.g., genome types and replication processes) used to characterize viral families. Students will also be able to describe the various effects that viruses have on host cells and will be able to explain the three current theories of viral evolution. Infection by sub-viral disease agents (e.g., prions, viroids, satellite viruses/virusoids) will also be discussed in this course. As a final project, each student will investigate (via literature review) one unusual virus that we have not covered in the course and present their findings to the class, showing proper use of terminology and an understanding of basic virology concepts. Current topics in the primary literature and/or case studies of historical viral outbreaks will be the focus for weekly synchronous discussions. Prerequisite: BIOL130 or BIOL210. A genetics course (BIOL250 or BIOL370) is strongly suggested.</p><p><strong>BIOL-380B Hist Biological Thought (4 Credits)</strong><br/>By taking the History of Biological Thought, students are seeking to understand the history of biology. In order to understand, you must explain, interpret, apply, and analyze the ideas of the people who have influenced the history of biology. We will focus on the great biologists and their contributions to the development of biological concepts from ancient Greece to the present. Prerequisite: Take BIOL-130 and BIOL-140.</p><p><strong>BIOL-386 Ecology (4 Credits)</strong><br/>The ecology of prokaryotes, plants, and animals at the organism, population, community, and ecosystem level. Includes one three-hour lab weekly which focuses on data analysis and design of hypothesis testing experiments. Prerequisite: BIOL-140 or ENVR-100.</p><p><strong>BIOL-386L Lab for 386 (0 Credits)</strong><br/></p><p><strong>BIOL-387 Aquatic Biology (4 Credits)</strong><br/>The ecology of freshwater ecosystems. This course is project based, and students will work in teams to provide and interpret professional quality environmental data for a selected habitat. Includes one three-hour lab weekly. Prerequisite: BIOL-130, BIOL-140 and BIOL-250 or permission of instructor. This course can be taken either as an elective or in fulfillment of SI requirements, but not both.</p><p><strong>BIOL-387L Lab for 387 (0 Credits)</strong><br/></p><p><strong>BIOL-392 Cancer Biology (4 Credits)</strong><br/>This course will explore the cellular and molecular mechanisms associated with various hallmarks of cancer, such as uncontrolled growth, evasion of cell death, and activation of cell invasion and metastasis during tumor progression. Experimental strategies and primary research literature will be used to facilitate our understanding of the origins, progression, and treatment of cancer. Finally, we will discuss the story of cancer from historical, societal, public health, and women\\'s health perspectives in order to understand the broader implications of cancer within and outside of the science discipline. Prerequisite: BIOL-250.</p><p><strong>BIOL-399 Directed Study (1-2 Credits)</strong><br/>199, 299, 399, 499 Directed Study (1+)  Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and instructor.</p><p><strong>BIOL-400 Independent Study (1-2 Credits)</strong><br/>400 Independent Study (1+) Opportunity for students to complete a project independently with a faculty mentor. Prerequisite: permission of department chair and instructor.</p><p><strong>BIOL-455 Human Gross Anatomy Lab (2 Credits)</strong><br/>In-depth study of the structure of the human body utilizing cadaver dissections. The course will discuss body donation and the ethics of cadaver usage as well as give students an opportunity to reflect on the overall experience. Prerequisites: BIOL-351 Human Anatomy and permission of instructor.</p><p><strong>BIOL-464 SI: Biological Literature (4 Credits)</strong><br/>Advanced study of the scientific process in biology, completed in the senior year. Students develop a research question and complete an extensive literature search on a topic, culminating in a formal report. Reflective essay component. coordinator; some sections may have added prerequisites determined by instructor.</p><p><strong>BIOL-465 SI: Laboratory/Field Research (4 Credits)</strong><br/>Senior Inquiry-Laboratory/Field Research   Advanced study of the scientific process in biology, completed in summer following the junior year or in the senior year. Students participate in a laboratory/field research project under the direction of an Augustana faculty mentor, culminating in a laboratory research notebook and at least one form of formal scientific reporting. Reflective essay component.</p><p><strong>BIOL-466 SI: Off Campus Lab/Field Research (4 Credits)</strong><br/>Advanced study of the scientific process in biology, completed in summer immediately preceding the senior year. Students participate in a lab/field research project as part of an 8-10 week research program at another institution, culminating in a laboratory research notebook and at least one form of scientific reporting as coordinated with the sponsoring institution and the departmental coordinator. Student secures approval of departmental coordinator in spring term of junior year prior to registering for fall term of senior year. Reflective essay component.</p><p><strong>BIOL-499 Directed Study (1-2 Credits)</strong><br/>199, 299, 399, 499 Directed Study (1+)  Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and instructor.</p><p><strong>BIOL-ELEC AP Biology (4 Credits)</strong><br/></p>');",
  "scrape_metadata": {
    "original_title": "Biology",
    "dept_slug": "biology",
    "original_url": "https://augustana.edu/academics/areas-of-study/biology",
    "courses_url": "https://augustana.edu/academics/areas-of-study/biology/courses",
    "scrape_timestamp": "2025-09-26 19:57:01",
    "status": "success"
  }
}