{
  "program_title": "Chemistry course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/chemistry/courses",
  "faculty": [],
  "requirements": {
    "major_in": "28 credits beyond CHEM-132/235, including CHEM-255, CHEM-321, CHEM-322, CHEM-361 or 365, CHEM-441, CHEM-435, CHEM-471 and one Senior Inquiry chosen from CHEM-474, CHEM-475 or CHEM-476. Required supporting courses: PHYS-151/152 or 211/212 and MATH-160, 220, and 230 Recommended supporting courses: CHEM-181, BIOL-130, MATH-260, MATH-320, MATH-250, COMP-211, COMP-212.",
    "acs_major": "Students desiring an ACS-certified major must complete 36 credits beyond CHEM-132/235, including CHEM-255, CHEM-321, CHEM-322, CHEM-361, CHEM-365, CHEM-455, CHEM-441, CHEM-435, CHEM-471 and one Senior Inquiry chosen from CHEM-475 or CHEM-476. Required supporting courses: CHEM-181, PHYS-151/152 or 211/212 and MATH-160, 220, and 230. • Strongly recommend 200-level physics and Math 260 and/or 320. Recommended supporting courses: BIOL- 130, MATH-260, MATH-320, MATH-250, COMP-211, COMP-212.",
    "major_for_ed": "See the Director of Secondary Education and chair of the chemistry department for program requirements.",
    "minor_in": "12 Credits in chemistry beyond CHEM-132/235 at the 200-level or above. Required supporting course MATH 160 (Calculus I).",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=chem",
  "courses_html": "document.write('<p><strong>CHEM-101 Fundamentals of Chemistry (4 Credits)</strong><br/>(PN) Fundamentals of General Chemistry is a brief study of general chemistry, requiring a minimum of algebraic mathematics. Emphasis is placed on relating chemistry to selected everyday issues and applications. Especially appropriate for non-science majors. Does not count toward a chemistry or biochemistry major. May not be taken for credit after 131. May be taught as a J term course.</p><p><strong>CHEM-110 Cooking Is Chemistry (4 Credits)</strong><br/>(PN) This course is an introduction to the principles of chemistry through cooking.  No prior knowledge of chemistry is required.  Students will gain an understanding of the principles of preparing and cooking food, while developing an appreciation of chemistry through the practice of cooking and explore its significance in everyday life.  Does not count toward a chemistry or biochemistry major.  May be taught as a J term course. </p><p><strong>CHEM-111 Busting Myths (4 Credits)</strong><br/>(PN) CHEM-111 introduces students to experimental design and how to communicate experimental findings to the community. In this course, students will confirm or disprove, through experimentation, a host of societal perceptions, urban legends, and/or viral videos. Experimental results will be presented to the community using digital media. Laboratory work will be a major component of the course. Does not count toward a chemistry or biochemistry major. </p><p><strong>CHEM-112 Solving Crimes With Science (4 Credits)</strong><br/>(PN) An investigation of the scientific and technological aspects of forensic science. Topics will include evidence collection and preservation, trace evidence, drug analysis, toxicology, DNA profiling, and arson investigation. Does not count toward a chemistry or biochemistry major. May be taught as a J term course.</p><p><strong>CHEM-114 Molecules That Changed the World (4 Credits)</strong><br/>(PN) This course is intended to give students an appreciation of how chemists and chemistry affect everyday life by studying the impact of a class of molecules on our lives today.  Students will gain an understanding of the molecular paradigm of chemistry and how it enables chemists to design molecules to address essential human needs and wants.  Does not count toward a chemistry or biochemistry major.</p><p><strong>CHEM-117 Chemistry in the Environment (4 Credits)</strong><br/>(PN) An introductory course covering general chemistry topics as they relate to the environment. Throughout the course you will improve your scientific literacy by studying topics including atmospheric chemistry, water quality, reaction rates, and energy sources.  The course has no prerequisites and may not be taken for credit after successful completion of CHEM 132.  Does not count toward a Chemistry or Biochemistry major.</p><p><strong>CHEM-131 General Chemistry I (4 Credits)</strong><br/>(PN)Atoms, Ions, and Molecules   This course introduces the fundamentals of bonding to form ions and molecules from atoms, as well as how atoms and molecules interact with each other resulting in the properties of matter. Topics include atomic structure, chemical bonding theories, symmetry as it pertains to chemical equivalence, coordination compounds, gases, intermolecular forces, and colligative properties. Lecture and two hours of laboratory weekly.</p><p><strong>CHEM-131L Lab for 131 (0 Credits)</strong><br/></p><p><strong>CHEM-132 General Chemistry II (4 Credits)</strong><br/>Driving Forces  (PN) This course focuses on chemical reactions and how quickly and why they occur. Topics include stoichiometry,kinetics,thermochemistry, equilibrium, electrochemistry, and nuclear chemistry. Lecture and two hours of laboratory weekly. Prerequisite: CHEM 131 with a minimum grade of C or permission of the department.</p><p><strong>CHEM-132L Lab for 132 (0 Credits)</strong><br/></p><p><strong>CHEM-181 Chemical Safety (0 Credits)</strong><br/>This course will enable students to develop a broad background in the principles of chemical safety, provide a familiarity with common laboratory hazards, and introduce emergency response procedures.</p><p><strong>CHEM-199 Directed Study (1-2 Credits)</strong><br/>199, 299, 399, 499 Directed Study (1+)  Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and instructor.</p><p><strong>CHEM-200TR Chemistry Elective (1-12 Credits)</strong><br/></p><p><strong>CHEM-215 Intro to Molecular Nutrition (4 Credits)</strong><br/>(PN) CHEM-215 examines molecular structures and chemical reactions as they relate to the digestion, absorption and utilization of nutrients. Consequences of nutrient deficiency and excess, as well as their roles in human disease and prevention are included. Applied topics will also be addressed. The course is tailored to provide needed conceptual background for students majoring in public health, for those having interest in health policy, and those with an interest in their own health and nutrition. Although the course has no pre-requisites, successful completion of at least one high school or college level course in chemistry is expected. Does not count toward a chemistry or biochemistry major.</p><p><strong>CHEM-221LTR Tran Lab for CHEM-221TR (0-1 Credits)</strong><br/></p><p><strong>CHEM-221TR Organic Chem Transfer (3-5 Credits)</strong><br/></p><p><strong>CHEM-222LTR Trans Lab for CHEM-222TR (0-1 Credits)</strong><br/></p><p><strong>CHEM-222TR Organic Chem Transfer (3-5 Credits)</strong><br/></p><p><strong>CHEM-235 Intro to Inorganic Chemistry (4 Credits)</strong><br/>(PN) This course is an alternative to the one year of general chemistry (CHEM 121 and 122) curriculum. Students with a strong preparation in high school chemistry, such as credit for AP Chemistry (or equivalent) or two years of high school chemistry are encouraged to take this course. Topics covered include: atomic structure, periodic properties, descriptive inorganic chemistry, ionic solids, bonding theories, symmetry, electrochemistry, and coordination chemistry. Lecture and 3 hours of laboratory weekly.  Credit may not be earned for CHEM 235 and 131.  In order to have a full year of chemistry as required by many professional schools students may have to take another CHEM course (see the chair of the chemistry department) in addition to this course.</p><p><strong>CHEM-235L Lab for 235 (0 Credits)</strong><br/></p><p><strong>CHEM-245TR Transfer Biochemistry (3-5 Credits)</strong><br/></p><p><strong>CHEM-255 Quant Analytical Chemistry (4 Credits)</strong><br/>Theory and practice of chemical analysis, statistics, and basic laboratory instrumental analysis. Lecture, discussion and three hours of laboratory weekly. Prerequisite: CHEM 132 or 235 or permission of department.</p><p><strong>CHEM-255L Lab for 255 (0 Credits)</strong><br/></p><p><strong>CHEM-299 Directed Study (1-2 Credits)</strong><br/>199, 299, 399, 499 Directed Study (1+)  Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and instructor.</p><p><strong>CHEM-321 Organic Chemistry (4 Credits)</strong><br/>Survey of organic compounds: molecular structures, physical and spectroscopic properties, equilibrium, thermodynamics and introduction to reactivity and mechanisms. Specifically substitution, elimination, and addition reactions will be discussed. Lecture and three hours of laboratory weekly.  Prerequisite: CHEM 132 or 235 with a minimum grade of C or permission of instructor</p><p><strong>CHEM-321L Lab for 321 (0 Credits)</strong><br/></p><p><strong>CHEM-322 Organic Chemistry II (4 Credits)</strong><br/>Continuation of CHEM 321. Radical reactions, conjugated systems, aromatic substitutions, and reactions of carbonyl compounds, carboxylic acid derivatives, and amines will be discussed. A major topic of this course will be chemical synthesis.  Lecture, discussion and three hours of laboratory weekly. Prerequisite: CHEM 321 with a minimum grade of C or permission of instructor.</p><p><strong>CHEM-322L Lab for 322 (0 Credits)</strong><br/></p><p><strong>CHEM-345 Fundamentals of Biochemistry (4 Credits)</strong><br/>An introduction to the chemistry of biomolecules covering such topics as the functional groups of life, the structure and function of biomolecules including proteins, nucleic acids, carbohydrates, and lipids. Additionally, this course will provide an introduction to metabolism and biological energetics. Prerequisite: CHEM321 and BIOL 130 or permission of instructor. Does not count toward a chemistry or biochemistry major or minor. Can not earn credit for both CHEM 345 and 441.</p><p><strong>CHEM-361 Physical Chemistry (4 Credits)</strong><br/>Thermodynamics and Kinetics   Survey of thermodynamic principles with application to physical and chemical equilibria and of kinetics at the microscopic and macroscopic levels.  Prerequisite: CHEM 131 or 235, PHYS 152 or 212, MATH 220 , or permission of instructor</p><p><strong>CHEM-365 Physical Chemistry II (4 Credits)</strong><br/>Quantum Chemistry and  Spectroscopy   Survey of quantum theory with applications to systems of chemical interest - atoms, molecules, spectroscopy and reaction dynamics. Lecture and four hours laboratory weekly. Lecture and four hours laboratory weekly. Prerequisite: CHEM 131 or 235, PHYS 152 or 212, MATH 220 , or permission of instructor</p><p><strong>CHEM-365L Lab for 365 (0 Credits)</strong><br/></p><p><strong>CHEM-380 Special Topics in Chemistry (2-4 Credits)</strong><br/>This course will be an in-depth study of an advanced topic related to special interests of the faculty or to significant current developments in the field. May be lecture, laboratory, or both. Prerequisite: Permission of instructor. May be repeated if the topic is different. May be taught as a J-Term class</p><p><strong>CHEM-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>CHEM-399 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and instructor.</p><p><strong>CHEM-400 Independent (1-2 Credits)</strong><br/>Research on specific topics for seniors in Chemistry. Prerequisites: Department permission.</p><p><strong>CHEM-435 Advanced Inorganic Chemistry (4 Credits)</strong><br/>Bonding, structure, spectra, and reactions of inorganic and organometallic materials. Prerequisites: 322.</p><p><strong>CHEM-441 Biochemistry I (4 Credits)</strong><br/>Chemistry of proteins, enzymes, carbohydrates, and lipids with an emphasis on the structure-function properties of biomolecules. Additional topics include membranes, enzyme catalysis and regulation, bioenergetics and introduction of catabolic metabolism pathways and their control. Prerequisite: CHEM 322 and BIOL 130 or permission of instructor.</p><p><strong>CHEM-442 Biochemistry II (4 Credits)</strong><br/>A continuation of CHEM 441, with an emphasis on metabolic processes involved in synthesizing biomolecules, molecular control of DNA replication, transcription and protein translation, biomolecular methods, and current topics of interest. Much of the reading materials will be from the primary biochemical literature. Prerequisites: CHEM 441 and BIOL 250 or permission of instructor. Lecture plus three hours laboratory weekly. </p><p><strong>CHEM-442L Lab for 442 (0 Credits)</strong><br/></p><p><strong>CHEM-455 Instrumental Analysis (4 Credits)</strong><br/>Critical survey of spectroscopic, chromatographic, and electrochemical instrumental methods, principles, theory of operation and interpretation of results. Scanning probe and electron microscopies and thermal methods of analysis will also be covered. Lecture and four hours laboratory weekly. Prerequisites: 255 and 322 or permission of instructor.</p><p><strong>CHEM-455L Lab for 455 (0 Credits)</strong><br/></p><p><strong>CHEM-471 Inquiry in Chemistry (2 Credits)</strong><br/>Introduction to chemical literature sources and their use, online searching techniques, and presentation of literature research results. Other topics include research proposals and ethics in scientific inquiry.   Prerequisites: 322.</p><p><strong>CHEM-474 Senior Inquiry Research Proposal (2 Credits)</strong><br/>Senior Inquiry: Research Proposal. Literature search of an approved topic and formulation of a polished research proposal that includes an explanation of experimental approaches designed to answer a set of specific questions relating to the topic, and a discussion of possible outcomes and conclusions. Culminates in a polished written proposal, an oral presentation, and a reflective essay. Prerequisite or Corequisite: 471</p><p><strong>CHEM-475 Senior Inquiry Lab Research (2 Credits)</strong><br/>Senior Inquiry: Laboratory Research. Laboratory research project performed under the direction of a faculty mentor at Augustana College. At least 80 clock hours are spent in the laboratory during the first two terms of the senior year and/or during the summer preceding fall term of the senior year. Culminates in a laboratory research notebook, a polished research paper conforming to the style of relevant disciplinary journals, an oral departmental presentation, and a reflective essay. Prerequisite or Corequisite: 471.</p><p><strong>CHEM-476 Senior Inquiry Off Campus Lab Research (2 Credits)</strong><br/>Senior Inquiry: Off-Campus Laboratory Research. Laboratory research project performed as part of an undergraduate 8-10 week research program at another institution during the summer immediately preceding the senior year. Approval by the chemistry department chair is secured during the spring term of the junior year prior to registering for fall term of the senior year. Culminates in a laboratory research notebook, a polished research paper conforming to the style of relevant disciplinary journals, an oral departmental presentation, and a reflective essay. Prerequisite or Corequisite: 471</p><p><strong>CHEM-499 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and instructor.</p>');",
  "scrape_metadata": {
    "original_title": "Chemistry",
    "dept_slug": "chemistry",
    "original_url": "https://augustana.edu/academics/areas-of-study/chemistry",
    "courses_url": "https://augustana.edu/academics/areas-of-study/chemistry/courses",
    "scrape_timestamp": "2025-09-26 19:57:08",
    "status": "success"
  }
}