{
  "program_title": "Classics course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/classics/courses",
  "faculty": [],
  "requirements": {
    "major_in": "GREK or LATN 191 and 192 or equivalent; four (2-credit) classes at the 200 or 300 level in GREK and/or LATN with at least one course at the 300 level; at least one (4-credit) course from each of categories I-III (below); four additional credits from GREK or LATN 200 or 300 levels or from courses in categories I-IV; and the Classics SI (CLAS 401).* Three (2-credit) classes at the 200 or 300 level in GREK or LATN with at least one at the 300 level; at least one (4-credit) course from each of categories I-III (below); eight additional credits from GREK or LATN 200 or 300 levels or from classes in categories I-IV; and the Classics SI (CLAS 401).* *Students who complete a substantial SI in another major may substitute an additional 2-credit upper-level Greek or Latin course or a 300-level 4-credit Classics course from categories I-IV in consultation with their advisor.",
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": "GREK or LATN 191 and 192 or equivalent; three (2-credit) classes at the 200 or 300 level in GREK and/or LATN with at least one at the 300 level; and at least one (4-credit) course from two of categories I-III (below). Three (2-credit) classes at the 200 or 300 level in GREK or LATN with at least one at the 300 level; at least one (4-credit) course from two of categories I-III (below); and four additional Classics credits taken from GREK or LATN 200/300-levels, or categories I-IV (below). Eight credits taken from GREK at the 200 or 300 level (2-credits each), NTGR 201 (1-credit), or HEBR 101 (4-credits); and eight additional credits taken from HIST 306, CLAS 360, RELG 201, RELG 202, RELG 214, RELG 273, HEBR 101, NTGR 201 (1-credit), or 200/300 level Greek language courses (2-credits).",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors . No knowledge of Greek or Latin is required for the following courses. GREK courses numbered 200 and above are offered on a rotating basis and may be repeated for credit. Courses numbered 200 and above are offered on a rotating basis and may be repeated for credit.",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=clas",
  "courses_html": "document.write('<p><strong>CLAS-212 Classical Mythology (4 Credits)</strong><br/>(PL, G) The myths of the Greeks and Romans have had a lasting influence on our world, evident in art, literature, language, science, and beyond. This course offers a broad survey of the major Greek and Roman myths and the dominant approaches to understanding them. Utilizing ancient sources along with scholarly commentary, students will examine these myths in their broader cultural and historical contexts while considering the legacy ancient mythology has left in our world.  May not take CLAS-212 if CLAS-212W, CLAS-312 or CLAS-312W has already been taken.</p><p><strong>CLAS-212W Classical Mythology (4 Credits)</strong><br/>(PL, G) The myths of the Greeks and Romans have had a lasting influence on our world, evident in art, literature, language, science, and beyond. This course offers a broad survey of the major Greek and Roman myths and the dominant approaches to understanding them. Utilizing ancient sources along with scholarly commentary, students will examine these myths in their broader cultural and historical contexts while considering the legacy ancient mythology has left in our world. NB: CLAS 212W includes greater emphasis on considerations of gender and sexuality and is offered as a contributing course to the Gender, Sexuality, and the Cultural Imagination concentration for the WGSS major and minor.  May not take CLAS-212W if CLAS-212, CLAS-312 or CLAS-312W has already been taken.</p><p><strong>CLAS-222 The Art of History (4 Credits)</strong><br/>(PL) In antiquity, history was considered a literary genre. Herodotus, known as &quot;the father of history,&quot; composed a literary masterpiece that chronicles the Greeks\\' conflicts with their non-Greek neighbors, culminating in the Greeks\\' miraculous defeat of the Persian king Xerxes\\' attempt to conquer Greece in the early 5th century BCE. From a close reading of Herodotus\\' work, students will learn how he intertwined his investigations of the past with philosophical, political, and religious themes to create one of the most enduring stories of humanity itself.</p><p><strong>CLAS-224 Greek Tragedy (4 Credits)</strong><br/>(PL) Murder, incest, human sacrifice, cannibalism?! Just a sampling of the shocking situations Greeks put on stage in their tragedies -- but what did they gain from such performances? In this course, students will survey the ancient dramatic genre in its historical and cultural performance context, using representative examples by the playwrights Aeschylus, Sophocles, and Euripides. Adaptations and mutations of the genre, from the Roman tragedy of Seneca to &quot;Medea: The Musical&quot; and modern film adaptations, will also be studied and discussed.</p><p><strong>CLAS-226 Classical Comedy (4 Credits)</strong><br/>(PL) The comic plays of Greece and Rome not only offer insights into the social, political, and religious issues of their times, but also helped establish key trends in the development of comedy as we know it today. In this course, students will read representative plays from Aristophanes, Menander, Plautus, and Terence, examining them in their particular historical moment, considering particulars of production and staging while also looking at their continuing influence on our own comic productions.</p><p><strong>CLAS-228 Intro to Classical Epic (4 Credits)</strong><br/>(PH) Homer\\'s &quot;Iliad&quot; and &quot;Odyssey&quot; are the foundational texts of Greek civilization, while Vergil\\'s &quot;Aeneid&quot; is the most influential Roman equivalent. By coming to understand these epics in their historical and cultural contexts, students will examine how the Greek and Roman epics influenced and interacted with developing ideas of heroism, individual responsibility, communal identity, and the human condition in a hostile world, while re-interpretation of tradition refreshed these questions and answers over time.  May not take CLAS-228 if CLAS-228W, CLAS-328 or CLAS-328W has already been taken.</p><p><strong>CLAS-228W Intro to Classical Epic (4 Credits)</strong><br/>(PH) Homer\\'s &quot;Iliad&quot; and &quot;Odyssey&quot; are the foundational texts of Greek civilization, while Vergil\\'s &quot;Aeneid&quot; is the most influential Roman equivalent. By coming to understand these epics in their historical and cultural contexts, students will examine how the Greek and Roman epics influenced and interacted with developing ideas of heroism, individual responsibility, communal identity, and the human condition in a hostile world, while re-interpretation of tradition refreshed these questions and answers over time. NB: CLAS 228W includes greater emphasis on considerations of gender and sexuality and is offered as a contributing course to the Gender, Sexuality, and the Cultural Imagination concentration for the WGSS major and minor.  May not take CLAS-228W if CLAS-228, CLAS-328 or CLAS-328W has already been taken.</p><p><strong>CLAS-230 Sites & Monuments of Greece (4 Credits)</strong><br/>(PA, G) This course introduces students to the art and archaeology of Greece from the Bronze Age through the Hellenistic period. From the palaces of Minoan Crete to the Athenian Acropolis and beyond, students will have the opportunity to explore the ancient Greek world through its material remains, including art, architecture, and everyday objects. Questions of archaeological practice and cultural heritage will also be taken into account, along with consideration of the persistent influence of Greek art and architecture on our world today.  May not take CLAS-230 if CLAS-310, CLAS-311 or CLAS-330 has already been taken.</p><p><strong>CLAS-240 Women in Antiquity (4 Credits)</strong><br/>(PS, G) This course looks at the lives of women in antiquity from Bronze Age Crete to the early Roman Empire. Using textual, material, and artistic evidence, students will learn how women from slaves and prostitutes to the wives and mothers of emperors navigated their world. They will also examine how the Greeks and Romans defined the categories of masculine and feminine and how these categories were used in discourses of politics, law, religion, and medicine, while considering how ancient conceptions have shaped our contemporary views of gender roles. This course also contributes to the Gender and the Global Environment concentration for the WGSS major and minor.  May not take CLAS-240 if CLAS-340 has already been taken.</p><p><strong>CLAS-245 Race Ethnicity & Antiquity (4 Credits)</strong><br/>(PS, G) How did the people of ancient Greece and Rome think about race and ethnicity? This course centers on a broad examination of this question, including consideration of how prejudices in classical antiquity were located more in ethnic and cultural differences rather than in skin color; how slavery in the ancient world differed from its manifestation in the colonial US; how racial difference is presented in art and literature; and the influence of African cultures on Minoan, Greek, and Roman civilization. We will also consider contemporary issues touching on Classics and race, both within the discipline and beyond. NB: This course also contributes to the Identity and Difference concentration for the WGSS major and minor.  May not take CLAS-245 if CLAS-345 has already been taken.</p><p><strong>CLAS-250 Classics and Film (4 Credits)</strong><br/>(PL, G) Greek and Roman antiquity have captured the Western imagination for over 3,000 years. In this course, students will be asked to consider how filmmakers draw on classical myths, legends, and history to create stories that appeal to modern audiences, considering how, where, and why ancient stories are represented, reframed, or distorted in cinema and how these modern narratives can serve as a lens through which to examine the values and ideologies of our own society.</p><p><strong>CLAS-258 Greek Warrior Myths & Combat Trauma (4 Credits)</strong><br/>(PS, G)  In antiquity, much of the literature about war was composed and performed by veterans who had experienced battle firsthand and knew the difficulties of long separation from home and family. Other myths dealt with chronic illness, suicide, the death of a child, and other difficult topics. In recent years, these texts have been used to help people in our own society who have suffered from war, suicide, racial violence, incarceration, and more process their trauma and communalize their grief. This class will explore these uses through selections from ancient epic and tragedy, supplemented by scholarly commentary. Content Advisory: this course includes consideration of topics that may be difficult for some students.</p><p><strong>CLAS-260 Greek & Roman Religion (4 Credits)</strong><br/>(PH) How did the Greeks and Romans think about and worship their deities? In this course, students will examine how ancient Greeks and Romans conceptualized, interacted with, and even critiqued their gods through literature, cult practice, and philosophy; consider the role of religion in the communal and social settings of the Greco-Roman world; explore ideas about afterlife and immortality, and the relationship of the human world with the divine; and come to understand the &quot;divine man&quot; concept and the interaction of the &quot;pagan&quot; world with earliest Christianity.  May not take CLAS-260 if CLAS-360 has already been taken.</p><p><strong>CLAS-290 Greek & Latin Roots for Science (2 Credits)</strong><br/>The large vocabulary of technical terms used in the life sciences utilizes a relatively small number of Greek and Latin elements. A basic exposure to classical word roots can expand one\\'s scientific vocabulary and help unlock the meaning of a multitude of technical terms. To this end, this course offers a systematic approach to learning these roots, understanding the patterns in which they change, and recognizing the forms they take in anatomical and scientific terminology.</p><p><strong>CLAS-299 Directed Study (1-2 Credits)</strong><br/>A directed study course in classics is an opportunity for a student to study a particular subject under a faculty member\\'s close guidance. After formulating a written study plan and expectations for outcomes, the student will meet regularly with the faculty member throughout the term, receiving mentorship in scholarly activity and individualized feedback. While directed study courses may encompass a broad range of student learning experiences, most will result in a substantial research project. Prerequisite: permission of department chair and instructor.</p><p><strong>CLAS-310 Greek World From Afar (2 Credits)</strong><br/>This course introduces students to the art and archaeology of Greece from the Bronze Age through the Hellenistic period. From the palaces of Minoan Crete to the Athenian Acropolis and beyond, students will have the opportunity to explore the ancient Greek world through its material remains, including art, architecture, and everyday objects. Questions of archaeological practice and cultural heritage will also be taken into account, along with consideration of the persistent influence of Greek art and architecture on our world today. Short units on modern Greek language and culture will help prepare students for travel to Greece. This course is only open to students participating in the Greece Program. All students in CLAS 310 are required to register for CLAS 311 (2 credits) the following term.  May not take CLAS-310 if CLAS-230 or CLAS-330 has already been taken.</p><p><strong>CLAS-311 Greek World On-Site (2 Credits)</strong><br/>(PA, G) As a continuation of CLAS 310 or CLAS-330, this course will bring the sites and monuments the students have been studying in the classroom to life by giving them a first-hand look at the material remains of ancient Greece. We will continue to emphasize issues of archaeological practice and cultural heritage, while immersing ourselves in the world of modern Greece and practicing some of the modern Greek language we\\'ve learned. This course is only open to students participating in the Greece Program. Prerequisites: CLAS 310, CLAS-330, or RELG-214 in the term preceding travel. PA and G designations awarded after successful completion of both CLAS 310 and CLAS 311.</p><p><strong>CLAS-312 Classical Mythology (4 Credits)</strong><br/>(PL, G) The myths of the Greeks and Romans have had a lasting influence on our world, evident in art, literature, language, science, and beyond. This course offers a broad survey of the major Greek and Roman myths and the dominant approaches to understanding them. Utilizing ancient sources along with scholarly commentary, students will examine these myths in their broader cultural and historical contexts while considering the legacy ancient mythology has left in our world. NB: CLAS 312 runs concurrently with CLAS 212, but includes more specialized research requirements and is best suited for Classics students. Students outside of Classics should consult with the instructor before registering for this section.  May not take CLAS-312 if CLAS-212, CLAS-212W or CLAS-312W has already been taken.</p><p><strong>CLAS-312W Classical Mythology (4 Credits)</strong><br/>(PL, G) The myths of the Greeks and Romans have had a lasting influence on our world, evident in art, literature, language, science, and beyond. This course offers a broad survey of the major Greek and Roman myths and the dominant approaches to understanding them. Utilizing ancient sources along with scholarly commentary, students will examine these myths in their broader cultural and historical contexts while considering the legacy ancient mythology has left in our world. NB: CLAS 312W runs concurrently with CLAS 212W, but includes more specialized research requirements and is best suited for Classics students. Students outside of Classics should consult with the instructor before registering for this section. The W designation indicates that this section includes greater emphasis on considerations of gender and sexuality and is offered as a contributing course to the Gender, Sexuality, and the Cultural Imagination concentration for the WGSS major and minor.  May not take CLAS-312W if CLAS-212, CLAS-212W or CLAS-312 has already been taken.</p><p><strong>CLAS-328 Classical Epic (4 Credits)</strong><br/>(PH) Homer\\'s &quot;Iliad&quot; and &quot;Odyssey&quot; are the foundational texts of Greek civilization, while Vergil\\'s &quot;Aeneid&quot; is the most influential Roman equivalent. By coming to understand these epics in their historical and cultural contexts, students will examine how the Greek and Roman epics influenced and interacted with developing ideas of heroism, individual responsibility, communal identity, and the human condition in a hostile world, while re-interpretation of tradition refreshed these questions and answers over time. NB: CLAS 328 runs concurrently with CLAS 228, but includes more specialized research requirements and is best suited for Classics students. Students outside of Classics should consult with the instructor before registering for this section.  May not take CLAS-328 if CLAS-228, CLAS-228W or CLAS-328W has already been taken.</p><p><strong>CLAS-328W Classical Epic (4 Credits)</strong><br/>(PH) Homer\\'s &quot;Iliad&quot; and &quot;Odyssey&quot; are the foundational texts of Greek civilization, while Vergil\\'s &quot;Aeneid&quot; is the most influential Roman equivalent. By coming to understand these epics in their historical and cultural contexts, students will examine how the Greek and Roman epics influenced and interacted with developing ideas of heroism, individual responsibility, communal identity, and the human condition in a hostile world, while re-interpretation of tradition refreshed these questions and answers over time. NB: CLAS 328W includes greater emphasis on considerations of gender and sexuality and is offered as a contributing course to the Gender, Sexuality, and the Cultural Imagination concentration for the  WGSS major and minor. minor. NB: CLAS 328W runs concurrently with CLAS 228W, but includes more specialized research requirements and is best suited for Classics students. Students outside of Classics should consult with the instructor before registering for this section.  May not take CLAS-328W if CLAS-228, CLAS-228W or CLAS-328 has already been taken.</p><p><strong>CLAS-330 Sites & Monuments of Greece (4 Credits)</strong><br/>(PA, G) This course introduces students to the art and archaeology of Greece from the Bronze Age through the Hellenistic period. From the palaces of Minoan Crete to the Athenian Acropolis and beyond, students will have the opportunity to explore the ancient Greek world through its material remains, including art, architecture, and everyday objects. Questions of archaeological practice and cultural heritage will also be taken into account, along with consideration of the persistent influence of Greek art and architecture on our world today. NB: CLAS 330 runs concurrently with CLAS 230, but includes more specialized research requirements and is best suited for Classics students. Students outside of Classics should consult with the instructor before registering for this section. May not take CLAS-330 if CLAS-230 or CLAS-310 has already been taken.</p><p><strong>CLAS-332 Ancient Science (4 Credits)</strong><br/>(PP) Greek and Roman thinkers and practitioners established the foundations of the vocabulary and modes of thought of modern science, medicine, and mathematics. Students will survey the field of ancient science, beginning with the Pre-Socratic philosophers and continuing through Plato and Aristotle, Hellenistic science and technology, Lucretius and atomism, and into the Roman Empire. There is special focus on the cross-cultural definition of &quot;science,&quot; the value of investigating rejected theories, and the historical question of the degree to which scientific progress stalled under the Roman Empire.</p><p><strong>CLAS-334 Myst Manuscripts & Secret Knowledge (4 Credits)</strong><br/>(PP, G) This course is an introduction to the study of ancient manuscripts (palaeography, papyrology, and codicology), and the history of discovery and decipherment of mysterious texts from the ancient Mediterranean world (e.g., Egyptian hieroglyphs, Linear B, Etruscan). Students will explore the stories and contents of some famous &quot;mystery texts&quot; (e.g., Orphic Gold Tablets and Derveni Papyrus; Dead Sea Scrolls; Nag Hammadi Library / Gnostic Gospels); the ethical concerns about such artifacts; and the use of computers and technology in retrieving ancient texts and deciphering unknown scripts.</p><p><strong>CLAS-340 Women in Antiquity (4 Credits)</strong><br/>(PS, G) This course looks at the lives of women in antiquity from Bronze Age Crete to the early Roman Empire. Using textual, material, and artistic evidence, students will learn how women from slaves and prostitutes to the wives and mothers of emperors navigated their world. They will also examine how the Greeks and Romans defined the categories of masculine and feminine and how these categories were used in discourses of politics, law, religion, and medicine, while considering how ancient conceptions have shaped our contemporary views of gender roles. NB: This course also contributes to the Gender and the Global Environment concentration for the WGSS major and minor.  CLAS 340 runs concurrently with CLAS 240, but includes more specialized research requirements and is best suited for Classics students. Students outside of Classics should consult with the instructor before registering for this section. May not take CLAS-340 if CLAS-240 has already been taken.</p><p><strong>CLAS-345 Race Ethnicity & Antiquity (4 Credits)</strong><br/>(PS, G) How did the people of ancient Greece and Rome think about race and ethnicity? This course centers on a broad examination of this question, including consideration of how prejudices in classical antiquity were located more in ethnic and cultural differences rather than in skin color; how slavery in the ancient world differed from its manifestation in the colonial US; how racial difference is presented in art and literature; and the influence of African cultures on Minoan, Greek, and Roman civilization. We will also consider contemporary issues touching on Classics and race, both within the discipline and beyond. NB: This course also contributes to the Identity and Difference concentration for the WGSS major and minor.  CLAS 345 runs concurrently with CLAS 245, but includes more specialized research requirements and is best suited for Classics students. Students outside of Classics should consult with instructor before registering for this section.  May not take CLAS-345 if CLAS-245 has already been taken.</p><p><strong>CLAS-360 Greek & Roman Religion (4 Credits)</strong><br/>(PH) How did the Greeks and Romans think about and worship their deities? In this course, students will examine how ancient Greeks and Romans conceptualized, interacted with, and even critiqued their gods through literature, cult practice, and philosophy; consider the role of religion in the communal and social settings of the Greco-Roman world; explore ideas about afterlife and immortality, and the relationship of the human world with the divine; and come to understand the &quot;divine man&quot; concept and the interaction of the &quot;pagan&quot; world with earliest Christianity. NB: CLAS 360 runs concurrently with CLAS 260, but includes more specialized research requirements and is best suited for Classics students. Students outside of Classics should consult with the instructor before registering for this section.  May not take CLAS-360 if CLAS-260 has already been taken.</p><p><strong>CLAS-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>CLAS-399 Directed Study (1-2 Credits)</strong><br/>A directed study course in classics is an opportunity for a student to study a particular subject under a faculty member\\'s close guidance. After formulating a written study plan and expectations for outcomes, the student will meet regularly with the faculty member throughout the term, receiving mentorship in scholarly activity and receiving individualized feedback. While directed study courses may encompass a broad range of student learning experiences, most will result in a substantial research project. Prerequisite: permission of department chair and instructor.</p><p><strong>CLAS-400 Independent Study (1-2 Credits)</strong><br/>An independent study course in classics allows a self-motivated student with well-developed research skills to conduct a high-level individual research project under a faculty member\\'s guidance. After a research proposal has been accepted, the student will work independently throughout the term, consulting the faculty mentor on an at-need basis. While independent study courses may encompass a broad range of student learning experiences, most will result in a substantial research project. Prerequisite: permission of department chair and instructor.</p><p><strong>CLAS-401 Classics Senior Inquiry (4 Credits)</strong><br/>In the senior inquiry experience in classics, students work reflectively in conjunction with a faculty mentor to develop a research project that is both personally meaningful and significant to the field as a whole. Most SI projects in classics will result in a substantial (20+ page) research paper, but in the case of students planning on teaching at the primary or secondary levels, other possible outcomes (i.e., teaching portfolios, pedagogy-based projects) are encouraged. Prerequisite: permission of department chair and instructor.</p><p><strong>CLAS-INTR Classics Internship (0-12 Credits)</strong><br/>CLAS-INTR-AXX Academic Internship (0-8). Students who participate in significant extramural academic learning experiences that significantly enhance their education in classics may, with departmental approval, qualify for academic credit. These experiences may include archaeological excavations, museum internships, or other related activities. Prerequisite: a declared major or minor in Classics or Classical Studies.  CLAS-INTR-Exx Experiential Internship (0-4). Students who participate in significant extramural activities where they apply their skills in a job-like environment may, with departmental approval, qualify for academic credit. These activities may include but are not limited to teaching or museum internships. Prerequisite: a declared major or minor in Classics or Classical Studies.</p>');",
  "scrape_metadata": {
    "original_title": "Classics",
    "dept_slug": "classics",
    "original_url": "https://augustana.edu/academics/areas-of-study/classics",
    "courses_url": "https://augustana.edu/academics/areas-of-study/classics/courses",
    "scrape_timestamp": "2025-09-26 19:57:14",
    "status": "success"
  }
}