{
  "program_title": "Communication Studies course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/communication-studies/courses",
  "faculty": [],
  "requirements": {
    "major_in": "28 credits, including two gateway courses (COMM-220, COMM-230, COMM-240, COMM-250, COMM-260); COMM-101, Public Speaking (4 cr.); one theory course (COMM-380, COMM-381, MJMC-382); and an SI capstone (COMM-480). [Exceptions: With pre-approved SI in a second major and with the completion of 28 credits and a second theory course, then the SI capstone could be waived.] A minimum of six credits of elective courses. MJMC 225 Strategic Communication; MJMC 345 Cultural History of Media; 350 Issues in Contemporary Media and 403 Public Relations may be used to fulfill this requirement. Up to two additional credits from Comm 201, 202, 203, 204, 205, and 206 may count toward satisfying this requirement.",
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": "18 credits, including COMM-101 plus at least two gateway courses (COMM-220, COMM-230, COMM-240, COMM-250, COMM-260) and six elective credits.",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=comm",
  "courses_html": "document.write('<p><strong>COMM-101 Public Speaking (4 Credits)</strong><br/>Public Speaking will help develop the foundational skills on which all effective public communication depends. This course will teach students how to adapt to different occasions and audiences, how to effectively support and deliver ideas, how to select and organize materials in preparation for a speech, and how to utilize multimedia tools in presentations. This course is required for all COMM majors and minors,  and should be completed by the end of the sophomore year. Juniors and seniors need permission from the department chair to register.</p><p><strong>COMM-111 Confident Communication (4 Credits)</strong><br/>Confident Communication will help students with communication apprehension from all disciplines feel more confident about voicing their ideas in front of others, whether it\\'s in the classroom, on the job, or engaging in civil discourse with groups large and small. This high-engagement course will empower students by focusing on anxiety-reducing techniques. Students will grow these skills through improvisation work, group discussions, community outreach, and small speech assignments in a supportive environment. J-only, FY-only.</p><p><strong>COMM-199 Directed Study (1-2 Credits)</strong><br/>Focus on a specific body of information not ordinarily covered in the curriculum. Normally entails reading and discussing literature assigned by a faculty member, and preparing a final presentation.</p><p><strong>COMM-201 Presenting With Technology (2 Credits)</strong><br/>Presentations are increasingly mediated, so we\\'ll work through effective use of both visual presentation programs (e.g., PowerPoint and Prezi) and mediation technologies (e.g., SharePoint, Zoom), as well as the &quot;rules&quot; for when and how to effectively incorporate visual support. Prerequisite: COMM-101</p><p><strong>COMM-202 Incorporating Narrative (2 Credits)</strong><br/>Incorporating Narrative focuses on how to effectively incorporate storytelling to enliven a presentation. Students will examine elements needed to create a successful narrative, why narratives enhance presentations, learn how to listen more closely to the stories of others, and how to integrate stories as a means to become a more dynamic communicator in their future career.   Prerequisite: COMM-101</p><p><strong>COMM-203 Listening (2 Credits)</strong><br/>The first step in effective speaking is effective listening, and most folks are atrocious at it. We either listen for the wrong purpose (to plan our rebuttal) or we barely listen at all. There are strategies for correcting both. We\\'ll pursue them. Prerequisite: COMM-101</p><p><strong>COMM-204 Mediating Conversation (2 Credits)</strong><br/>For many of us, our skills are limited to saying our piece, then withdrawing or sparring. 205 will work on the response, framing, and guiding skills related to mediation, negotiation and conflict resolution that come into play in business, political, and relational contexts. Prerequisite: COMM-101</p><p><strong>COMM-205 Deliberation & Dialogue (2 Credits)</strong><br/>Informed by the Sustained Dialogue training, this course teaches skills and techniques for productive engagement in discussion of complex and meaningful issues. Prerequisite: COMM-101</p><p><strong>COMM-206 Small Group Leadership (2 Credits)</strong><br/>This is a performance-intensive course designed to help you understand and practice a series of communication-related skills. Those focus on how to keep a small group or team running smoothly and attain its goals. You will learn how to problem-solve, deal with dysfunctional group mates, become more comfortable speaking in front of others as well as how to become a more effective listener and time manager. Prerequisite: COMM-101</p><p><strong>COMM-210A Presidential Rhetoric (4 Credits)</strong><br/>(PL) This course investigates the genre of presidential rhetoric in different contexts and what it means to be constituted as citizens through that rhetoric.</p><p><strong>COMM-210B Sexual Communication (4 Credits)</strong><br/>(PH)How we communicate about sex and sexuality is shaped by a variety of factors - family, friends, health providers, religion, media - and it can be a key part of our personal development and relationship satisfaction.  This course will apply a theoretical lens to sexual communication in order to better understand its practical importance in psychosocial and behavioral development; sexual relationship development, maintenance, and dissolution; safe-sex decision making; social stigma perpetuation; and, broader cultural understandings of gender and sexuality roles.  Students will gain valuable knowledge and skills that will prepare them to navigate their own sexual communication in an intentional and informed way.</p><p><strong>COMM-210C Digital Games & Cult (4 Credits)</strong><br/>(PL) Digital games and culture focuses on the interpretation of video games and how they reflect and circulate cultural values.</p><p><strong>COMM-210F Art of Fundraising (4 Credits)</strong><br/>America\\'s 1.5 million non-profit organizations, employing 11.4 million people, represent the third-largest segment of the economy. Their collective mission is to change the world for the good of all people, not just for the good of their owners or stockholders. Saving one life, or saving the entire planet, costs a lot. Fund-raisers annually convince Americans to voluntary share nearly $400 billion -- and another $200 billion in volunteered time and skills - each year. This course will help you understand their challenges and the strategies they use to overcome them. We\\'ll learn (1) what motivates people to give and serve and (2) how to build the case - with individuals and organizations - for gifts; our capstone will be a fund-raising practicum in which you and your team craft an actual fund-raising campaign for a non-profit, including a proposal for a large mission-centered grant.</p><p><strong>COMM-210L Leadership & Communication (4 Credits)</strong><br/>In this course, students will explore their individual strengths and values and build the necessary communication skills to lead diverse groups with heart, humanity, and hope.</p><p><strong>COMM-220 Comm and Social Relationships (4 Credits)</strong><br/>(PS,D)Examines how family, peer and cultural socialization influences communication in close relationships. Consideration of race, class, gender and sexual orientation as they relate to communication in diverse relationships.</p><p><strong>COMM-230 Comm, Politics, and Citizenship (4 Credits)</strong><br/>(PL) Addresses issues of communication effects and ethics as they impinge on citizens of a free society, with a focus on political discourse in the public sphere. Features rhetorical tactics, communication strategies and argument patterns in political campaigns, public policy, and the media.</p><p><strong>COMM-240 Advertising and Consumer Culture (4 Credits)</strong><br/>(PS) COMM240 traces the evolution of the persuasive strategies, effects and messages in commercial discourse, from its origins in colonial America to today, with special emphasis on portrayals of race, class, family and gender in contemporary America. Course assignments will incorporate instruction on media content analysis and textual analysis as research methods.</p><p><strong>COMM-250 Health Communication (4 Credits)</strong><br/>An introductory examination of major communication challenges, theories and practices as they relate to health. This interdisciplinary course examines patient-caregiver communication, narrative medicine, diversity and cultural conceptions of health, social support, and health in the media.</p><p><strong>COMM-260 Communication and Culture (4 Credits)</strong><br/>(PH,G) Examines how communication helps create culture and how culture constrains communication, reasoning, and morality; introduces similarities and differences in understanding self and other in cultural contexts.</p><p><strong>COMM-299 Directed Study (1-2 Credits)</strong><br/>Focus on a specific body of information not ordinarily covered in the curriculum. Normally entails reading and discussing literature assigned by a faculty member, and preparing a final presentation.</p><p><strong>COMM-310 January Advanced Seminar (4 Credits)</strong><br/>This will be a rotating topics course taught by different faculty designed primarily for junior and senior majors in Comm Studies or MJMC though some topics might be attractive to junior and senior majors in other fields.</p><p><strong>COMM-325 Leadership: Influencing & Connecting (4 Credits)</strong><br/>COMM 325: Leadership: Influencing and Connecting (4 Credits) As a praxis-based course, we will apply the principles of instructional communication to build our leadership competency through skill building. This course adopts a communication across the discipline (CxD) approach to explore leadership from a human communication perspective while emphasizing rhetorical and relational behaviors that shape positive, working, relationships across vocations.</p><p><strong>COMM-330 Public Rhet: Msg, Power, Influence (4 Credits)</strong><br/>(PL) Public Rhetoric: Messages, Power, Influence  Critically and historically addresses public discourses revolving around a particular issue or genre with regard to how rhetoric is used to initiate change or maintain power. Through contemporary methods of rhetorical criticism,\\\\ considers how context shapes messages and messages shape context in a way that constructs U.S. identities and ideologies. Past topics have included social movement rhetoric and the rhetoric of public memory.</p><p><strong>COMM-331 Feminist Rhetoric (4 Credits)</strong><br/>Comm 331 (Feminist Rhetoric) (4 Credits) (PL) Investigates and analyzes &quot;feminist&quot; ideas and issues through the lenses of history and rhetorical criticism. This course explores how context shapes these messages and how messages shape this context in a way that constructs U.S. identities and ideologies and informs political discussion.</p><p><strong>COMM-340 Propaganda (4 Credits)</strong><br/>(PP) National crises are manufactured with some regularity. Examples include the world wars, the Great Depression, the cold war, immigrant &quot;invasions,&quot; drug wars and &quot;the global war on terrorism.&quot; These crises, though grounded in real-world events, are also rhetorical events as propagandists on both sides look for ways to create and demonize &quot;them&quot; while uniting &quot;us.&quot; 340 examines their strategies, constraints, themes and effects. Course assignments will incorporate instruction on historiographic research.</p><p><strong>COMM-350 Loss, Hope and Support in Health Comm (4 Credits)</strong><br/>Communicating effectively and gracefully during times of interpersonal crisis is a vital skill for adults to learn. However, there are few opportunities to learn these skills. This course will teach social support skills using theories of health communication. In addition it will focus on how to cope with loss, find hope during grief, and build an effective social support system.</p><p><strong>COMM-360 Intercultural Communication (4 Credits)</strong><br/>To be &quot;intercultural&quot; means to be interactive.  Accordingly, this course engages both theory and practice through intentional service-learning/community engagement across racial, ethnic, and national cultures.  Thorough engagement with scholarship and with people showcases the necessity of intercultural skills to professional, political, and relational communication competence.</p><p><strong>COMM-370 Comm, Technology & Society (4 Credits)</strong><br/>Communication scholars observe how technologies such as writing, printing, broadcasting and social media often disrupt social practices. This course investigates 1) the cultural conversation around new technologies and 2) the ways in which new technologies change communication norms. Students will be asked to consider what technology does to us and why we talk about it the way that we do.</p><p><strong>COMM-380 Rhetorical Theory in Comm (4 Credits)</strong><br/>Addresses definitions and frameworks of rhetoric from theorists ranging from ancient Greeks like Plato and Aristotle to modern theorists such as Kenneth Burke and Michel Foucault. Considers the role of rhetoric in the liberal arts and the relationship of rhetoric to knowledge, ethics, and public life. Prerequisite: completion of at least one of the Comm gateway courses (COMM-220, -230, -240, -250 or -260) or permission of instructor.</p><p><strong>COMM-381 Social Scientific Theory in Comm (4 Credits)</strong><br/>Examines the rise of the social sciences and reviews contemporary social science theories and perspectives in communication. Prerequisite: COMM-220, COMM 240, COMM 250 or COMM 260 or permission of instructor.</p><p><strong>COMM-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>COMM-399 Directed Study (1-2 Credits)</strong><br/>Focus on a specific body of information not ordinarily covered in the curriculum. Normally entails reading and discussing literature assigned by a faculty member, and preparing a final presentation. Permission of Instructor.</p><p><strong>COMM-400 Independent Study (1-2 Credits)</strong><br/>Original research in an area of particular interest not covered in regular courses. Normally requires weekly meetings with the supervising faculty member and some variety of spoken or written final presentation. Prerequisite: Permission of Instructor.</p><p><strong>COMM-402 Organizational Communication (4 Credits)</strong><br/>Discusses how structure, leadership, values, goals and climate contribute to organizational culture and communication, and explores how individuals and groups are impacted by these variables.</p><p><strong>COMM-410 Seminar in Communication (4 Credits)</strong><br/>In-depth analysis of communication topics offered for advanced students. Typically reading and discussion intensive, with an expectation that students take active roles in the classroom. Seminar topic changes every year. Can be repeated.</p><p><strong>COMM-450 Health Communication Campaigns (4 Credits)</strong><br/>This course focuses on the purpose, design, implementation, and evaluation of public health communication campaigns-promotional messages or interventions aimed at health behavior education or change. Students gain an overview of relevant theory and research and the opportunity to study, design, implement, and evaluate health communication campaigns.</p><p><strong>COMM-480 Senior Inquiry (4 Credits)</strong><br/>A semester-long capstone experience that allows each student to refine, crystallize and document their understanding of the process and effects of communication. Students completed an approved Senior Inquiry project in a different major may substitute a second communication theory course (COMM-380, COMM-381, MJMC-382) for COMM-480.</p><p><strong>COMM-499 Directed Study (1-2 Credits)</strong><br/>Focus on a specific body of information not ordinarily covered in the curriculum. Normally entails reading and discussing literature assigned by a faculty member, and preparing a final presentation.</p>');",
  "scrape_metadata": {
    "original_title": "Communication Studies",
    "dept_slug": "communication-studies",
    "original_url": "https://augustana.edu/academics/areas-of-study/communication-studies",
    "courses_url": "https://augustana.edu/academics/areas-of-study/communication-studies/courses",
    "scrape_timestamp": "2025-09-26 19:57:20",
    "status": "success"
  }
}