{
  "program_title": "Communication Sciences and Disorders course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/communication-sciences-and-disorders/courses",
  "faculty": [],
  "requirements": {
    "major_in": "42 credits including CSD-110; CSD-205; CSD-210; CSD-215; CSD-220; CSD-305; CSD-310; CSD-315; CSD-405; CSD-410; two from CSD-415; CSD-420; CSD-425; CSD-430; CSD-460; CSD-490; optional: CSD-105. Required supporting courses (20 credits): LING-100; Any PSYC or SOAN course; Statistics such as PSYC 240 or MATH 130; any course carrying BIOL prefix that is human- or animal-based, such as BIOL-130 or BIOL-140; CHEM 131 or 132 or PHYS 121 or 151. Departments of Education in selected states may require a Human Development Course such as PSYC 216 therefore, this course is recommended for CSD majors.",
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": null,
    "gpa_note": "Students must have a cumulative G.P.A. of 3.0 or higher to enroll in CSD-425 and CSD-430. All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count towards the major, depending on the program. For more information, see your department chair or the degree requirements for the Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=csd",
  "courses_html": "document.write('<p><strong>CSD-100 Comm: Disab, Diff, Disorder (4 Credits)</strong><br/>(PS) Course involves the examination of linguistic, behavioral, physiological, and multicultural aspects of human communication. Specific focus will be placed on considering how disability, difference, and/or disorders are constructed in communication interactions. Students will learn about how communication is culturally constructed, as well as the characteristics of a variety of communication disorders. Non-CSD majors only.</p><p><strong>CSD-105 Sign Language (1 Credits)</strong><br/>Students will comprehend and express basic vocabulary in sign language. English word order, fingerspelling and developing a basic understanding of Deaf culture will be emphasized.</p><p><strong>CSD-110 Intro Communication Sciences & Disorders (4 Credits)</strong><br/>Students in this course will learn about human communication systems and variations in communication, including cultural differences, with emphasis on the multiple aspects of disordered communication related to speech, language, and hearing deficits. Specific communication disorders will be examined. Students will also learn about the roles and responsibilities of the professions in the field of Communication Sciences and Disorders. CSD majors only.</p><p><strong>CSD-205 Anatomy, Physiology, & Science of Speech (4 Credits)</strong><br/>The primary objective of this course is to provide students with an understanding of how humans produce speech. This will lead to the study of the human speech mechanism and how it works. The study of speech encompasses an array of interrelated scientific disciplines, including mathematics, physics, psychology, biology, medicine, and communication sciences and disorders. In this course, students will study the multidisciplinary nature of speech as we explore the topics of respiration, phonation, articulation, resonation and acoustics.</p><p><strong>CSD-210 Anatomy, Physiology & Science of Hearing (4 Credits)</strong><br/>The primary objective of this course is to introduce students to the hearing mechanism by examining its structure and function, and the acoustical properties of sound. We will discuss fundamental principles and theories of sound waves and their propagation in space, and will learn how sound is measured by solving problems using the decibel. We will discuss structures of the peripheral and central auditory system and the vestibular system, and explain their functions. Students will also differentiate the acoustical characteristics of sound (e.g., pitch vs. loudness) and explain how they contribute to auditory perception. Finally, we will discuss audio systems, including the functions of audio devices and how they process auditory signals.</p><p><strong>CSD-215 Phonetics (4 Credits)</strong><br/>The primary objective of this course is to provide students with the science of speech production and perception. Students will learn the mechanisms involved in segmental and suprasegmental production in a variety of the world\\'s languages. The study of these mechanisms includes the study of respiration, phonation, articulation, and resonation. The study of speech acoustics and acoustic analysis will be introduced, and students will learn how to conduct basic analyses. Students will learn the phonology of speech sounds in American English and its dialectal variations.  Students will also learn to phonetically transcribe typically developing, disordered, and non-native English speech using symbols from the International Phonetic Alphabet. Development of both the art and science of IPA transcription will be fostered in this class.</p><p><strong>CSD-220 Speech and Language Development (4 Credits)</strong><br/>The primary objective of this course is to explore multiple aspects of speech and language developmental milestones and language development theories. Students will discover distinctions between communication, speech, and language. They will consider how and why humans develop language and how factors such as socioeconomic status, intelligence, culture, and language difference influence language and speech development. Typical speech and language development norms will be used to inform assessment and intervention decisions for children with atypical communication development. Labs will allow students to quantify, describe, and analyze language data.</p><p><strong>CSD-305 Speech Sound Disorders (4 Credits)</strong><br/>The primary objective of this course is to provide students with an understanding of various disorders of speech that can affect individuals throughout the lifespan. We will briefly review normal speech development, and then spend a considerable amount of time learning how to assess individuals with speech disorders. Following the assessment unit, we will talk about intervention issues. A variety of special populations in which individuals exhibit a high incidence of speech disorders will be presented, and we will explore multicultural issues related to assessment and intervention of disorders and differences in speech. Students will discuss competing theories of speech acquisition, while learning how to evaluate theoretical approaches in assessment and intervention. Prerequisite: CSD-215, or permission of instructor.</p><p><strong>CSD-310 Language & Lit Disorders (4 Credits)</strong><br/>The primary objective of this course is for students to gain understanding of the types, causes, and possible characteristics of child oral language and literacy disorders. Students will connect applied and theoretical linguistics and develop evidence-based procedures to identify, assess, and generate functional and measurable goals and related intervention plans for children with language disorders. They will use standardized tests and qualitative language data to describe language development in children with language disorders and write professional clinical reports for children with disordered oral or written language. Students will apply the study of typical language development to children with language and literacy disorders. Throughout the course, concepts of the language-cognition relationship, special issues pertaining to culturally and linguistically diverse populations, and service delivery in various pediatric settings also will be explored.   Prerequisite: CSD-220 or permission of instructor.</p><p><strong>CSD-315 Audiology (4 Credits)</strong><br/>The primary objective of this course is to introduce students to the field of audiology that includes diagnosis and treatment of hearing disorders. We will also discuss the roles and responsibilities of hearing healthcare professionals working with patients with hearing loss, and summarize the important technologies that are used to assess hearing. Students will perform basic hearing testing and interpret their results through hands-on labs. We will discuss hearing disorders as they affect hearing and vestibular function, and investigate the effectiveness of treatments available to address hearing and vestibular dysfunction. A special emphasis will be placed on multicultural issues, including Deaf culture.</p><p><strong>CSD-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>CSD-399 Directed Study (1-2 Credits)</strong><br/></p><p><strong>CSD-405 Aural Rehabilitation (2 Credits)</strong><br/>The primary objective of this course is to enable students to thoughtfully address questions and issues related to the d/Deaf and hard-of-hearing community, including aural habilitation and aural rehabilitation. Emphasis will be placed on total communication, defined as the use of all available modalities (auditory, verbal, sign language, and visual communication systems) to teach language and speech to individuals with hearing loss. Students will also learn about relevant legislation related to the d/Deaf and hard of hearing population.</p><p><strong>CSD-410 Neural Bases of Human Comm (4 Credits)</strong><br/>The primary objective of this course is to identify the structures of the central and peripheral nervous systems of the body, and how they connect and contribute to communication impairments. Students will apply principles governing brain function through case studies. Students will also be able to describe how development of neural systems occurs and how abnormalities produce developmental disabilities and neurological disorders affecting communication. We will review the major parts of a nerve cell and describe how electrical signals are conducted through the nervous system. Students will explain how blood is circulated in the brain and how involvement of cerebrovascular systems results in damage to the brain.</p><p><strong>CSD-415 Community Practicum 1 (0 Credits)</strong><br/>Students will complete one or two community-based practicums, depending on total number of internship hours and as determined on an individual basis in conference with advisor. Prerequisite: Approval by CSD advisor and/or permission of Center Director.</p><p><strong>CSD-420 Community Practicum 2 (0 Credits)</strong><br/>Students will complete one or two community-based practicums, depending on total number of internship hours and as determined on an individual basis in conference with advisor. Prerequisite: Approval by CSD advisor and/or permission of Center Director.</p><p><strong>CSD-425 Clinical Practicum I (0 Credits)</strong><br/>Students will complete two internship clinical practicums in the Roseman Center for Speech, Language, and Hearing. In weekly seminars, clinical internship students will learn about professional practice issues, evidence-based practice, clinical documentation, the clinical supervision process, the ASHA Code of Ethics and Scope of Practice, and intervention planning.  Prerequisite: 3.0 cumulative GPA or permission of instructor obtained through the CSD Department\\'s clinical petition process.</p><p><strong>CSD-430 Clinical Practicum 2 (0 Credits)</strong><br/>Students will complete two internship clinical practicums in the Roseman Center for Speech, Language, and Hearing.  In weekly seminars, clinical internship students will learn in weekly seminars about professional practice issues, evidence-based practice, clinical documentation, the clinical supervision process, the ASHA Code of Ethics and Scope of Practice, and intervention planning.  Prerequisite: 3.0 cumulative GPA or permission of instructor obtained through the CSD Department\\'s clinical petition process.</p><p><strong>CSD-460 CSD Research Methods (2 Credits)</strong><br/>The primary objective of this course is to examine scientific methods and research designs employed in CSD research and to review the process and importance of evidence-based practice in CSD. Issues related to population sampling, data collection methods, and statistical analyses will be covered. Special emphasis will be placed on the protection of human participants and research ethics. Students will develop a research question to be expanded upon in CSD-490: Research Writing.</p><p><strong>CSD-480 Senior Inquiry - Research Methods (4 Credits)</strong><br/>The primary objective of this course, which is foundational for a graduate-level research methods course, is to examine the various designs of scientific methods employed in CSD research, including clinical trials and single-subject designs, and to review the importance of evidence-based practice in CSD. We will also study the research process and discuss issues related to population sampling, adequate data collection, and statistical analyses. An emphasis will be placed on protection of human participants and research ethics. We will practice scientific writing in CSD, as well as present research in a professional format. Development of a research question or topic will be the culminating product.</p><p><strong>CSD-490 Senior Inquiry - Research Writing (2 Credits)</strong><br/>Students will develop a multi-draft research essay or thesis that will culminate in a substantial written document and a public presentation. Students also will engage in a reflection discussion or write a reflective paper about their research process, the theoretical and clinical implications of their work, and its connection to their liberal arts experience.</p>');",
  "scrape_metadata": {
    "original_title": "Communication Sciences and Disorders",
    "dept_slug": "communication-sciences-and-disorders",
    "original_url": "https://augustana.edu/academics/areas-of-study/communication-sciences-and-disorders",
    "courses_url": "https://augustana.edu/academics/areas-of-study/communication-sciences-and-disorders/courses",
    "scrape_timestamp": "2025-09-26 19:57:17",
    "status": "success"
  }
}