{
  "program_title": "Economics course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/economics/courses",
  "faculty": [],
  "requirements": {
    "major_in": "30 credits, including ECON-200, ECON-301, ECON-302, ECON-317, ECON-404, ECON-406, and two of ECON-221, ECON-225, ECON-345, ECON-361, and ECON-362. (MATH-350, or with permission, MATH-160 and Econ-318 may be substituted for ECON-317.) Required supporting courses: BUSN-211 and BUSN-311 or MATH-330 and MATH-430.",
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": "20 credits. ECON-200, ECON-301, ECON-302, and two of ECON-221, ECON-225, ECON-345, ECON-361, ECON-362, ECON-370, ECON-404, and ECON 406.",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=econ",
  "courses_html": "document.write('<p><strong>ECON-199 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisites: permission of department chair and instructor.</p><p><strong>ECON-200 Principles of Economics (4 Credits)</strong><br/>Survey of basic economic theory. The theory of consumer behavior, firm behavior and the role of markets and prices in the allocation of resources, economic fluctuations including national income analysis, aggregate supply and demand models and stabilization policy.</p><p><strong>ECON-221 Environmental Economics & Policy (4 Credits)</strong><br/>This course uses economic analysis to examine environmental problems and policy responses to those problems.</p><p><strong>ECON-225 Health Economics (4 Credits)</strong><br/>(PS)The tools and perspectives of economic analysis applied to the health care industry. Emphasis is on the changing nature of the industry and alternative methods of structuring and financing it.</p><p><strong>ECON-245TR Money & Banking Transfer (1-12 Credits)</strong><br/></p><p><strong>ECON-299 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisites: permission of department chair and instructor.  </p><p><strong>ECON-301 Intermediate Macroeconomics (4 Credits)</strong><br/>Descriptive and analytical exploration of the U.S. economy including national income and growth analysis, aggregate market models and stabilization policy. Prerequisite: 200. Recommended: 345.</p><p><strong>ECON-302 Intermediate Microeconomics (4 Credits)</strong><br/>Price and distribution theory, the mechanics and efficiency of various market structures. Prerequisite: 200. Recommended: 317.</p><p><strong>ECON-317 Mathematical Methods in Economics (2 Credits)</strong><br/>An introduction to the use of linear algebra and multivariate calculus in economic theory and applications. Prerequisites: 200</p><p><strong>ECON-318 Advanced Mathematics for Economists (1 Credits)</strong><br/>Topics in the use of linear algebra and multivariate calculus in economic theory and applications. Prerequisites: ECON-200, MATH-160 or equivalent, senior standing. Credit cannot be earned in this course if ECON 317 has been completed and vice versa.</p><p><strong>ECON-345 Money and Banking (4 Credits)</strong><br/>American financial institutions with particular emphasis on commercial banking, the central bank mechanism, monetary analysis and policy. Prerequisite: 200.</p><p><strong>ECON-361 International Trade (4 Credits)</strong><br/>An analysis of the determinants of international trade with consideration of issues involving nations\\' foreign trade policies. Prerequisite: 200.</p><p><strong>ECON-362 International Finance (4 Credits)</strong><br/>International finance theory with consideration of the major current problems in the international economy. Prerequisite: 200.</p><p><strong>ECON-366 Intro to the Chinese Economy (4 Credits)</strong><br/>This course is intended to offer a broad introduction to China\\'s economic transition and development since market-oriented reforms began in 1978. Combined with economics, this course will introduce this philosophy, culture, and values of China.</p><p><strong>ECON-370 Topics in the International Economy (4 Credits)</strong><br/>The political economy of a selected country or countries. Topics may include monetary, trade, environmental, or development theory applied to selected countries.</p><p><strong>ECON-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>ECON-399 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisites: permission of department chair and instructor.  </p><p><strong>ECON-400 Independent Study (1-2 Credits)</strong><br/>Research on specific topics for seniors majoring in economics. Prerequisite: departmental permission.</p><p><strong>ECON-404 U.S. Economic History (4 Credits)</strong><br/>(PP) An analysis of selected topics in U.S. history using economic methodology. A comparison of the economic methodology to other methods of historical analysis. Controversies within the discipline. Prerequisites: 200 and BUSN-311 or MATH-430. Recommended: 301, 302. For economics majors, it is highly recommended that ECON-404 be taken before taking ECON-406 and during senior year. The research project developed in this course will be continued and extended in ECON 406.</p><p><strong>ECON-406 Development Economics (4 Credits)</strong><br/>(PH, G, SI) Examination of various explanations of poverty and slow growth in the developing countries of Latin America, Africa, and Asia. Prerequisite: 200 or consent of instructor. For economics majors, it is highly recommended that ECON-406 be taken after having completed ECON-404 and in their senior year. A research project developed in 404 will be continued and extended in this course.</p><p><strong>ECON-499 Directed Study (1-2 Credits)</strong><br/>199, 299, 399, 499 Directed Study (1+)  Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisites: permission of department chair and instructor.</p><p><strong>ECON-ELEC AP Econ Elective (3 Credits)</strong><br/></p><p><strong>ECON-ELEC2  IB Economics (1-12 Credits)</strong><br/></p>');",
  "scrape_metadata": {
    "original_title": "Economics",
    "dept_slug": "economics",
    "original_url": "https://augustana.edu/academics/areas-of-study/economics",
    "courses_url": "https://augustana.edu/academics/areas-of-study/economics/courses",
    "scrape_timestamp": "2025-09-26 19:57:39",
    "status": "success"
  }
}