{
  "program_title": "Education courses",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/education/courses",
  "faculty": [],
  "requirements": {
    "major_in": "A professional sequence consisting of 32 credits including EDUC-301, EDUC-340, EDUC-351, EDUC-352, EDUC-360, EDUC-360R, EDUC-364, EDUC-366, EDUC-366R, EDUC-391F, EDUC-391S, and EDUC-450. To be eligible for teacher licensure for grades 1-6 in Illinois the student must also successfully complete these 13 additional credits: EDUC-422 and INTR-EDA95. See your education department advisor for information regarding a minimum of 48 credits of supporting courses taught through other departments that are also required for licensure. 28 credits, including BIOL-130, BIOL-140, BIOL-250, BIOL-310, BIOL-343, One of BIOL-360 or BIOL-362, one of BIOL-386 or BIOL -387; and EDUC-422, EDUC-450 and INTR-EDA90 as part of the Secondary Education program. See the Director of Secondary Education for more details. Required supporting courses (28 credits): CHEM-131, CHEM132, PHYS-151, PHYS-152, ASTR-145, GEOG-105, GEOL-101. 42 credits. 40 credits in English including 215, 260, 265, 210, 310; a Shakespeare class (250 or 327); two American literature classes (one from 370, 375, or 385 , and one from 270, 275, 278, 290, 390, or others pre-approved by the ELA advisor); a world literature class (285, 295, 345, 350 or WGSS 230); one elective ENGL (300 or higher) OR ENCW (200 or higher); plus two credits in Communication Studies (COMM 203 Listening). The English department allows the combination of EDUC422, EDUC450, and INTR-EDA90 to fulfill the English Senior Inquiry requirement. See the Director of Secondary Education for more information. 32 credits, distributed as follows: 4 credits from HIST130 or 131; 4 credits from HIST114, HIST115, or HIST116; HIST300; HIST305 or HIST306; 4 credits from a 300-level U.S. history course in a period other than the ones taken at the 100-level); 8 credits from 2 of the following geographic areas: Asia, Africa, Latin America, or World history;4 additional credits from a history course selected in consultation with the advisor; at least 12 credits at the 300 level. See Department of Secondary Education for required supporting courses. 32 credits, including MATH-160, 220, 230, 250, 330, 350, 410, 450, and 470. The student teaching experience serves as the Senior Inquiry for these students. CSC 201 is highly recommended. Music students who successfully complete the music education degree and meet Illinois State requirements will be recommended for a Professional Educator License endorsed in K-12 music. See Department of Education and the Department of Music Handbook for specific requirements. 27-28 credits, including PHYS-211, PHYS-212, PHYS-213, PHYS-339, PHYS-366, and PHYS-399( Directed Study with focus on Embedded Tutoring) and two of the following: PHYS-300, PHYS-313, PHYS-360, or a combination of PHYS-399 (Directed Study with focus on Course Development) and PHYS-400. See the Director of Secondary Education for more details. 100-level courses do not count toward the major. Required supporting courses (36 credits): ASTR- 135 or ASTR-145; BIOL-130 and BIOL-140; CHEM-131 and CHEM-132; GEOL-101 and GEOG-105; MATH-160, and MATH-260.",
    "acs_major": null,
    "major_for_ed": "28-32 credits, including CHEM-131 and CHEM-132 (can be replaced by CHEM 235); CHEM-321 and CHEM-322; CHEM-255, CHEM-441; one of CHEM-361 or CHEM-365; and CHEM-435. Required supporting courses (36 credits): ASTR-145; BIOL-130 and BIOL-140; PHYS-211 and PHYS-212 or PHYS-151 and PHYS-152; GEOL-101 and GEOG-105; and MATH-160, MATH-220 and MATH-230. See the Director of Secondary Education for more details.",
    "minor_in": "21 credits including: EDUC 301, EDUC 340 (or CSD 310 for CSD majors); EDUC 370 (or a content area methods course, with consultation from an Education advisor); 8 credits in another major or the Education Department based on the interests of the students selected in consultation with an advisor in the Educational Studies minor; and a 1-credit school-based or other education-related experiential internship (INTR-EDUC) or study abroad experience based on the interests of the student.",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Education majors may have higher grade point average requirements to stay in the major due to state licensing compliance. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=educ",
  "courses_html": "document.write('<p><strong>EDUC-100TR Education Transfer Elective (1-5 Credits)</strong><br/></p><p><strong>EDUC-121A College Algebra for Elem Tchrs (2 Credits)</strong><br/>The content goals of this course are aligned to the College Algebra standards articulated in the Illinois Administrative Code\\'s &quot;Standards for Endorsements in Elementary Education&quot; document. Declared Elementary Education Major, permission of Department.</p><p><strong>EDUC-121S Statistics for Elem Teachers (2 Credits)</strong><br/>The content goals of this course are aligned to the Statistics standards articulated in the Illinois Administrative Code\\'s &quot;Standards for Endorsements in Elementary Education&quot; document. Declared Elementary Education Major, permission of Department.</p><p><strong>EDUC-210TR Computers in Educ Transfer (1-12 Credits)</strong><br/></p><p><strong>EDUC-217 Urban Education (4 Credits)</strong><br/>(PH,D) In this course, students will engage with challenging questions related to urban schooling in America via academic study (reading, discussion, research) and direct experience in partnering urban schools.  Issues explored include the impacts of racial segregation, disparities in resource allocation, disparities in access to challenging curricula, the profound impacts of poverty, conflicting beliefs regarding equality of educational opportunity, challenges posed by immigration, and proposed yet unproven &quot;reform solutions&quot; to urban school problems. Prerequisite: FYI 101.</p><p><strong>EDUC-261 Education in Jamaica (0 Credits)</strong><br/>Introduction to Jamaican history, culture, and education system. Pre-requisite course for J-term Jamaica study away experience. Permission of instructor  required.</p><p><strong>EDUC-262 International Comparative Educ: Jamaica (4 Credits)</strong><br/>(PH,G)An exploration of Jamaican history and culture, including ways the culture is transmitted to children and adolescents through formal and informal education.  Includes a tour of the island and a school-based experiential component in partnering Jamaican schools. Prerequisite: Permission of instructor.</p><p><strong>EDUC-280 Special Topics in Education (1-4 Credits)</strong><br/>Intensive study of issues relating to K-12 education. Topics may be selected by faculty or students but will be associated with at least one of the departmental guiding questions: What are schools for? What does it mean to learn? What does it mean to teach? Prerequisite: Permission of instructor</p><p><strong>EDUC-301 Educ Psych & Assessment (4 Credits)</strong><br/>Examination of issues related to what schools are for and how people learn emphasizing the active construction of meaning by learners. An introduction to fundamental concepts and skills needed to assess student learning, including educational goals and learning objectives, purposes and development of formative and summative assessments, standardized tests, performance assessments, and practices of grading. Prerequisites: Declared Major or Minor, Sophomore Standing (27 credits), permission of Department</p><p><strong>EDUC-310 Computers in Education (1 Credits)</strong><br/>Examination of the use of computers and related technology as learning and instructional tools in middle and high schools. Prerequisites: 301, Retention in  the Teacher Education Program.</p><p><strong>EDUC-340 Methods of Inclusion (4 Credits)</strong><br/>(D) Examination of evidence-based strategies that are designed to facilitate the successful inclusion of students with various needs across academic, social/emotional, and physical/sensory areas. Theory is connected to practice through a 20-hour clinical experience.Prerequisites: PSYC-100, EDUC-301 and Retention in Teacher Education Program.</p><p><strong>EDUC-351 Development Literacy Methods Grades 1-3 (4 Credits)</strong><br/>Develop a foundational understanding for the complex processing related to effective reading and writing at the emergent level. Includes instruction based in the science of reading of how to teach and support diverse learners including native speakers and English Language Learners in becoming strategic readers, writers, listeners, and speakers in primary classrooms. A variety of genres of text and digital literacies are explored. Prerequisites: 301, 340 and retention in Teacher Education Program. Concurrent registration in a clinical experience  is required.</p><p><strong>EDUC-352 Development Literacy Methods Grades 4-6 (4 Credits)</strong><br/>Examination of current literacy methods including reading, writing, listening, speaking, language, and foundational skills at the intermediate level. Includes reading and writing in the content areas. A variety of advanced reading skills based on the science of reading for native speakers and English Language Learners are examined. Prerequisites: 301, 340, 351, and retention in Teacher Education Program. Concurrent registration in a clinical experience is required.</p><p><strong>EDUC-354 Remedial Reading Meth 1-6 (2 Credits)</strong><br/>Emphasis placed on teaching reading with individual and small groups in grades 1-6. Selection of appropriate reading materials, research-based strategies for literacy development, and written evaluation of intervention reports for school districts are the topics emphasized. The theoretical underpinnings of reading difficulties are explored as well as ways to integrate research and theory into classroom instruction to assist students in the reading process and becoming more capable readers. Prerequisites: 301, 340, 351, 352 and retention in Teacher Education Program. Course changed from 3 credits to 2 credits on May 15, 2020.</p><p><strong>EDUC-354C Clinical Remedial Reading (1 Credits)</strong><br/>Experience implementing the strategies identified in EDUC-354 while working with elementary- aged students, grades 1 to 6, during individual and small group instruction for a minimum of 30 clock hours. A formal observation of a candidate\\'s teaching is conducted by college faculty at least once during the term. Feedback provided during pre-observation and post-observation conferences. Concurrent registration in EDUC-354 is required.</p><p><strong>EDUC-355 Reading in the Content Areas (2 Credits)</strong><br/>The teaching and mastery of content area reading requires teachers to understand the relationship between literacy instruction and content area study, ways of knowing, and ways of expression within a discipline. Emphasis is placed on the study of expository text and the levels of thinking, questioning, textbooks, assessments, reader strategies, and teacher strategies appropriate for the content in grades 1-6. Prerequisites: 301, and 340; retention in Teacher Education Program.</p><p><strong>EDUC-360 Methods 1-6 Soc Studies (3 Credits)</strong><br/>Examination of constructivist, inquiry-oriented methods to engage students in the study of history and the social sciences for the purpose of becoming active participants in a democratic society. Students will develop a unit integrating technology and multiple content areas, including the criteria to judge the quality of the unit.  Concurrent registration in 360R is required. Prerequisites: 301 retention in Teacher Education Program.</p><p><strong>EDUC-360R Content Area Reading in Social Studies (1 Credits)</strong><br/>The teaching and mastery of content area reading in social studies requires teachers to understand the relationship between literacy instruction and content area study, ways of knowing, and ways of expression within the discipline. Emphasis is placed on the study of expository text and the levels of thinking, questioning, textbooks, assessments, reader strategies, and teacher strategies appropriate for the content in grades 1-6. Concurrent registration in EDUC 360 is required. </p><p><strong>EDUC-364 Methods 1-6 Mathematics (4 Credits)</strong><br/>Examination of constructivist, inquiry-oriented methods that engage students in the doing of mathematics. The use of hands-on and model-based approaches are addressed. Uses of technology are incorporated. Prerequisites: 301. Retention in Teacher Education Program.</p><p><strong>EDUC-366 Methods 1-6 Sci/Health (3 Credits)</strong><br/>Examination of constructivist, inquiry-oriented methods that engage students in the doing of science. Use of technology is incorporated. Current approaches and materials used in teaching health and wellness are introduced. Concurrent registration in EDUC 366R is required. Prerequisites: 301. Retention in Teacher Education Program.</p><p><strong>EDUC-366R Content Area Reading in Science (1 Credits)</strong><br/>The teaching and mastery of content area reading in science requires teachers to understand the relationship between literacy instruction and content area study, ways of knowing, and ways of expression within the discipline. Emphasis is placed on the study of expository text and the levels of thinking, questioning, textbooks, assessments, reader strategies, and teacher strategies appropriate for the content in grades 1-6. Concurrent registration in EDUC 366 is required. Prerequisites: 301, retention in Teacher Education Program. </p><p><strong>EDUC-370 Methods 5-12 General (4 Credits)</strong><br/>Examination of and practice teaching experiences with a broad spectrum of constructivist methodologies and techniques used in middle/high school classrooms. Investigation of student learning styles, critical thinking, the middle school model, classroom management and current issues in secondary education. Prerequisites: 301, Retention in Teacher Education Program.</p><p><strong>EDUC-380 Special Topics in Education (1-4 Credits)</strong><br/>Intensive study of issues relating to K-12 education. Topics may be selected by faculty or students but will be associated with at least one of the departmental guiding questions: What are schools for? What does it mean to learn? What does it mean to teach? Prerequisite: Permission of instructor</p><p><strong>EDUC-381 Methods PK-12 Art (4 Credits)</strong><br/>Examination of and practice with current aims and methods of art education at the elementary and secondary levels. Prerequisite: Retention in Teacher Education Program. $60.00 lab fee.</p><p><strong>EDUC-382 Methods 5-12 Lang Arts (4 Credits)</strong><br/>Examination of and practice with current research-based, best practices for teaching literature and composition in the secondary schools.  Prerequisites: 370 or 412 and Retention in Teacher Education Program.</p><p><strong>EDUC-383 Methods PK-12 Foreign Lang (4 Credits)</strong><br/>Examination of and practice with current approaches to the teaching of foreign languages. Study of materials used in secondary schools. Includes selected clinical experiences. Prerequisites: 370 or 412 and Retention in Teacher Education Program.</p><p><strong>EDUC-384 Methods 5-12 Mathematics (4 Credits)</strong><br/>Examination of and practice with current approaches and materials in the teaching of mathematics in secondary schools. Includes selected clinical experiences. Prerequisites: 370 or 412 and Retention in Teacher Education Program.  </p><p><strong>EDUC-386 Methods 5 -12 Science (4 Credits)</strong><br/>Examination of and practice with constructivist methods in teaching science in high school classrooms. As part of this experience, students will plan and teach lessons in a local classroom. Prerequisites: 370 or 412 and Retention in Teacher Education Program.</p><p><strong>EDUC-387 Methods 5-12 Soc Studies (4 Credits)</strong><br/>Examination of and practice with current approaches to teaching social studies secondary schools. Development of a unit integrating technology and promoting democratic multicultural citizenship. Prerequisites: 370 or 412 and Retention in Teacher Education Program.</p><p><strong>EDUC-388 Teaching CLD Students (4 Credits)</strong><br/>(D) This course is designed to provide an overview of the experiences of culturally and linguistically diverse (CLD) students (sometimes also called English Language Learners) in the classroom. Students will gain understanding of the legal, historical, social, and educational implications of CLD programming. They will also gain familiarity with theories of second language development and classroom methods that benefit CLD students.</p><p><strong>EDUC-389 Assessment of CLD Students (2 Credits)</strong><br/>This course focuses on the assessment of culturally and linguistically diverse students (CLD - also called English language learners). It will cover formative and summative assessments of CLD students in both language proficiency and content areas, initial placements of CLD students into ESL programs, and placement of CLD students into special needs or gifted programs. Students will also complete a 30-hour clinical experience related to the instruction and assessment of CLD students. Prerequisites: retention in the Teacher Education program, EDUC-388 or permission of instructor.</p><p><strong>EDUC-391F Elementary Clinical 1 (1 Credits)</strong><br/>First of two clinical experiences in elementary school classrooms. Includes a minimum of 40 clock hours. Formal observations of a candidate\\'s teaching is conducted by college faculty twice during the term. Feedback provided during pre-observation and post-observation conferences. Concurrent registration in an elementary methods course required. Prerequisites: 301. Retention in Teacher Education Program.</p><p><strong>EDUC-391S Elementary Clinical 2 (1 Credits)</strong><br/>Second clinical experience in elementary school classrooms. Includes a minimum of 40 clock hours. Formal observations of a candidate\\'s teaching is conducted by college faculty twice during the term. Feedback provided during pre-observation and post-observation conferences. Concurrent registration in an elementary methods course required. Prerequisites: 301 391F, Retention in Teacher Education Program.</p><p><strong>EDUC-395 Clinical Experience K-6 (1 Credits)</strong><br/>Assignment to an elementary school classroom in grades K-6. Includes weekly on campus class sessions and a minimum of 40 clock hours in a local school. A formal observation of a candidate\\'s teaching is conducted by college faculty at least once during the term. Feedback provided during pre-observation and post-observation conferences. Prerequisites: 301, 340, Retention in Teacher Education Program.</p><p><strong>EDUC-396 Clinical Experience 5-8 (1 Credits)</strong><br/>Assignment to a middle/junior high school. Includes weekly on campus class sessions and a minimum of 40 clock hours in a local school. A formal observation of a candidate\\'s teaching is conducted by college faculty at least once during the term. Feedback provided during pre-observation and post-observation conferences. Prerequisites: 301, Retention in Teacher Education Program.</p><p><strong>EDUC-397 Clinical Experience 9-12 (1 Credits)</strong><br/>Assignment to a high school. Includes weekly on campus class sessions and a minimum of 40 clock hours in a local school. A formal observation of a candidate\\'s teaching is conducted by college faculty at least once during the term. Feedback provided during pre-observation and post-observation conferences. Prerequisites: 301, Retention in Teacher Education Program.</p><p><strong>EDUC-398 Clinical Experience: Other (1 Credits)</strong><br/>Assignment to a classroom for additional clinical experience. Includes weekly on campus class sessions and a minimum of 40 clock hours in a local school. A formal observation of a candidate\\'s teaching is conducted by college faculty at least once during the term. Feedback provided during pre-observation and post-observation conferences. Prerequisites: 301, 340, Retention in Teacher Education Program.</p><p><strong>EDUC-399 Directed Study (1-2 Credits)</strong><br/>Prerequisite: permission of instructor.</p><p><strong>EDUC-400 Independent Study (1-2 Credits)</strong><br/>Advanced critical study or research on a specific topic related to education. P/NC option available for cooperating teachers. Prerequisite: permission of instructor. Prerequisite: permission of instructor.</p><p><strong>EDUC-400TR Education Elective (1-12 Credits)</strong><br/></p><p><strong>EDUC-411 Methods 5-12 Literacy (2 Credits)</strong><br/>Examination of current, research-based methods for improving reading effectiveness in all content area middle and secondary classrooms through explicit strategy instruction. Includes: reading process, English Language Learner challenges, language acquisition, and teaching with a wide range of texts. Prerequisites: EDUC-301, EDMU-330 and retention in Teacher Education Program.</p><p><strong>EDUC-412 Methods 5-12 Literacy (4 Credits)</strong><br/>Examination of current, research-based methods for improving reading effectiveness in all content area middle and secondary classrooms through explicit strategy instruction. Includes: reading process, English Language Learner challenges, language acquisition, and teaching with a wide range of texts. Prerequisites: EDUC-301 and retention in Teacher Education Program.</p><p><strong>EDUC-422 Classroom Management Seminar (1 Credits)</strong><br/>Investigation of processes of teaching and learning designed to supplement the student teaching experience. Highly interactive, student-centered sessions focus primarily on the planning, implementation, and management of constructivist teaching and assessment methods in the K-12 classrooms. Prerequisites: Retention in Teacher Education Program, Admission to Student Teaching. Concurrent registration in Student Teaching is required</p><p><strong>EDUC-450 School and Society (2 Credits)</strong><br/>(PH) A historical, ethical and philosophical investigation of the relationship between American schools and American society. Exploration of contemporary educational issues and practices. Prerequisites: Retention in Teacher Education Program.  Concurrent registration in Student Teaching and EDUC 422 is required. </p><p><strong>EDUC-450A School and Society II (3 Credits)</strong><br/>A historical, ethical and philosophical investigation of the relationship between American schools and American society. Exploration of contemporary educational issues and practices. Completion of a Senior Inquiry research project. Prerequisites: Retention in Teacher Education Program. Concurrent registration with EDUC 451 is required. Permission of education advisor needed if a prerequisite is not met.</p><p><strong>EDUC-451 Service Learning Intern (1 Credits)</strong><br/>A service learning course coupled with EDUC 450 as a Learning Community. Teacher candidates complete a 30-hour internship at a local middle school under the supervision of the 450A instructor(s) and school faculty. Full group discussion sessions are also required. Prerequisite: Retention in Teacher Education Program, Concurrent Enrollment in EDUC-450A.</p><p><strong>EDUC-456 Assessment of Reading Problems (2 Credits)</strong><br/>Expansion of an understanding of theoretical and practical aspects of pedagogy as applied to research-based methods of identifying and remediating reading problems. Candidates will examine foundational concepts of assessment in reading, administer and interpret assessments to evaluate reading skills, and analyze reading assessment results to make instructional decisions. Prerequisite: Retention in Teacher Education Program, Completion of Student Teaching, Concurrent Enrollment in EDUC 456C. Course changed from 3 credits to 2 credits on May 15, 2020.</p><p><strong>EDUC-456C Reading Diagnosis Clinical (1 Credits)</strong><br/>Experience implementing the strategies identified in EDUC-456 while working with students in one elementary school grade level, 1 to 6, during individual and small group instructions for a minimum of 30 clock hours. A formal observation of a candidate\\'s teaching is conducted by college faculty at least once during the term. Feedback provided during pre-observation and post-observation conferences.  Concurrent registration in EDUC-456 is required.</p><p><strong>EDUC-499 Directed Study (1-2 Credits)</strong><br/>Prerequisite: permission of instructor.</p><p><strong>INTR-EDA90 Student Teaching 9-12 (12 Credits)</strong><br/>Placement in a high school for a 12-week, full-time assignment. Includes at least one week at the assignment prior to the start of Fall classes at Augustana. A formal observation of a candidate\\'s teaching is conducted by college faculty four times during the term. Feedback provided during pre-observation and post-observation conferences. Completion of a portfolio assessment of teaching is required. Prerequisites: Credits earned at Augustana in Educational Psychology and Methodology; Minimum of 80 Hours of Clinical Experience; Senior Classification; Retention in Teacher Education; Committee Approval</p><p><strong>INTR-EDA91 Student Teaching Art PK-12 (12 Credits)</strong><br/>Placement at two levels, one in PK-6 and the other in 7-12, for a 12-week, full-time assignment. Includes at least one week at the assignment prior to the start of Fall classes at Augustana. A formal observation of a candidate\\'s teaching is conducted by college faculty four times during the term. Feedback provided during pre-observation and post-observation conferences. Completion of a portfolio assessment of teaching is required.  Prerequisites: Credits earned at Augustana in Educational Psychology and Methodology; Minimum of 80 Hours of Clinical Experience; Senior Classification; Retention in Teacher Education; Committee Approval.</p><p><strong>INTR-EDA92 Student Teaching Music PK-12 (12 Credits)</strong><br/>Placement at two levels, one in PK-6 and the other in 7-12, for a 12-week, full-time assignment. Includes at least one week at the assignment prior to the start of Fall classes at Augustana. A formal observation of a candidate\\'s teaching is conducted by college faculty four times during the term. Feedback provided during pre-observation and post-observation conferences. Completion of a portfolio assessment of teaching is required. Prerequisites: Credits earned at Augustana in Educational Psychology and Methodology; Minimum of 80 Hours of Clinical Experience; Music Comprehensive Examination; Piano Proficiency; Senior Classification; Retention in Teacher Education; Committee Approval</p><p><strong>INTR-EDA93 Student Teaching 5-8 (12 Credits)</strong><br/>Placement in a middle school/junior high for a 12-week, full-time assignment. Includes at least one week at the assignment prior to the start of Fall classes at Augustana. A formal observation of a candidate\\'s teaching is conducted by college faculty four times during the term. Feedback provided during pre-observation and post-observation conferences. Prerequisites: Credits earned at Augustana in Educational Psychology and Methodology; Minimum of 80 Hours of Clinical Experience; Senior Classification; Retention in Teacher Education; Committee Approval.</p><p><strong>INTR-EDA95 Student Teaching 1-6 (12 Credits)</strong><br/>Placement in an elementary school or middle/junior high school for a 12-week, full-time assignment. Includes at least one week at the assignment prior to the start of Fall classes at Augustana. A formal observation of a candidate\\'s teaching is conducted by college faculty at least four times during the term. Feedback provided during pre-observation and post-observation conferences. Completion of a portfolio assessment of teaching is required. Prerequisites: Credits earned at Augustana in Educational Psychology and Methodology; Minimum of 80 Hours of Clinical Experience; Senior Classification; Retention in Teacher Education; Committee Approval.</p>');",
  "scrape_metadata": {
    "original_title": "Education",
    "dept_slug": "education",
    "original_url": "https://augustana.edu/academics/areas-of-study/education",
    "courses_url": "https://augustana.edu/academics/areas-of-study/education/courses",
    "scrape_timestamp": "2025-09-26 19:57:41",
    "status": "success"
  }
}