{
  "program_title": "English and Creative Writing course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/english-and-creative-writing/courses",
  "faculty": [],
  "requirements": {
    "major_in": "32 credits, including ENGL 215, 1 class in American literature (ENGL 265, 370, 375, 385), 1 class in British literature (ENGL 260, 262, 315, 327, 335, 340), 1 class in literature written pre-1800s (ENGL 250, 262, 315, 325, 326 327), 1 class in Diverse literature (ENGL 255, 270, 275, 278, 285, 290, 295, 345, 350, 355, 390), 8 credits of electives (in either ENGL or ENCW), and Senior Inquiry (ENGL 401). Only one 1xx level class will count towards the major, and at least 4 classes must be at the 3xx level. Note: courses may satisfy only one major requirement (e.g., ENGL 315 can count for British or pre-1800s, but not both). 30 credits, including one 2xx level ENGL class, two 2xx level ENCW classes, three 3xx level ENCW classes, one ENCW or ENGL elective at the 2xx level or higher, a 0-credit internship (may be completed by working one year on Saga, taking ENGL 300: Book Publishing, or completing a community internship with faculty supervision and creative writing faculty approval), and Senior Inquiry (ENCW 490). 42 credits. 40 credits in English including 215, 260, 265, 210, 310; a Shakespeare class (250 or 327); two American literature classes (one from 370, 375, 385 , and one from 270, 275, 278, 290, 390, or others pre-approved by the ELA advisor); a world literature class (285, 295, 345, 350 or WGSS 230); one elective ENGL (300 or higher) OR ENCW (200 or higher); plus two credits in Communication Studies (COMM 203 Listening). The English department allows the combination of EDUC422, EDUC450, and INTR-EDA90 to fulfill the English Senior Inquiry requirement. See the Director of Secondary Education for more information.",
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": "20 credits, including ENGL 215, 1 class in American literature (ENGL 265, 370, 375, 385), 1 class in British literature (ENGL 260, 262, 315,317, 335, 340), and 2 electives (in either ENGL or ENCW). Only one 1xx level class will count towards the minor, and at least 2 classes must be at the 3xx level. 20 credits, including three classes from ENCW (at least one of which must be at the 300 level) and two classes from ENGL (at least one of which must be at the 300 level)",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors . -->",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=engl",
  "courses_html": "document.write('<p><strong>ENGL-101 Introduction College Discourse (1 Credits)</strong><br/>Instruction and practice in the careful writing, close reading, and critical thinking that a liberal arts education requires of students. Conducted in an individualized tutorial with Reading/Writing Center tutors. Recommended for first-year students. Permission of instructor required.</p><p><strong>ENGL-102 Strategies College Discourse (1 Credits)</strong><br/>An individualized tutorial with Reading/Writing Center tutors in conducting research on a topic of the student\\'s choice. Methods and practice in managing liberal arts processes of inquiry, critical reading, research, reasoned evaluation and written expression. Recommended for first-year or sophomore students. Permission of instructor required.</p><p><strong>ENGL-104TR Tech Writing Transfer Elec (3 Credits)</strong><br/></p><p><strong>ENGL-105 Grammar Bootcamp (2 Credits)</strong><br/>A 7-week study of the basic elements of grammar with a focus on the function of parts of speech within sentences. Course will also include units on sentence combining and fundamental mechanics (particularly punctuation).</p><p><strong>ENGL-110 Rhetoric and Culture of the U.S. (4 Credits)</strong><br/>A seminar course for international students in transition to academic life at a liberal arts college, with a focus on development of formal and informal language skills for non-native speakers of English in conjunction with a study of academic, regional, and national culture.</p><p><strong>ENGL-125B Literature and Business (4 Credits)</strong><br/>(PL) A literature course for students interested in professional work, finances, consumerism, and the so-called American Dream. Texts will include classic and contemporary works (both written and visual) on work, earning, spending, and seeking economic justice. For First Year and Sophomore students only.</p><p><strong>ENGL-125F Literature and Food (4 Credits)</strong><br/>(PL) This class examines the subject of food in literature. Since characters don\\'t need to eat to stay &quot;alive&quot; and readers can\\'t actually share in the food being described, what are the purposes of literary food scenes? In this class, we will look at important food scenes in fiction and poetry(and make and share this food together)to better understand the complex social relations (including identity, community, race, gender, class, and ecology, etc.) that these scenes express.</p><p><strong>ENGL-125M Literature and Medicine (4 Credits)</strong><br/>(PH) A literature course for students interested in those who suffer with injuries or illness, and those who care for such people: doctors, nurses, aides, even pastors and counselors. Readings will include classic and contemporary novels, stories, poems, and other genres concerning professional ethics and philosophical-religious commitments amid suffering, death, and recovery.</p><p><strong>ENGL-125R Literature of Faith and Doubt (4 Credits)</strong><br/>(PH) A study of the creative tensions and interactions between faith and doubt and between ambiguity and certainty through works drawn from several periods and genres of English Language literature.   This course will be taught in Holden Village J Term 2021-2022. Permission is required.</p><p><strong>ENGL-125S Literature and Sports (4 Credits)</strong><br/>(PL) A literature course for students interested in sports writing and the drama of sports competitions. Readings will include stories from the sports page, longer essays on the meaning of sports, and novels, poems, and other genres depicting athletes competing while seeking greater meaning in their lives. For First Year and Sophomore students only.</p><p><strong>ENGL-125T Literature and the Movies (4 Credits)</strong><br/>(PH) Literature and the Movies addresses both the entertainment value of literature and the ability of reading and movie-watching to inform us about human purpose and ethical responsibility. Attention paid to the meanings of brief plays, short stories, and novels and then to the ways meaning is retained and altered as the literary work becomes transformed into a screen entertainment. Readings and film versions will include both classic works and contemporary popular publications.</p><p><strong>ENGL-125TR Literature Transfer Elective (3-5 Credits)</strong><br/></p><p><strong>ENGL-180 Special Topics in Literature (3-4 Credits)</strong><br/>This course focuses on significant literary works, themes, periods, writers, or genres not normally taught or covered in the traditional lower-level electives.</p><p><strong>ENGL-199 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: consent of department chair and instructor.  </p><p><strong>ENGL-201 Tutoring Theory and Practice (2 Credits)</strong><br/>This weekly colloquium prepares selected students to be peer tutors in the Reading/Writing Center. Through readings in writing center theory, written assignments, and observations of experienced tutors, the course enables students to define their roles as tutors and to understand and respond to the reading/writing processes of a diverse group of college students. Students are selected through application to the Reading/Writing Center director. Permission of instructor required.</p><p><strong>ENGL-202 Tutoring Theory and Practice II (2 Credits)</strong><br/>This second weekly colloquium is taken concurrently with a student\\'s first semester of tutoring in the Reading/Writing Center. It examines in greater complexity the tutor/student relationship, writing center theories, and current research in the field, while supporting new tutors as they apply their preparation to actual tutoring sessions. Increased emphasis is placed on the expectations of writing in various disciplines and on assisting writers from cultures and backgrounds different from one\\'s own. Prerequisite: 201 and permission of instructor.</p><p><strong>ENGL-205TR Children\\'s Lit Elective (3-5 Credits)</strong><br/></p><p><strong>ENGL-206TR Adolescent Lit Elective (3-5 Credits)</strong><br/></p><p><strong>ENGL-210 The Language of Literature (4 Credits)</strong><br/>(PL) An analysis of the ways that ordinary language and literary language communicate meaning. Half of the course will consider grammatical standards and fluent, stylish sentences. This learning should help students both to write with more control and to understand their reading at a deeper level. The other half of the course will consider specifically literary communication, such as biblical and classical allusions, symbols, forms and genres, and figurative language. This learning should help students to read literature with deeper understanding. Required for English Language Arts majors; strongly encouraged for literature majors in any language, especially English.</p><p><strong>ENGL-215 Writing About Literature (4 Credits)</strong><br/>This writing-intensive course is designed to equip potential English majors/minors with the tools they need to read, interpret, and write about literature. In particular, we\\'ll study some fundamental methods that informed readers use to interpret literature, learn how to distinguish between more and less effective interpretations, and practice using textual analysis to support a compelling argument. We will also examine a variety of theoretical lenses that readers can apply to literature, such as New Historicism, Postcolonialism, and Feminism.</p><p><strong>ENGL-230 Environmental Literature (4 Credits)</strong><br/>(PH) An introduction to the history of and trends in nature writing and environmental literature.</p><p><strong>ENGL-235 Science Fiction and Fantasy (4 Credits)</strong><br/>(PL) An introduction to the alternative worlds of myth, fantasy, utopia and dystopia. Students will develop the close-reading skills and vocabulary of the discipline as they explore deeper meaning, ambiguity, and complexity in classic and contemporary works of fantasy and science fiction.</p><p><strong>ENGL-240 Poetry (4 Credits)</strong><br/>(PL) Readings of selected poems to acquaint students with historical and contemporary trends and to promote an appreciative and critical understanding of poetry.</p><p><strong>ENGL-250 Shakespeare and Film (4 Credits)</strong><br/>(PL) An introduction to Shakespeare\\'s tragedies and comedies. Reading the plays and watching popular mass-market film versions, students will learn to appreciate Shakespeare\\'s ability to combine complex ideas with compelling entertainment. Special attention paid to Shakespeare\\'s historical moment.  In order to make time for film-watching during January, students will read a book over break.  Since proof of this reading will be due when the course begins, be certain to contact the professor or respond to his emails before Winter Break for details.</p><p><strong>ENGL-255 Women in Literature (4 Credits)</strong><br/>(PL,D) This course examines representations of women in literature and introduces students to women\\'s literary traditions.</p><p><strong>ENGL-260 History of British Literature (4 Credits)</strong><br/>(PP) English literature and social history from Beowulf and the Middle Ages to Virginia Woolf and the modern world. This course will introduce students to the study of literature, emphasizing the aims, methods, and tools of the discipline. Students will become familiar with critical vocabulary, with selected authors and with genre and historical context in a way that will carry over to more advanced classes.</p><p><strong>ENGL-262 Origins of English Culture (4 Credits)</strong><br/>(PL) This immersive J-term class studies the development of the British Nation through classic and contemporary works of literature in the places that inspired their authors. We will explore the literary landscapes of Oxford, Stratford-upon-Avon, and London with a focus on three figures of history who helped shaped the sense of being British: King Alfred of the Anglo-Saxons, King Arthur of the Britons, and William Shakespeare, chronicler of the new United Kingdom that began to emerge in the Renaissance. While studying these figures of the past, we will read modern authors that represent the Britain of today-from crime novelists, to Science Fiction and Fantasy writers, to voices from the growing numbers of immigrant British.</p><p><strong>ENGL-265 History of American Literature (4 Credits)</strong><br/>(PP) American literature and social history from 1620 to the present. This course will introduce students to the study of literature by emphasizing the aims, methods, and tools of the discipline. Students will become familiar with critical vocabulary, with selected authors, and with genre and historical context in a way that will carry over to more advanced classes.</p><p><strong>ENGL-268 American Writers in Paris (4 Credits)</strong><br/>(PL)Taught in Paris, this immersive J-Term class on the cultural moment of modernism explores the intersections between modern literature, art, music, and politics.  This course will travel to Paris J-Term 2021-2022.</p><p><strong>ENGL-270 Multicultural Literature of the U. S. (4 Credits)</strong><br/>(PL,D) This course offers students the opportunity to study the literary traditions of the United States and how they have been influenced by various factors like race, ethnicity, gender, religion, national origin, geography, lifestyle, and socioeconomic status. The selection of contemporary writers including African American, Hispanic, Asian American, Jewish, and Native American writers will enable students to discover the varieties of both common and distinguishing factors in the life experiences and literary expressions of writers and other artistes of different backgrounds.</p><p><strong>ENGL-275 Intro to African-American Lit (4 Credits)</strong><br/>(PL,D) Principal works by African Americans representing literary forms and significant currents of thought from the era of slavery to the present.</p><p><strong>ENGL-278 Native American Indian Literature (4 Credits)</strong><br/>(PL,D) Through the study of fiction, poetry, myth, and memoir by American Indian writers, American Indian Literature explores the tragic history and enduring culture of indigenous non-Europeans on the North American continent. Special attention to the writers of the Native American Renaissance, such as Simon Ortiz, Joy Harjo, Leslie Marmon Silko, James Welch, Louise Erdrich, and Sherman Alexie-and to the diverse kinship groups (Ojibwe Laguna Pueblo, Wampanoag) with which these and other writers identify.</p><p><strong>ENGL-283 Intro to Irish Literature (4 Credits)</strong><br/>(PL) Irish Literature has long been considered both a sub-field of British literature and a national literature of its own.  This course is designed to illustrate the long development of Irish literature in Gaelic and in English over the centuries, as well as to highlight some of the most celebrated individual Irish works and authors.</p><p><strong>ENGL-285 Introduction to Postcolonial Literature (4 Credits)</strong><br/>(PH,G) A literature course for students interested in English as a world language, and the struggles for justice and identity of people in former colonies of Britain. Readings will include classic and contemporary novels, stories, poems, and other genres written in English in or about the nations of Africa, Asia, and the Indian subcontinent. </p><p><strong>ENGL-290 Introduction to Arab-American Literature (4 Credits)</strong><br/>(PH,D) Through the novels of Naome Sihab Nye and Mohja Kahf and poems of Sam Hamod, this course will focus on the question of Arab-American identity and political racism that targets this group. These readings also portray the communal life and what it means to be an Arab as well as an American.  </p><p><strong>ENGL-292 Illness Narratives (4 Credits)</strong><br/>(PL) This course explores the different stories told about illness: by our culture, by the medical profession, and by sick people themselves. Our aim will be to examine how such stories can help, and sometimes hurt, people trying to understand and come to terms with their illnesses. In addition to fictional literary texts, we will read nonfictional accounts of illness written by the sick and suffering, and study different &quot;types&quot; of illness narratives, and the effect they have on the ill.</p><p><strong>ENGL-295 Women, Health In/& South Asian Lit (4 Credits)</strong><br/>(PH,G) This course will focus on how South Asian women writers examine the interaction among biological, behavioral, and sociocultural factors in women\\'s health. In particular, the class will examine the representation (in fiction, non-fiction, and films) of the challenges local communities face in managing education, health care, their environment, borders, capital, and families in the context of increasing urbanization, immigration and digitization. We will be motivated by two interrelated concerns: 1) how can we understand the question of women\\'s voices and &quot;agency&quot; in the South Asian context? And 2) how do women writers mobilize the category of gender to define alternative understandings of &quot;individual&quot; and &quot;community&quot; in this region? In order to answer these questions, we will trace the intersections between gender, caste, class, religion, and sexuality in women\\'s fiction and non-fiction writing, giving particular regard to concepts such as &quot;tradition,&quot; &quot;modernity,&quot; &quot;nation,&quot; and &quot;genre.&quot;</p><p><strong>ENGL-298 Career Discovery (1 Credits)</strong><br/>This class provides a personalized framework for English majors to help them discover how they might apply their major after college. The class focuses on student self-assessment, including personal attributes such as values, interests, personality, skills, and purpose. Students begin the process of exploring possible career pathways. No prerequisite, but students are encouraged to take the course in their sophomore or junior year.</p><p><strong>ENGL-299 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: consent of department chair and instructor.</p><p><strong>ENGL-300 Book Publishing (4 Credits)</strong><br/>An introduction to the history of book printing and publishing with practice in publishing books through Augustana\\'s East Hall Press.</p><p><strong>ENGL-305 Children\\'s Literature (4 Credits)</strong><br/>(PL) Advanced study of literature for children exploring poetry, folktales, picture books, nonfiction, multi-cultural texts, and several genres of fiction. Students will experience different ways of reading text (such as reading aloud, literature circles, literary criticism) and consider historical context, genre, and culture in order to determine the merit and value of specific texts.</p><p><strong>ENGL-310 Adolescent Literature (4 Credits)</strong><br/>(PL) Advanced study of literature appropriate to the needs and interests of high school students, with theoretical issues relevant to the teaching profession and individual reader.</p><p><strong>ENGL-315 Medieval Literature (4 Credits)</strong><br/>Advanced study of medieval literature, emphasizing how genres carry meaning and reveal the social configurations and cultural richness of the Middle Ages.</p><p><strong>ENGL-327 Advanced Shakespeare (4 Credits)</strong><br/>(PH) This course, open to both English majors and other interested students, explores all four of Shakespeare\\'s dramatic genres (comedies, histories, tragedies, and romances) along with corollary biographical resources; scholarship on Elizabethan and Jacobean social, colonial, and religious history; and relevant literary criticism.  Prerequiste: FYI or FYH 101.</p><p><strong>ENGL-335 Developing English Novel (4 Credits)</strong><br/>This course studies the development of the novel in England during the 19th century, the pinnacle of literary realism. We\\'ll pay particular attention to the novel in its social/historical context, studying the ways in which the novel shaped, challenged, or reinforced readers\\'  understandings of gender, class, race, and empire. Authors include Jane Austen, Charlotte Bronte, Charles Dickens, and George Eliot.</p><p><strong>ENGL-340 Modernism in British Literature (4 Credits)</strong><br/>Advanced study of major British poets and novelists of the 20th century with special attention to critical definitions of modernism.</p><p><strong>ENGL-345 Empire and Outsiders (4 Credits)</strong><br/>(G) In this course we will study major literary and cinematic texts written/directed during the British colonial period as well as the postcolonial period. You, as a reader, will have an opportunity to appreciate and respect diverse centralities and to cultivate an awareness that honors different cultural perspectives. We must remember, as Chimamanda Adichie notes,that there is a great danger in believing in one single story. To understand Africa or South Asia we must listen to all stories. It is in this sense that this class breaks barriers, crosses borders and opens boundaries. As you read, write, and think over the course of the semester, and as you immerse yourselves in these works and the historical periods in which they were written, you will become more adept at analyzing human thought (perception, motivation, relation), philosophy (free will, determinism, good, evil), and social issues(racism, feminism, economics).</p><p><strong>ENGL-350 Anglophone Literature (4 Credits)</strong><br/>(PL,G) Advanced study of postcolonial writing in English-speaking countries like India, Nigeria, and Jamaica. Topic and critical emphasis will vary to include a range of authors, genres and global issues.</p><p><strong>ENGL-355 Women Writrs & Feminist Thry (4 Credits)</strong><br/>(D) This course examines women\\'s literary traditions in England and America from the 19th century to the present. In particular, it explores how literary texts written by men have represented and defined women, and how female writers have responded to, revised, or challenged those representations, in both their literary and theoretical writings. We will also examine whether the category of &quot;women writers&quot; is itself a problem, given the wide variety of female voices, and critiques of Anglo-American feminist theory by African American, postcolonial, and lesbian feminist critics.</p><p><strong>ENGL-370 American Realism (4 Credits)</strong><br/>Advanced study of American prose from the late-nineteenth century with emphasis on how writers developed new representational strategies to negotiate the upheavals of the era, including the aftermath of reconstruction, mass urbanization and immigration, new technologies (railroads, photography), the rise of consumer capitalism, and the beginnings of modern feminism.</p><p><strong>ENGL-375 American Modernism (4 Credits)</strong><br/>Advanced study of major American poetry and prose fiction of the first half of the 20th century with special attention to critical definitions of modernism.</p><p><strong>ENGL-380 Advanced Study in Special Topics (4 Credits)</strong><br/>This course focuses on significant literary works, themes, periods, writers, or genres not normally taught or covered in the traditional upper-level electives, with attention to literary criticism, history, and theory that enriches their study. </p><p><strong>ENGL-385 Contemporary Literature (4 Credits)</strong><br/>Advanced study of American (and some British) poetry and fiction from 1950 to present, reflecting tensions of the Cold War, the youth movements of the 1960s, debates over civil rights, and varying literary styles.</p><p><strong>ENGL-390 Contemporary African American Literature (4 Credits)</strong><br/>(PL,D)  Advanced study of African American fiction, drama and poetry from the Harlem Renaissance to the present.</p><p><strong>ENGL-392 Narrative Medicine (4 Credits)</strong><br/>Many people are frustrated with a healthcare system that often dehumanizes patients and healthcare workers alike. The emerging field of narrative medicine attempts to address these concerns by applying skills learned in the literature classroom to medical encounters. In this class, we will learn techniques for reading closely and carefully-being curious, noticing details, and interpreting what they mean in a particular context-and explore how these skills can help healthcare workers better engage with, diagnose, and treat patients. Further, we\\'ll study how reading literature can help doctors and nurses imagine their way into the experiences and suffering of the ill, so that they might better and more humanely care for them. Finally, we will learn reflective writing techniques that can help those in the medical profession address and heal from the moral injuries they suffer in an increasingly corporate and profit-driven healthcare system. Note: this course is designed for those who want to enter the medical profession, but all are welcome.</p><p><strong>ENGL-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>ENGL-395 Major Authors (4 Credits)</strong><br/>Intensive study of works by one or two major authors to be named by the department annually, along with inquiry into the literary criticism, theory, history, and biography that enriches an understanding of those works.</p><p><strong>ENGL-398 Advanced Book Publishing (1 Credits)</strong><br/>Advanced practice in the fundamentals of book publishing, emphasizing the techniques of editing and electronic formatting. Prerequisite: ENGL 220.</p><p><strong>ENGL-399 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: consent of department chair and instructor.  </p><p><strong>ENGL-400 Independent Study (1-2 Credits)</strong><br/>Advanced critical study or research on a specific topic for seniors majoring in English. Prerequisite: consent of English faculty based on submission of proposal.  </p><p><strong>ENGL-401 Senior Inquiry (4 Credits)</strong><br/>Intensive study of a literary problem, genre, period, or major author (topics vary). Students produce a researched essay on some aspect of the seminar topic. Course should normally be taken in the senior year, but some students (particularly those planning graduate school in English or comparative literature) may take the seminar in junior year with permission of department chair and instructor. Prerequisites: declared English major, junior or senior standing.</p><p><strong>ENGL-499 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: consent of department chair and instructor.  </p><p><strong>ENGL-ELEC AP English Elective (4 Credits)</strong><br/></p><p><strong>ENGL-ELECIB IB English (1-12 Credits)</strong><br/></p>');",
  "scrape_metadata": {
    "original_title": "English and Creative Writing",
    "dept_slug": "english-and-creative-writing",
    "original_url": "https://augustana.edu/academics/areas-of-study/english-and-creative-writing",
    "courses_url": "https://augustana.edu/academics/areas-of-study/english-and-creative-writing/courses",
    "scrape_timestamp": "2025-09-26 19:57:46",
    "status": "success"
  }
}