{
  "program_title": "Environmental Studies course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/environmental-studies/courses",
  "faculty": [],
  "requirements": {
    "major_in": "36 credits, distributed among Core Courses (20 credits), 1 required (4 credits), and 3 elective courses (12 credits). Take the following five core courses (20 credits): ENVR 100 (or GEOG 106 or GEOL 102), 101, 300, 401, and 402. Take 1 course (4 credits): GEOG 273 (Intro GIS for Natural Sciences), GEOG 274 (Intro GIS for Social Sciences), or GEOG 375 (Applied Environmental GIS). Electives. Students must work with their advisor to design an integrated sequence of electives prior to enrolling in ENVR 300. Take 12 credits from the following courses: BIOL 324 (Techniques in Natural History), BIOL 327 (Conservation Biology), BIOL 386 (Ecology), CHEM 117 (Environmental Chemistry), ECON 221 (Environmental Economics), ENGL 230 (Environmental Literature), ENVR 385, ENVR 386,ENVR 387, ENVR 388, GEOG 105 (Weather, Climate, and Society), GEOG 106 (Earth’s Dynamic Landscape and Society), GEOG 303 (Natural Resource Management), GEOG 306 (Soil Science), GEOG 307 (Our Environmental Legacy and Our Future), GEOG 323 (Urban Planning and Environmental Justice), GEOL 101 (Physical Geology), GEOL 102 (Environmental Geology), HIST 133 (American Environment), HIST 330 (Public History and Memory), POLS 326 (Politics of Environmental Policy), SOAN 101 (Introduction to Sociology and Social Justice), SOAN 102 (Introduction to Anthropology), or SOAN 340 (Environmental Sociology). At least two of the electives (8 credits) must be taken at the 300 or 400 level. No more than two of the electives (8 credits) can be taken from the same department. ENVR 380 may be substituted for one of the above electives on a case-by-case basis depending on the specific course offering.",
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": "24 credits, distributed among Core Courses (12 credits), 1 required (4 credits), and 2 Elective Courses (8 credits). Take the following three core courses (12 credits): ENVR 100 (or GEOG 106 or GEOL 102), 101, and 300 Take 1 course (4 credits): GEOG 273 (Intro GIS for Natural Sciences), GEOG 274 (Intro GIS for Social Sciences), or GEOG 375 (Applied Environmental GIS) Electives. Students must work with their advisor to design an integrated sequence of electives prior to enrolling in ENVR 300. Take 8 credits from the following courses: BIOL 324 (Techniques in Natural History), BIOL 327 (Conservation Biology), BIOL 386 (Ecology), CHEM 117 (Environmental Chemistry), ECON 221 (Environmental Economics), ENGL 230 (Environmental Literature), ENVR 385, ENVR 386, ENVR 387, ENVR 388, GEOG 105 (Weather, Climate, and Society), GEOG 106 (Earth’s Dynamic Landscape and Society), GEOG 303 (Natural Resource Management), GEOG 306 (Soil Science), GEOG 307 (Our Environmental Legacy and Our Future), GEOG 323 (Urban Planning and Environmental Justice), GEOL 101 (Physical Geology),GEOL 102 (Environmental Geology), HIST 133 (American Environment), HIST 330 (Public History and Memory), POLS 326 (Politics of Environmental Policy), SOAN 101 (Introduction to Sociology and Social Justice), SOAN 102 (Introduction to Anthropology), or SOAN 340 (Environmental Sociology). ENVR 380 may be substituted for one of the above electives on a case-by-case basis depending on the specific course offering. ENVR 100, 4 credits (or GEOG 106 or GEOL 102) ENVR 101, 4 credits ENVR 300, 4 credits ENVR 401, 4 credits ENVR 402, 4 credits",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=envr",
  "courses_html": "document.write('<p><strong>ENVR-100 Sustainability: Ecological Dimension (4 Credits)</strong><br/>(PN)In-depth interdisciplinary examination of complex sustainability problems (water, food systems, climate change, forests, etc.) including their systemic structure, dynamics, future development, and normative issues. In-depth examination of human dependence upon and alteration of supporting (biodiversity, disturbance regimes, soil resources, hydrological cycle, and nutrient cycles), regulating, provisioning, and cultural ecosystem services. Emphasis on formulating an interdisciplinary model to understand the resilience and vulnerability of complex social-ecological systems (SES) to disturbances and stresses and using such model to assess the social, economic, and environmental dimensions of local and regional sustainability problems. Introduction to key methods used to identify, analyze, and solve the ecological dimensions of such problems. Students will complete an ecologically-oriented campus-based sustainability project. The culminating project and case study will require students to place the ecological component of such systems within the context of the entire SES by emphasizing the two-way interactions (dependence of human well being on ecosystem services and influence of human pursuits of well-being on such services) between the ecological and social components. Includes one two-hour lab per week that focuses on a campus or local sustainability problem.  Seniors by permission only.</p><p><strong>ENVR-100L Lab for 100 (0 Credits)</strong><br/></p><p><strong>ENVR-101 Sustainability: Social Dimension (4 Credits)</strong><br/>(PS) This course provides an in-depth examination of the structure and dynamics of complex sustainability problems. We pay particular attention to the role of humans in creating and responding to these problems by investigating the relationships between our natural world and social, cultural, and political institutions. Particular topics may include: population and consumption dynamics; environmental justice; social and behavioral change; environmental policy; and food, energy, and water systems. Students will complete a campus-based sustainability project focused on social and/or behavioral change. Seniors by permission only.</p><p><strong>ENVR-150 Variation & Conservation (4 Credits)</strong><br/>(PN) Population genetics is at the intersection of molecular biology, genetics, and population biology with the aim to study genetic variation in populations. Genetic variation is the foundation for species and ecosystem diversities, as well as the raw material for evolution to act upon. This course will introduce students to the basics of population genetics by studying how genetic variation occurs and how genetic variation can change within and between populations. Students will use and derive basic quantitative models from published genomic datasets to understand different evolutionary forces. Students will have developed a population genetics portfolio with step-by-step protocols that can be referenced and built upon in future endeavors. Lastly, students will discuss how their derived genetic results can inform conservation management and policy.</p><p><strong>ENVR-300 Sustainability Problems & Solutions (4 Credits)</strong><br/>Intermediate level examination of the complex sustainability problem of climate change and access to modern energy production, emphasizing the complex direct and indirect cross-scale interactions between the social and ecological components of such systems. In-depth examination of relationship between access to modern energy and human well-being and climate change challenge facing humanity. Emphasis on refining the interdisciplinary model developed in ENVR 100/101 sequence and using such model to compare and contrast the environmental, social, economic, political, and ethical/moral dimensions of alternative energy resources and technologies (coal, natural gas, wind, solar, geothermal, nuclear, biofuels, biomass, hydro, etc.) and assess future alternative scenarios of systems. Students formulate an action-oriented of portfolio of solution strategies to drive a transition to a more sustainable society by avoiding dangerous climate change and improving human well-being without exceeding the Earth\\'s life support systems. Students will complete a significant team-based project that develops a solution to a local energy problem in collaboration with a campus or external stakeholder. Includes one four-hour lab per week that focuses on field trips to energy generating facilities and real-world simulations and negotiations. Prerequisites: ENVR 100 and ENVR 101 or consent from instructor.</p><p><strong>ENVR-300L Lab for 300 (0 Credits)</strong><br/></p><p><strong>ENVR-380 Special Topics (4 Credits)</strong><br/>Students use an interdisciplinary and systems approach to conduct an in-depth analysis of the social, economic, and environmental dimensions of a real-world sustainability problem facing campus or a community in the region.</p><p><strong>ENVR-385 Plant Diversity (2 Credits)</strong><br/>Morphology, evolution, and taxonomy of plants with emphasis on plant families, especially those local to Rock Island and the Augustana campus. Certain groups may be emphasized based on instructor\\'s expertise.</p><p><strong>ENVR-386 Animal Diversity (2 Credits)</strong><br/>Morphology, evolution, and taxonomy of animals with emphasis on animal families, especially those local to Rock Island and the Augustana campus. Certain groups may be emphasized based on instructor\\'s expertise.</p><p><strong>ENVR-387 Environmental Justice (4 Credits)</strong><br/>(D) Although environmental conditions impact all people, environmental risks and amenities are not equitably distributed across places or populations. These inequities have prompted a consideration of the linkages between environmental issues and social justice. This course explores those linkages. We will work to understand the connections between environmental and human health, the evidence and explanations for differential distributions of environmental risks and amenities across populations, and the differing community responses to environmental injustices. By applying social concepts and examining a wide range of environmental justice case studies, we can better understand how and why inequalities arise, and why some communities are able to work more effectively towards environmental justice</p><p><strong>ENVR-388 Env. Conflict & Neg. (4 Credits)</strong><br/>(PH) Environmentalism is contentious and environmental conflicts are constantly taking shape. Negotiation is a process for managing environmental conflicts; it is a process of jointly making decisions to reconcile different interests. This course will focus on developing negotiation skills that can be applied to situations of environmental conflict. Through the use of negotiation simulations and case studies, we will examine contemporary environmental conflicts, identify the opportunities and challenges of using negotiation processes to manage environmental conflicts, and develop and practice our own negotiation skills. While the cases we discuss in class will pertain to environmental issues, the negotiation skills learned and developed in this course are easily transferable to other domains.</p><p><strong>ENVR-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>ENVR-399 Directed Study (1-2 Credits)</strong><br/></p><p><strong>ENVR-400 Independent Study (1-2 Credits)</strong><br/></p><p><strong>ENVR-401 Sustainability Seminar (4 Credits)</strong><br/>Investigation of the structure and dynamics of a local sustainability problem in preparation for the capstone experience (ENVR 402). Students are introduced to the key concepts, theories, and methods through case studies of model sustainability issues as well as those local to the Quad Cities. Taken in the spring term of the junior year. Prerequisites: ENVR 300 (including simultaneous enrollment) or consent from instructor.</p><p><strong>ENVR-402 Capstone Experience (4 Credits)</strong><br/>Working as teams and mentored by an interdisciplinary team of faculty, students use a sustainability science approach (combining interdisciplinary and collaborative methods) to conduct an in-depth assessment of the social, economic, and environmental dimensions of a real-world sustainability problem facing a community. Emphasis on the collection and analysis of information and data on the social ecological system. Advance training on the functionally linked complex of knowledge, skills, and attitudes necessary to solve complex, controversial sustainability problems including: collaborative team work, impactful stakeholder engagement, comprehensive project management, effective and empathic communication, and conflict resolution. Includes one 4-hour lab per week. Prerequisite: ENVR 401.</p><p><strong>ENVR-402L Lab for 402 (0 Credits)</strong><br/></p><p><strong>ENVR-499 Directed Study (1-2 Credits)</strong><br/></p>');",
  "scrape_metadata": {
    "original_title": "Environmental Studies",
    "dept_slug": "environmental-studies",
    "original_url": "https://augustana.edu/academics/areas-of-study/environmental-studies",
    "courses_url": "https://augustana.edu/academics/areas-of-study/environmental-studies/courses",
    "scrape_timestamp": "2025-09-26 19:57:51",
    "status": "success"
  }
}