{
  "program_title": "Film course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/film/courses",
  "faculty": [],
  "requirements": {
    "major_in": null,
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": null,
    "gpa_note": null,
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=film",
  "courses_html": "document.write('<p><strong>FILM-100 Introduction to Film Studies (4 Credits)</strong><br/>(PA) A foundational knowledge of film theory and criticism increases understanding and appreciation of the elements, structure, form, aesthetics, symbolism, representational codes, and goals of movies originating from many different periods and regions worldwide. Considering various technical and creative components, genres, cultural and socio-political movements, students learn to decipher established codes and formulate new meanings in cinematic expression through the practice of reading film as text and engaging in active critical analysis.</p><p><strong>FILM-200 History of Film & Television (4 Credits)</strong><br/>(PP) This course looks at the history of motion picture media from its invention to contemporary times, covering cinema and television from inception to today. Framed by the technological, narrative, aesthetic, thematic, economic, and cultural trends of the various formats, the course explores prominent directors, studios, and platforms originating from the U.S. and abroad.  PP was awarded on 02/20/2023.</p><p><strong>FILM-200TR Film Transfer Elective (1-12 Credits)</strong><br/></p><p><strong>FILM-250 Production Fundamentals (4 Credits)</strong><br/>Single-camera video production process is practiced from start to finish on two short individual projects, guiding wholistic creators through basic conception, writing and development, pre-production, production, and post-production. Students engage with topical research, logistics and planning, manual video and audio terminology, equipment operation, and production process, video image and soundtrack composition, lighting terms and operation, and video editing software and aesthetics. The course offers constructive criticism through project drafts to help students achieve quality video stories that communicate creatively and meaningfully with purpose.</p><p><strong>FILM-270 Documentary Filmmaking (4 Credits)</strong><br/>(PA) nformed on various storytelling modes and forms that are commonly utilized in documentary filmmaking, students put that knowledge into practice through the planning, production, and editing of complete, short- subject documentaries that tell compelling stories. The basics of video pre-production, production, and post-production process, documents, and technology are explored as they relate to the genre of documentary short film.</p><p><strong>FILM-300 Business of Film Producing (4 Credits)</strong><br/>Guiding the aspiring film producer hands-on through many of the legal, logistical, technical, and creative duties and processes that film producing requires, solving problems creatively, students gain experience navigating the business-side of production and leave with the toolkit needed to see the next film project through to the end as producer. Topics include fictional narrative and documentary research and development, budgeting, funding, hiring, scheduling, permits, contracts, licenses, document preparation, finishing, marketing, distribution, and exhibition.</p><p><strong>FILM-350 Crew Production (4 Credits)</strong><br/>Collaborative film production is the focus of this professional-practice course in audiovisual storytelling. Students work in standard industry roles as a crew with their classmates on script- based film/TV/web-series projects, contributing collectively to the planning and recording of live- action content that they work with in post-production as individuals. The full crew production process is practiced hands-on from start to finish utilizing standard industry protocol, professional film equipment, and video editing software. Prerequisite: Take FILM-250.</p><p><strong>FILM-420 Practicum (0-1 Credits)</strong><br/>Participation in film production activities.  Requires significant amount of experience and responsibility.  Prerequisite: permission of department.  (May be repeated for credit).</p><p><strong>FILM-450 Senior Film Inquiry (4 Credits)</strong><br/>In preparation for graduation, seniors lead their own film crew as (at least) producer, director, and editor, to take a project of choice from idea to completion under guided professor mentorship in this immersive capstone experience. Student directors organize self-assigned film crews to help bring productions to life that best represent their personal vision and full ability as graduating professionals in the medium, drawing upon inspiration and expertise gleaned from other courses taken across campus throughout the span of their liberal arts education. Depending on enrollment from one semester to the next, the course will run as a multi-student class where directors are provided some crewmember support built into the curriculum, and in turn are also required to provide crew service to their peers as well, or as an independent study where students will assemble their entire crew on their own.  Permission of instructor required.</p><p><strong>FILM-499 Directed Study (1-2 Credits)</strong><br/></p><p><strong>FILM-INTR Film Internship (4 Credits)</strong><br/>Analysis of the background, structure and policy issues in the sponsoring organization. Prerequisite: a declared major or minor in Film. Departmental internships must be approved by the department.</p>');",
  "scrape_metadata": {
    "original_title": "Film",
    "dept_slug": "film",
    "original_url": "https://augustana.edu/academics/areas-of-study/film",
    "courses_url": "https://augustana.edu/academics/areas-of-study/film/courses",
    "scrape_timestamp": "2025-09-26 19:57:56",
    "status": "success"
  }
}