{
  "program_title": "French course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/french/courses",
  "faculty": [],
  "requirements": {
    "major_in": "32 credits, including FREN-301, FREN-331*, FREN-441; 12 credits of coursework in literature, culture, and civilization, which must include the following distribution: 2 credits of early period literature, 2 credits of late period literature, 2 credits of civilization/cultural studies, 2 credits of an immersive experience, 4 more credits in any of the above; 8 additional elective credits. FREN-101 and FREN-102 may not be counted toward the major. *In the case of a scheduling conflict, another advanced course may be substituted for 331 in consultation with the department.",
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": "20 credits, including FREN-301, FREN-331, and at least 4 credits of coursework from FREN 351-373; 8 additional elective credits. FREN-101, FREN-102, FRST, and WLIT may not be counted toward the minor. For an interdisciplinary minor related to French, see Linguistics .",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=fren",
  "courses_html": "document.write('<p><strong>FREN-100 Elementary French Review (2 Credits)</strong><br/>Elementary French Refresher. A review course, covering the same material and meeting at the same time as FREN 101, but restricted to students placed in 102. These students may not register for 101 (4 credits) but register for 100 (2 credits), then continue with 102 upon completion of the course. Prerequisite: placement in 102 and consent of department.</p><p><strong>FREN-100TR French Transfer Elective (1 Credits)</strong><br/></p><p><strong>FREN-101 French Language/Culture I (4 Credits)</strong><br/>Introduction to French language and the cultures of the French-speaking world. Develops skills in both written and spoken French. For students with no prior study of French.</p><p><strong>FREN-102 French Language/Culture II (4 Credits)</strong><br/>Introduction to French language and the cultures of the French-speaking world. Develops skills in both written and spoken French.  Prerequisite: FREN-100, FREN-101 or placement.</p><p><strong>FREN-199 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisites: permission of department chair and consent of instructor.  </p><p><strong>FREN-200 IB French Elective (4 Credits)</strong><br/></p><p><strong>FREN-201 Global French (4 Credits)</strong><br/>(G) This course considers relations between French-speaking places, people, and organizations internationally. It provides a survey of the francophone world that centers engagement with key issues of global relevance including human rights, climate change, public health, and sustainable development. Focuses on oral and written communication in French including grammar development and vocabulary expansion.   Prerequisite: FREN-102 or equivalent.</p><p><strong>FREN-202 Social Change (4 Credits)</strong><br/>This course explores social change in the French-speaking world. Considers topics such as (de)colonization, (im)migration, reconstruction, urbanization, consumerism, and modernization through the study of authentic cultural documents (literary and popular texts, film, photography, songs, advertisements, etc.). Provides grammar review and refinement, vocabulary expansion, conversation and pronunciation practice, and an introduction to critical writing in French. Prerequisite: FREN-201.</p><p><strong>FREN-211TR French Elective (3-4 Credits)</strong><br/></p><p><strong>FREN-242 Everyday French (4 Credits)</strong><br/>This course focuses on French-language communication skills for everyday life, while also exploring pop culture and current events of the francophone world. Includes review and refinement of appropriate grammatical concepts, relevant vocabulary expansion, and analysis of authentic cultural documents. Prerequisite: FREN-201 or equivalent or permission of instructor.</p><p><strong>FREN-243 Verb and Verse (4 Credits)</strong><br/>Study of the relationship between grammar and poetics in assorted literary texts. Students will work on different texts according to their level. The course will function both as an enhanced grammatical workshop and an introduction to literary analysis. Prerequisite:  FREN-101 or equivalent.  </p><p><strong>FREN-299 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisites: permission of department chair and consent of instructor.  </p><p><strong>FREN-301 French and the Past (4 Credits)</strong><br/>(PP) Builds on the critical writing skills developed in 202, but with a focus on French literary history. Students read short literary texts from the Middle Ages through the twentieth century,deepening their ability to read and analyze literature in the context of different time periods and movements. Intensive reading, writing, and speaking practice around these topics aims to develop greater fluency and sophistication in both spoken and written French.  Prerequisite: FREN-202, FREN-242 or placement.  PP Learning Perspective as awarded as of 02/17/2022/</p><p><strong>FREN-313 The Human Condition (2 Credits)</strong><br/>What do the moralistes and épistoliers of the seventeenth century tell us about what it means to be human? We will engage in conversation with Descartes, Pascal, La Fontaine, La Rochefoucauld, Sablé, Sévigné, La Bruyère.  Prerequisite: FREN-301 or 331.</p><p><strong>FREN-314 Nineteenth Century Poetry (2 Credits)</strong><br/>Exploration of the major poetic movements in the nineteenth century, from Romanticism through fin de siècle. Students will have the opportunity to practice producing different poetic forms and styles themselves.  Prerequisite: FREN-301 or 331.</p><p><strong>FREN-315 Life Writing (2 Credits)</strong><br/>Study of life writing from the francophone world, including autofiction, autobiography, essays, letters, graphic novels, film, and self-portraiture. Interrogates the distinctions between various genres, and explores the contexts and intentions of given works. Students will produce creative writing in French as a component of the course.  Prerequisite: FREN-301 or 331.</p><p><strong>FREN-331 Exploring Genres (4 Credits)</strong><br/>(PL) Builds on the analytical reading and writing skills developed in 301, but with a focus on the different analytical terms and tools applicable to different genres.  Organized by genre (poetry, prose, theatre) rather than by chronology.  Prerequisite: FREN-301 or 331.</p><p><strong>FREN-335 Advanced Grammar/Translation (4 Credits)</strong><br/>Intensive study of French grammar, syntax, semantics, and stylistics. Course focuses on linguistic problem solving and translation from French to English and English to French. Students deepen and refine their knowledge of the French language while also exploring interpretative strategies for reading and translating different types of texts.  Prerequisite FREN-301 or permission of instructor.</p><p><strong>FREN-341 Dangerous Liaisons (4 Credits)</strong><br/>Intensive study of Laclos\\' novel Les Liaisons dangereuses, followed by viewing and analysis of the multiple film versions of the novel. As a final activity, students will produce their own short cinematic version.  Prerequisite: FREN-301 or 331.</p><p><strong>FREN-361 French Women Writers (4 Credits)</strong><br/>Study of selected poetry and prose by French women writers from the Middle Ages through the early 20th century, looking at ideas and styles across time. Writers such as Marie de France, Marguerite de Navarre, Louise Labé, Madame de Sévigné, Isabelle de Charrière, Riccoboni, Sand, Desbordes-Valmore, Colette.  Prerequisite: FREN-301 or 331.</p><p><strong>FREN-362 The Tragicomic Muse (4 Credits)</strong><br/>Study of tragedy, comedy, and tragicomedy from the 17th through the 19th centuries: Corneille, Molière, Racine, Marivaux, Beaumarchais, Hugo, Musset, Dumas fils. Examination of the development of various theatrical genres and conventions, and the shifting definitions across time. Prerequisite: FREN-301 or 331.</p><p><strong>FREN-363 Birth of the Novel (4 Credits)</strong><br/>Study of French experiments in novelistic form, beginning with the seventeenth century text often called &quot;the first modern novel,&quot; La Princesse de Clèves, and concluding with some of the great narrative voices of the nineteenth century. Prerequisite: FREN-301 or 331.</p><p><strong>FREN-370 World Literature in French (2 Credits)</strong><br/>Study of literary texts from the Francosphere (the Maghreb, Sub-Saharan Africa, the Antilles, Quebec, Louisiana, mainland Europe, and diasporas). Explores the role of literature in generating and challenging dominant cultural narratives. Rotation of regions/topics. May be taken twice for credit with permission of instructor. Prerequisite: FREN-301 or 331.</p><p><strong>FREN-371 World Cultures (4 Credits)</strong><br/>(G) Introduction to the French-speaking world through historical, cultural, and literary texts, media, and visual arts. Includes discussion of the Maghreb, Sub-Saharan Africa, the Antilles, Quebec, and relations between these regions and France/Europe. Explores the role of literature and art in generating and challenging dominant cultural narratives.  Prerequisite: FREN-301 or 331.</p><p><strong>FREN-372 Text and Environment (4 Credits)</strong><br/>Study of literature\\'s engagement with the environment, including natural and human-made landscapes and structures, weather, and natural disasters. Considers consumption, waste, ecology, indigeneity, migration, and environmental ethics. Students will explore the use of rhetorical devices in contemporary texts and canonical works with a focus on the literary representation of sensory experience. Course includes site-specific local/regional travel.  Prerequisite: FREN-301 or 331.</p><p><strong>FREN-373 Love and Resistance (4 Credits)</strong><br/>This course draws on a variety of 20th- and  21st-century texts from the French-speaking world to explore forms of love and resistance during challenging times. Includes discussion of war, political unrest, grief, illness, and personal or cultural trauma, and the interplay between these events and the forces of gender, sexuality, race, ethnicity, class, age, and disability. Prerequisite: FREN-301 or 331.</p><p><strong>FREN-380 Special Topics (4 Credits)</strong><br/>Investigation into selected topics in francophone literary and cultural studies. May be repeated for credit with permission of instructor. Credit towards distribution requirements varies by topic.  Prerequisite: FREN-301 or 331.</p><p><strong>FREN-380A Special Topics (2 Credits)</strong><br/>Investigation into selected topics in francophone literary and cultural studies. May be repeated for credit with permission of instructor. Credit towards distribution requirements varies by topic.  Prerequisite: FREN-301 or 331.</p><p><strong>FREN-399 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisites: permission of department chair and consent of instructor.  </p><p><strong>FREN-400 Independent Study (1-2 Credits)</strong><br/>Research project in French literature or civilization for majors. Prerequisite: consent of department chair.</p><p><strong>FREN-440 Junior Seminar (2-4 Credits)</strong><br/>An optional variable-credit seminar experience for junior majors or senior minors. Students will meet with senior majors enrolled in FREN-441 for part of the term, participating in the intensive study and discussion of a particular author or issue, but not completing the final research project. Prerequisite: FREN-301 or 331, junior standing, and permission of instructor.</p><p><strong>FREN-441 Senior Seminar (4 Credits)</strong><br/>Intensive study of a particular problem, genre, movement, or author, culminating in a major research project.  Prerequisite: FREN-301 or 331 and senior standing.</p><p><strong>FREN-499 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisites: permission of department chair and consent of instructor.</p>');",
  "scrape_metadata": {
    "original_title": "French",
    "dept_slug": "french",
    "original_url": "https://augustana.edu/academics/areas-of-study/french",
    "courses_url": "https://augustana.edu/academics/areas-of-study/french/courses",
    "scrape_timestamp": "2025-09-26 19:58:05",
    "status": "success"
  }
}