{
  "program_title": "Geography course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/geography/courses",
  "faculty": [],
  "requirements": {
    "major_in": "34 credits. Geographic Fundamentals (12 credits) includes one course with a physical geography orientation from GEOG-105 or GEOG-106; one course with an urban and cultural geography orientation from GEOG-120, GEOG-123 or GEOG-130; one course with a human-environment orientation from GEOG-230, 303, 307, 331 or 332. Geographic Skills and Inquiry (14 credits) includes all of: GEOG-270, GEOG-273 or 274, GEOG-372, GEOG-472, and GEOG-473. Electives (8 credits) includes two courses selected from one of three advising tracks (GIS and Technology, Urban and Cultural Geography, or Physical and Environmental Geography). See geography advisor for details. Recommended supporting courses: J term regional field experience (GEOG-230), a statistics course (PSYC-240, BUSN-211, or SOAN-227), writing courses (ENGL-225), Public speaking and communications courses (COMM-101, 201 or 204), research methods skills (SOAN -201 or HIST-300), geography internship, or participation in a study away program. See geography advisor for additional recommended courses depending upon student interests.",
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": "20 credits. Geographic Fundamentals (12 credits) includes one course with a physical geography orientation from GEOG-105 or GEOG-106; one course with an urban and cultural geography orientation from GEOG-120, 123 or 130; and one course a human-environment orientation (GEOG-230, 303, 307, 331 or 332). Geography Skills and Inquiry (4 credits) includes GEOG-270 and GEOG-472. Electives (4 credits) includes one of the following courses (different from Geographic Fundamentals courses)GEOG- 100, 200, 273 or 274, 303, 306, 307, 323, 331, 332, 339, 372, 375, or 475. Geography is a \"bridge\" discipline that overlaps the traditional division between the natural and the social sciences. Some courses in the department have a natural science orientation (PN) while others have a social science orientation (PS or PP and may have a D or G designation). 16 credits. The Geographic Information Science and Technology Experiential Minor is 16 credits, distributed as follows: GEOG 273 or 274, GEOG 372, GIST 375 or GIST 376, and GIST 475. The GIST minor also recommends a GIS-related 0-4 credit internship of at least 80 hours.",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=geog",
  "courses_html": "document.write('<p><strong>GEOG-100 Our Digital Earth (4 Credits)</strong><br/>The Digital Earth is an introduction to the role that geospatial data and technologies play in our lives. From Google Earth to GIS, Facebook to Snapchat, we examine how geospatial data are collected and used, how geospatial technologies have transformed the way we think and make decisions, and the important geographic societal issues that result. Please note: this course will have field trips that may extend beyond class time.</p><p><strong>GEOG-100TR Geography Elective (1-12 Credits)</strong><br/></p><p><strong>GEOG-105 Weather, Climate, and Society (4 Credits)</strong><br/>(PN) An introduction to elements of weather and climate systems and the hazards they may pose to society. How can we (or should we?) prepare and adapt to live in areas of natural atmospheric hazards? Topics include a study of the earth\\'s atmosphere, ocean systems, precipitation processes, severe weather (tornadoes, hurricanes), drought, and climate change. Includes one two-hour lab per week.</p><p><strong>GEOG-105L Lab for Geography 105 (0 Credits)</strong><br/></p><p><strong>GEOG-106 Landforms & Landscapes Dynamics (4 Credits)</strong><br/>(PN) An introduction to the forces that shape Earth\\'s landforms, landscapes, and water resources and the benefits and hazards that our dynamic planet poses to human society. This course uses theoretical principles and field experiences to analyze and understand the character, behavior, and evolution of landforms and considers the responses of these systems to human disturbance. Topics include a study of tectonic forces, erosion and deposition by water, wind, and ice, and humans as agents of change.   J-Term: Includes one two hour lab per weekand a five-day field experience Jan 18-23-2024. The course includes a field trip fee.  Spring Semester: Includes one two-hour lab per week and a three-day field experience March 8-10, 2024. The course includes a field trip fee.</p><p><strong>GEOG-106L Lab for Geography 106 (0 Credits)</strong><br/></p><p><strong>GEOG-107TR Geography Transfer Elec (1-12 Credits)</strong><br/></p><p><strong>GEOG-120 Human Geography of Global Issues (4 Credits)</strong><br/>(PS, G) Human geography focuses on social, economic, political, cultural, and human-environment processes and patterns and how they change over space and time. This course examines the interconnections between places around the world and how global flows intersect in our local communities. Major topics include economic globalization, geopolitics, the spatial aspects of population growth and distribution including international migration, health, urbanization, cultural differentiation and the spread of ideas and innovation, and the environmental impacts of development. The course aims to engender a critical geographical perspective on the past, present and future development of the social world.</p><p><strong>GEOG-120AP Human Geography of Global Issues (4 Credits)</strong><br/></p><p><strong>GEOG-123 Introduction to Urban Studies (4 Credits)</strong><br/>(D) This course is an introduction to the interdisciplinary field of Urban Studies. The course focuses on the interactions between humans, urban ecosystems, and the built environment. Students will learn about the history of cities and suburbs in the United States, the causes and consequences of racial segregation, and the geography of environmental risk and vulnerability in cities.</p><p><strong>GEOG-130 Geography of World Regions (4 Credits)</strong><br/>(PS, G) Geography of World Regions is an exploration of the critical, interrelated, and diverse characteristics of the world\\'s major geographic regions. This course will explore issues of global and regional significance facing our planet through the diverse lenses of geography. Our primary focus is on globalization and the linkages between places, the impact of globalization on diversity, and the importance of &quot;local&quot; and &quot;global,&quot; unevenness in development, the legacy of colonialism, capitalism, and imperialism on world regions, and the relationships between societies and environments at various scales.</p><p><strong>GEOG-199 Directed Study (1-2 Credits)</strong><br/>199, 299, 399, 499 Directed Study (1+)  Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisites: permission of department chair and instructor.</p><p><strong>GEOG-200 Geography & Film (4 Credits)</strong><br/>(PH) This course is a critical geographic exploration of the social, environmental, and cultural dimensions of landscape, place, and culture through film and filmmaking. We examine the ways place is represented through the camera\\'s lens and the director\\'s vision. We consider the ways in which film is used to tell a story about place. We will explore the ways in which space, place, and landscape are socially constructed through the lens. Moreover, this course is a critical geographic investigation into the multiplicity of social and geographic worlds that comprise and collide within our social spaces.</p><p><strong>GEOG-200TR Geography Elective (1-12 Credits)</strong><br/></p><p><strong>GEOG-230 US Regional Immersion Exp (4 Credits)</strong><br/>(D) This J term course will explore a region of the United States through the lens of geography. Topics of the course will focus on human geography, physical geography, human-environment interactions, regionally important topics, and professional careers in geography. The course will begin and end on campus, with a 7-10 day field trip in between. Course fees will apply. Region varies by year.</p><p><strong>GEOG-270 Geographic Perspectives (2 Credits)</strong><br/>Introduction to the major traditions and perspectives of geography. This course has a focus on geographic inquiry and includes a proposal-writing assignment. Students will gain skills in using library resources, digital maps, and fieldwork to address geographic questions. Course should be taken as soon as possible after  declaring a major. Offered in the first half of the spring semester.</p><p><strong>GEOG-273 Intro GIS for Natural Sciences (4 Credits)</strong><br/>This course focuses on the use of a geographic information system to acquire, evaluate, and analyze spatial data. Students will learn (1) key concepts and components of GIS and (2) essential skills of operating a GIS through the use of the ArcGIS software package. Emphasis is placed on the use of GIS to solve problems related to the natural sciences. Students will learn how GIS is used in fields such as ecology, biology, hydrology, environmental studies, and/or geology. Course includes a student-selected final project. Cannot receive credit for both GEOG 273 and 274</p><p><strong>GEOG-274 Intro GIS for Social Sciences (4 Credits)</strong><br/>This course focuses on the use of a geographic information system to acquire, evaluate, and analyze spatial data. Students will learn (1) key concepts and components of GIS and (2) essential skills of operating a GIS through the use of the ArcGIS software package. Emphasis is placed on the use of GIS to solve problems related to the social sciences. Students will learn how GIS is used in fields such as public health, sociology, urban planning, environmental studies, and/or business. Course includes a community-based GIS project. Cannot receive credit for both GEOG 273 and 274.</p><p><strong>GEOG-299 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisites: permission of department chair and instructor.</p><p><strong>GEOG-303 Natural Resource Management (4 Credits)</strong><br/>Analysis of problems in the use of water and land resources, including land use planning, soil and water conservation, recreational uses of resources, urban open space and runoff, flood plain management, wetlands preservation and solid waste disposal. Course uses decision-making approaches to these problems and includes an introduction to environmental perception, resource economics and environmental law.</p><p><strong>GEOG-306 Soil Science (4 Credits)</strong><br/>This course will explore the basics of soil morphology, classification, mapping, microbiology, theories of soil formation, and pedoturbation. Other topics include the societal importance of soils, human modification of soils, and the important role that soils play in climate change. Several local field trips will be conducted to learn field-based skills of soil pit digging, soil describing, and landform analysis. Intended for juniors and seniors. Includes one two-hour lab per week.</p><p><strong>GEOG-306L Lab for 306 (0 Credits)</strong><br/></p><p><strong>GEOG-307 Food and Our Future (4 Credits)</strong><br/>The main focus of this class is the question &quot;How are we going to feed ourselves?&quot; This course examines the connections/disconnections between humans and the natural world and how this has led to our mistreatment of our planet, with a focus on soil and agriculture. These connections are explored in a philosophical, historical, and economic context to better understand the reasons behind our problems in feeding a growing human population under threat of climate change.</p><p><strong>GEOG-323 Urban Planning (4 Credits)</strong><br/>Urban geography is the study of the spatial organization of the city and the interactions between humans, urban ecosystems, and the built environment. This course provides an introduction to the principles and prqactices of urban geography and planning, focusing on community development, land use, transportation, housing and sustainability.The course emphasizes both theory and practice, and we will assess efforts by planners and grassroots organizations to develop walkable, transit-oriented, and more environmentally just cities. Students design and carry out a community-based research project in the Quad Cities.  Prerequisite: One course from ENVR-101 GEOG-120, GEOG-123 or permission ofthe instructor.  &quot;D&quot; suffix removed as of May 5, 2021.</p><p><strong>GEOG-331 Geography of Latin America (4 Credits)</strong><br/>(G) This course provides an introduction to the geography of Latin America, including its people, politics, cultures, and environments. Latin America is home to a diverse set of landscapes and ecosystems, including tropical rainforests, snowcapped mountains, plains, deserts, and expanding megacities. In this course, we will examine the relationship between the environment and Latin American societies, focusing on the history of pre-Columbian peoples, European colonialism, uneven economic development, urbanization and migration, and environmental conservation. Case studies include Bolivia, Brazil, Costa Rica, Guatemala, Nicaragua, and Latino/as in the United States. Offered in alternate years.</p><p><strong>GEOG-332 Geography of the Arctic (4 Credits)</strong><br/>(G) A regional geographic course exploring the unique and rapidly changing region of the circumpolar Arctic. The course will provide an in-depth focus on the people, politics, economy, and natural environment of the Arctic, with an emphasis on &quot;big picture&quot; topics like climate change, resource extraction, indigenous rights, polar law, and human health. Although we don\\'t live in the Arctic, we\\'ll learn why this region has important implications and connections to the midlatitudes. Offered in alternate years.  For Spring 2025, this course is part of a study away experience with a required ten day field experience in Northern Sweden.</p><p><strong>GEOG-339 Historical Geography of North America (4 Credits)</strong><br/>(PP) Historical Geography introduces students to the field of historical geography and emphasizes its contribution to understanding North America\\'s past. The objectives of the course are 1) to offer a broad surveyof North America\\'s past human geographies, emphasizing the period between 1600 and the present and 2) to explore the questions, methods, and sources used within the field of historical geography including archival research, historical Geographic Information Science, and field methods. Offered in alternate years.</p><p><strong>GEOG-372 Digital Cartography and Design (4 Credits)</strong><br/>This course is an introduction to the principles of digital cartography and map design. Various forms of data visualization techniques (dot map, choropleth, graduated circle, isolines, etc.) will be practiced on a digital platform using GIS and Illustrator software. Emphasis is placed on map user considerations and constraints, and cartographic ethics. GIS is not a prerequisite for the course, but previous knowledge is helpful.</p><p><strong>GEOG-380 Special Topics in Gis (4 Credits)</strong><br/>In-depth study of a Geographic or Geographic Information Systems (GIS) topic not offered in the general curriculum. Topic announced for each offering. Students may take more than one special topics seminar.</p><p><strong>GEOG-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>GEOG-399 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisites: permission of department chair and instructor.</p><p><strong>GEOG-400 Independent Study (1-2 Credits)</strong><br/>Advanced studies on specific subjects; research problems.</p><p><strong>GEOG-472 Seminar on Geographic Research (2 Credits)</strong><br/>Research in design and research methodologies, data collection techniques, analysis and use of quantitative methods in geographic research, selection of an original topic for the senior research paper and preparation of a preliminary outline and chapter for that paper. Should be taken in the second half of spring term of the junior year. Students participating on spring foreign term will need to make special arrangements with department advisors.</p><p><strong>GEOG-473 Seminar on Geographic Research II (2 Credits)</strong><br/>Collection and analysis of primary data, selection and preparation of cartographic material for the senior research paper and research writing and presentation; completion and presentation of a major original research paper. (For geography majors in the second half of the fall term of the senior year.) Prerequisite: 472.</p><p><strong>GEOG-474 Geog Resrch Dbl Major (0 Credits)</strong><br/>This course is intended to be a substitution for double majors who elect not to take the traditional SI path in geography. Permission of department chair required to register. Prerequisite: GEOG-472</p><p><strong>GEOG-475 Advanced GIS (4 Credits)</strong><br/>Examination of advanced GIS applications and essential GIS skills including process automation and programming. Essential skills include metadata writing, data conversions, re-projections of spatial data, and spatial data editing. Additional advanced GIS topics will vary based on instructor expertise and interest and will be announced in the spring semester in the year before the class is offered. Offered in alternate years. Prerequisite: GEOG 273/274, GEOG 373/ 374, or consent from instructor.</p>');",
  "scrape_metadata": {
    "original_title": "Geography",
    "dept_slug": "geography",
    "original_url": "https://augustana.edu/academics/areas-of-study/geography",
    "courses_url": "https://augustana.edu/academics/areas-of-study/geography/courses",
    "scrape_timestamp": "2025-09-26 19:58:10",
    "status": "success"
  }
}