{
  "program_title": "Geology course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/geology/courses",
  "faculty": [],
  "requirements": {
    "major_in": "40 credits: One gateway GEOL course (GEOL-101, GEOL-105, GEOL-112, or GEOL-123); six core courses (GEOL-201, GEOL-205, GEOL-240, GEOL-309, GEOL-350, GEOL-360), three senior inquiry courses (GEOL-450, GEOL-451, and GEOL-452); and two additional elective GEOL courses (including GEOG-273, GEOG-306, and ENVR-300). Upper-level geoscience courses assume math skills equivalent to those covered in a high school or college pre-calculus course. Students planning to pursue graduate studies or careers in the geosciences are strongly recommended to take MATH-160 (Calculus) as well as additional courses in chemistry, physics, mathematics, geography, and/or biology.",
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": "17 credits (4 courses + 1 credit), including one gateway course (GEOL-101, 112, 105, 112, or 123), GEOL-399 (1-credit), and 12 additional credits (or 3 courses) from GEOL courses at or above the 200-level. GEOG-273, GEOG-306, and ENVR-300 may be substituted for GEOL courses. GEOL-399, coordinated with a faculty member, requires completion of a research paper that addresses some aspect of geology and relates it to the student’s primary major, and it must incorporate an additional reflective component demonstrating an understanding of the connectivity between subject areas. This paper could conceivably be an extension of the Senior Inquiry effort within the student’s primary major.",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=geol",
  "courses_html": "document.write('<p><strong>GEOL-101 Phys & Environ Geology (4 Credits)</strong><br/>(PN) Introduction to the science of the Earth and our environment through topics of Earth materials and cycles, natural resources, tectonic processes, hydrologic systems, volcanoes, earthquakes, paleoclimatology, and geologic time. Additional themes include anthropogenic impacts on our environment, environmental hazards and environmental justice. Includes a weekly 2-hour lab that integrates experiential exercises, computer applications, collections of the Fryxell Geology Museum, and local field trips. Gateway course to the geology major.  GEOL-101L for this class is not required if taken during J Term.</p><p><strong>GEOL-101L Lab for 101 (0 Credits)</strong><br/></p><p><strong>GEOL-104 Gemology (4 Credits)</strong><br/>(PN) Introduction to the mineralogy and economics of gemstones. We we will focus on the nearly $300-billion-dollar-a-year global jewelry market by studying a few of the important gemstones, e.g., diamond, emerald, ruby, sapphire, garnet -- from their geologic formation, through exploration, mining, and cut-polish-processing, all the way to the jewelry store. You will learn non-destructive optical, spectroscopic and density methods to identify natural &amp; synthetic gemstones. Includes a weekly 2-hour lab focusing on gemstone identification and on analysus of specimens from the Fryxell Geology Museum collections.</p><p><strong>GEOL-104L Lab for 104 (0 Credits)</strong><br/></p><p><strong>GEOL-105 Phys & Environ Geol Rocky Mtns (4 Credits)</strong><br/>(PN) Introduction to the science of the Earth and our environment through the study of materials and processes of rock formation and mountain building during a rigorous 2-week summer field trip, preceding the fall semester. We will visit spectacular sites and study the physical geology and environmental science in the Rocky Mountains. In addition, we discuss environmental  justice issues of the region. Open only to incoming first-year students.  For more information, contact SusanWolf@augustana.edu. Gateway course to the geology major.</p><p><strong>GEOL-106 Quakes, Tsunamis, Eruptions in Asia (4 Credits)</strong><br/>(PN) J-term course. A focused introduction to dynamic geologic processes that have shaped this planet, in particular the earthquake, tsunami and volcanic activity of Japan. In addition to understanding the science of these destructive forces, we will study the human responses to recent disasters, how we can prepare for and mitigate future - inevitable - disasters, and what are the benefits of living in such tectonically active regions. This course counts towards the Asian Studies major or minor.</p><p><strong>GEOL-112 Dinosaurs & Extinction (4 Credits)</strong><br/>(PN) The scientific study of dinosaurs in Earth history. Topics covered include: formation of rocks and fossils, geologic time, dinosaur evolution, ecology and the environments to which dinosaurs adapted, and hypotheses that attempt to explain their mass extinctions. Includes one weekly 2-hour lab. Lab study involves specimens in the Fryxell Geology Museum collections. Gateway course to the geology major.</p><p><strong>GEOL-112L Lab for 112 (0 Credits)</strong><br/></p><p><strong>GEOL-113 Geology of Myths/Legends (4 Credits)</strong><br/>(PN) Students will learn to interpret geological data, integrate their knowledge of geology with other non-science disciplines, and then assess whether geologic evidence can explain whether certain ancient myths were based on real events or were fabricated or modified for other symbolic or metaphorical purposes. Analysis of myths will take place within the broader context of what actually constitutes valid scientific inquiries and evidence. Emphasis will be on myths from the Mediterranean and Mesopotamian regions. Includes one weekly 2-hour lab.</p><p><strong>GEOL-119 Open Water SCUBA (0 Credits)</strong><br/>For students participating in the Bonaire J-Term Program (GEOL-123 or GEOL-321) who desire a no-credit path toward PADI SCUBA certification. Priority given to participants of the Bonaire J-term program. Instructor permission required.</p><p><strong>GEOL-123 Caribbean Geology (4 Credits)</strong><br/>(PN) An introduction to the science of geology through study of the processes required for the formation of an island. A week of on-campus discussions of topics such as deep time, plate tectonics, volcano formation, biochemical, climatic, and anthropogenic influences on reef-building and destruction, erosion, and other rock cycle processes followed by two weeks of observation and testing of those concepts on the south central Caribbean island of Bonaire (Netherlands Lesser Antilles). Passing a basic swim/float test and having a valid passport are required. Gateway course to the geology major.</p><p><strong>GEOL-143 Economics & Geopolitics of Critical Mins (4 Credits)</strong><br/>(PN) This course is an introduction to the geoscience, economics and geopolitics of the materials that have shaped the course of human history, from obsidian blades, jade axes, bronze and iron alloy tools and weapons that enabled conquest and colonialism to minerals that form the foundation of our modern civilization, e.g., lithium, metals and rare earth element-bearing minerals that allow iPhones, solar PV panels, electric vehicles, and wind turbines to work. We will focus on the alternative &quot;Green Energy Revolution&quot; significantly influencing our lives by studying critical minerals, designated by a government as essential to energy technology and at risk of supply chain disruption. Includes a weekly 2-hour lab.</p><p><strong>GEOL-143L Lab for 143 (0 Credits)</strong><br/></p><p><strong>GEOL-199 Directed Study (1-2 Credits)</strong><br/>Study of a particular subject under a faculty member\\'s direction. Prerequisite: consent of instructor and department chair.</p><p><strong>GEOL-201 History of Life (4 Credits)</strong><br/>(PN) An examination of the 3.5+ billion-year history of life on Earth, accompanied by discussions of the physical changes at and below Earth\\'s surface. Popular science literature will serve as a gateway to concepts such as evolution, genetics, morphology, anatomy, taxonomy, paleoecology, and species distribution, among others. Includes one weekly 2-hour lab. Lab study involves specimens in the Fryxell Geology Museum collections.</p><p><strong>GEOL-201L Lab for 201 (0 Credits)</strong><br/></p><p><strong>GEOL-205 Minerals & the Environment (4 Credits)</strong><br/>(PN) A nation\\'s wealth and quality of life of its citizens are significantly determined by its control and extraction of mineral resources, but there is always a negative environmental consequence of resource extraction, transformation and use. In addition, our personal and environmental health is impacted not only by what we do with these mineral resources and their waste products but also where we happen to live, relative to certain potentially hazardous mineral deposits. In this course you will learn about minerals (the building blocks of our planet Earth) and then apply that chemical &amp; crystallographic knowledge to more deeply understand a wide variety of environmental issues (e.g., groundwater contamination, soil development and swelling clays, asbestos, silicosis, acid mine drainage, radon, mercury and lead poisoning.). Prerequisites: none. Includes a weely 2-hour lab.  PN was awarded on 02/20/2023.</p><p><strong>GEOL-205L Lab for 205 (0 Credits)</strong><br/></p><p><strong>GEOL-240 Structural Geology & Tectonics (4 Credits)</strong><br/>How do mountains form? This course studies how geologic materials are deformed through tectonic processes. It involves a descriptive analyses of 3-dimensional rock structures (e.g. faults, folds, and fabrics), and quantitative studies of strain and stress. Rock deformation and mountain-building processes are studied in the context of plate tectonics and regional geology. Includes one weekly 2-hour lab. Prerequisite: One gateway course from GEOL-101, 105, 106, 112, 113, or 123 or consent of instructor.</p><p><strong>GEOL-240L Lab for 240 (0 Credits)</strong><br/></p><p><strong>GEOL-299 Directed Study (1-2 Credits)</strong><br/>Study of a particular subject under a faculty member\\'s direction. Prerequisite: consent of instructor and department chair.</p><p><strong>GEOL-309 Geomorph/Paleoclimate (4 Credits)</strong><br/>The study of landforms, the processes by which they are created, and implications for past climate fluctuations. Units include weathering, streams, glaciers, wind, Quaternary paleoclimatology, and Quaternary dating methods. Includes one weekly 2-hour lab and occasional field trips. Prerequisites: None, although a 100- level course in GEOL, GEOG, or ENVR is recommended.</p><p><strong>GEOL-309L Lab for 309 (0 Credits)</strong><br/></p><p><strong>GEOL-321 Island Geology (4 Credits)</strong><br/>An upper-level interdisciplinary course designed as introduction to geoscience field research and data collection explored through the lens of  sedimentology and paleoecology. Students will spend a week on campus building an intellectual framework upon which to understand the geology of Bonaire and developing research topics they will explore on-island. During the two weeks that we are on Bonaire, students will read primary literature, engage in discussions, explore a variety of modern and fossil field localities, and work in small groups to collect information on their mini research projects. Course prerequisites include GEOL 201 (Historical Stratigraphy/History of Life) or approval by the instructors. Students must also pass a swim/float test and have a valid passport.</p><p><strong>GEOL-322 Mojave Geology (4 Credits)</strong><br/>3+ week program travelling to the southern Mojave Desert to study the geology and develop standard geologic field skills. Students will learn to make observations and interpretations in the field, while using standard geological field equipment. Students will produce written reports of the geologic history as well as detailed geologic maps. Environmental justice issues of the southwest are studied and discussed.</p><p><strong>GEOL-325 Conservation Paleoecology (4 Credits)</strong><br/>Application of paleontological tools (fossils) and techniques to the study of conservation. Students will read primary literature and engage in discussions regarding the important ways in which paleoecology can - and should - be incorporated into conservation efforts.  Includes one weekly 2-hour lab in which students will learn to conduct quantitative analyses using the open source statistical software R.</p><p><strong>GEOL-325L Lab for 325 (0 Credits)</strong><br/></p><p><strong>GEOL-330 Hydrogeology (4 Credits)</strong><br/>Fundamental study of the hydrologic cycle and groundwater, with broad relevance to environmental sciences. Units include surface hydrology, surface water/groundwater interactions, groundwater flow directions and rates, and groundwater chemistry. Concepts are reinforced through case studies of environmental groundwater problems, contamination, and methods of remediation. Includes one 2-hour lab per week. Prerequisites: None. Familiarity with stream processes and common rocks and minerals is recommended. Familiarity with math through pre-calculus is recommended.</p><p><strong>GEOL-330L Lab for 330 (0 Credits)</strong><br/></p><p><strong>GEOL-350 Sedimentology & Stratigraphy (4 Credits)</strong><br/>Interpretation of processes and environments of fossil and sediment deposition preserved in the rock recordthrough analysis of fossils, rocks, sediments, and thin-sections. In-depth study of stratigraphy emphasizes paleoenvironmental interpretations over geologic time. Includes one weekly 2-hour lab and occasional field trips. Prerequisites: GEOL-201, 205 or consent of instructor.</p><p><strong>GEOL-350L Lab for 350 (0 Credits)</strong><br/></p><p><strong>GEOL-360 Volcano Hazards & Mineral Resources (4 Credits)</strong><br/>Most of Earth\\'s crust is associated with volcanic and hydrothermal processes; we will study why and where rocks melt, how magma rises to the surface, what controls the violence and geohazards of volcanic eruptions, resultant mass extinctions, and why so many economically valuable mineral resources form around volcanoes. We will answer these questions by studying petrology, petrography and phase diagrams.  No prerequisite required. Includes a weekly 2-hour lab, GEOL-360L, that must be taken concurrently, and a required weekend field trip.</p><p><strong>GEOL-360L Lab for 360 (0 Credits)</strong><br/></p><p><strong>GEOL-370 Special Topics (1 Credits)</strong><br/>Seminar research and discussion of the regional and local geology of a departmental field trip destination. May be repeated for credit. Prerequisite: One gateway course from GEOL-101, 105, 106, 112, or 123, or consent of instructor.</p><p><strong>GEOL-373 Remote Sensing (4 Credits)</strong><br/></p><p><strong>GEOL-380 Special Topics (4 Credits)</strong><br/>In-depth study of the regional and local geology of a J-term field trip destination. Variable format. May be repeated for credit. Prerequisite: One gateway course from GEOL-101, 105, 106, 112, or 123, or consent of instructor.</p><p><strong>GEOL-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>GEOL-399 Directed Study (1-2 Credits)</strong><br/>Study of a particular subject under a faculty member\\'s direction. As part of the minor, this study culminates in a research &amp; reflective paper. May be repeated for credit.  Prerequisite: consent of instructor and department chair.</p><p><strong>GEOL-400 Independent Study (1-2 Credits)</strong><br/>Study of a particular subject under a faculty member\\'s direction. Prerequisite: consent of instructor and department chair.</p><p><strong>GEOL-450 Senior Inquiry 1 (2 Credits)</strong><br/>Planning and development of a research proposal involving literature research, group discussions and analytical instrumentation instruction in preparation for GEOL-451. Includes one three-hour lab per week.</p><p><strong>GEOL-451 Senior Inquiry 2 (2 Credits)</strong><br/>A required research project, performed under the direction of a faculty advisor, culminating in a written thesis and public oral presentations. Prerequisite: GEOL-450 or consent of department advisor.</p><p><strong>GEOL-452 Senior Inquiry 3 (0-2 Credits)</strong><br/>Taken during spring semester senior year, this directed research experience requires students to complete the research process, write up the results in a written thesis, and present their results formally to the Department of Geology, the campus as a whole (Celebration of Learning) and at a professional meeting (North Central Section of the Geological Society of America). In addition, students finish their ePortolios, which are a combination of personal reflection and materials related to their professional development in the geosciences.</p><p><strong>GEOL-499 Directed Study (1-2 Credits)</strong><br/>Study of a particular subject under a faculty member\\'s direction. Prerequisite: consent of instructor and department chair.</p><p><strong>GEOL-ELEC Geology Elective (1-12 Credits)</strong><br/></p>');",
  "scrape_metadata": {
    "original_title": "Geology",
    "dept_slug": "geology",
    "original_url": "https://augustana.edu/academics/areas-of-study/geology",
    "courses_url": "https://augustana.edu/academics/areas-of-study/geology/courses",
    "scrape_timestamp": "2025-09-26 19:58:12",
    "status": "success"
  }
}