{
  "program_title": "Graphic design course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/graphic-design/courses",
  "faculty": [],
  "requirements": {
    "major_in": "32 credits. - 12 credits in core studies: GRD-222, GRD-225, GRD-325. - 4 credit capstone experience: GRD-425, 4-credit internship, or completion of a capstone experience in another major. - 4 credits: any ARHI course or GRD-392. - 12 elective credits: any additional course offered with a GRD designation of which 8 credits may be completed in any course with an ART designation.",
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": "20 credits. - 12 credits in core studies: GRD-222, GRD-225, GRD-325. - 8 elective credits: any course offered with a GRD designation. 4 credits may be completed in any course with an ART or ARHI designation.",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=grd",
  "courses_html": "document.write('<p><strong>GRD-150TR Graphic Design Elective (3-4 Credits)</strong><br/></p><p><strong>GRD-170 Process & Materials (4 Credits)</strong><br/>(PA)This course provides an experimental studio environment focused on rapid iterative making. We explore a variety of media and consider how these ways of working are applied in a range of design practices. $40 lab fee.</p><p><strong>GRD-180 Special Topics in Design (4 Credits)</strong><br/>This course provides an experimental studio environment in which to focus on specialized topics in graphic design. Course content changes with every offering to expose students to the many diverse aspects of design that are part of the flux of the current profession. $40 lab fee Fall 2022 &amp; J-Term 2023.</p><p><strong>GRD-201TR Graphic Design Elective (3-4 Credits)</strong><br/></p><p><strong>GRD-222 Graphic Design Studio (4 Credits)</strong><br/>(PA) This studio-based course focuses on typographic design while encouraging experimentation with form-making and concept development. Methodically advancing technical skills while developing a process of working that is unique to the individual encouraged. $40.00 lab fee</p><p><strong>GRD-225 Intro to Graphic Design (4 Credits)</strong><br/>(PA) This studio-based course asks students to both leverage basic design principles to generate visual works and apply design processes to complex problems. While emphasis is placed on concept development, students methodically advancing technical skills while developing a process of working that is unique to the individual. $40.00 lab fee.</p><p><strong>GRD-325 Graphic Design Studio (4 Credits)</strong><br/>Acting as a professional design studio, this course asks students to build their own design process by refining their own way of working, effectively managing projects to realize engaging visual narratives, and actively reflecting on their personal design rationale. Prerequisites: GRD-222 and GRD-225. May be repeated one time.  $40.00 lab fee</p><p><strong>GRD-328 Expanded Media (4 Credits)</strong><br/>(PA) This studio-based course explores the intersection of design and digital spaces ranging from mobile platforms to immersive environments. Includes an introduction to foundational skills. Surveys emerging trends/technologies. We leverage design processes to address complexities that arise as human beings interact with each other and/or artificial intelligence in digital spaces. Prerequisites: GRD-222 and GRD-225 or by permission of the instructor. $40.00 lab fee.</p><p><strong>GRD-372 Illustration (4 Credits)</strong><br/>(PA) Illustration is an important form of visual communication that is widely used in many fields. Learn strategies for generating clear and creative messages while exploring a variety of traditional mediums. $40 lab fee.</p><p><strong>GRD-373 Digital Illustration (4 Credits)</strong><br/>(PA) Leverage traditional illustration strategies with digital tools to develop and refine visual concepts. $40</p><p><strong>GRD-374 Virtual Production (4 Credits)</strong><br/>(PA)In this studio class, we experiment with contemporary virtual production as a means of generating dynamic content and enhanced storytelling. $40.00 lab fee.</p><p><strong>GRD-375 Sound & Motion Design (4 Credits)</strong><br/>(PA) In this studio class, we experiment with the expressive potential of motion and sound. While emphasis is placed on concept development, methodically advancing technical skills while developing a process of working that is unique to the individual is encouraged. $40.00 lab fee.</p><p><strong>GRD-380 Special Topics in Design (4 Credits)</strong><br/>This course provides an experimental studio environment in which to focus on specialized topics in graphic design. Course content changes with every offering to expose students to the many diverse aspects of design that are part of the flux of the current profession. Prerequisite: GRD-222 or GRD-225. May be repeated one time. $40.00 lab fee</p><p><strong>GRD-392 Design & Culture (4 Credits)</strong><br/>An exploration of culture through the lens of art and design. In this studio-based class, we leverage historical and contemporary works as inspiration for making new work. Prerequisite: GRD-222 and GRD-225 or FILM-250.  $40.00 lab fee</p><p><strong>GRD-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>GRD-399 Directed Study (1-2 Credits)</strong><br/></p><p><strong>GRD-400 Independent Study (1-2 Credits)</strong><br/></p><p><strong>GRD-410 Design and Culture (4 Credits)</strong><br/>(PH, G) The GRD-410 study abroad format provides a design environment on the move. This course provides an experimental studio environment and will explore design and culture by asking challenging questions about the role design plays in shaping culture. (no lab fee)</p><p><strong>GRD-425 Senior Inquiry in Design (4 Credits)</strong><br/>This course continues a concentrated study to produce a coherent body of original work for exhibition. It is a self-motivated, intensive process of inquiry through which a Graphic Design major makes a culminating personal statement upon graduation in an exhibition of work at Augustana\\'s Teaching Museum of Art. Students should expect to gain critical and creative thinking skills by extending thought processes into unexplored areas, improve problem solving skills and analytical ability through critique and other classroom interactions. Diverse viewpoints will be investigated and valued. Prequisite: GRD-325  (no lab fee)</p><p><strong>GRD-499 Directed Study (1-2 Credits)</strong><br/></p>');",
  "scrape_metadata": {
    "original_title": "Graphic Design",
    "dept_slug": "graphic-design",
    "original_url": "https://augustana.edu/academics/areas-of-study/graphic-design",
    "courses_url": "https://augustana.edu/academics/areas-of-study/graphic-design/courses",
    "scrape_timestamp": "2025-09-26 19:58:17",
    "status": "success"
  }
}