{
  "program_title": "History course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/history/courses",
  "faculty": [],
  "requirements": {
    "major_in": "30 credits, distributed as follows: 8 credits from 100- or 200-level history courses; (HIST114, HIST115, HIST116, HIST120, HIST123, HIST124, HIST130, HIST131, HIST133, HIST150, HIST151, HIST170, HIST199, HIST205, HIST220, HIST230, HIST232, HIST235, HIST250, HIST252, HIST260, HIST267, HIST280, HIST299, SCAN250) 4 credits for HIST300; 6 credits for Senior Inquiry Sequence, HIST440 (2 cr.) and HIST450 (4 cr.); 12 additional credits in history at the 300/400 level (HIST305, HIST306, HIST316, HIST317, HIST323, HIST324, HIST330, HIST333, HIST335, HIST336, HIST337, HIST338, HIST340, HIST345, HIST350, HIST355, HIST358, HIST370, HIST393, HIST399, HIST400, HIST499, SCAN 350). Majors may elect to choose 300-level courses from one of the Compass Points; see your adviser for information. Additional Requirements: At least 4 credits in a geographic area outside the U.S. Majors are strongly recommended to take 300 before taking any 300-or 400-level courses. 32 credits, distributed as follows: 4 credits from HIST130 or 131; 4 credits from HIST114, HIST115, or HIST116; HIST300; HIST305 or HIST306; 4 credits from a 300-level U.S. history course in a period other than the ones taken at the 100-level; 8 credits from 2 of the following geographic areas: Asia, Africa, Latin America, or World history; 4 additional credits from a history course selected in consultation with the advisor; at least 12 credits at the 300 level. See Department of Secondary Education for required supporting courses.",
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": "The minor in history consists of 4 courses (16 credits), at least two of which must be at the 300/400 level. Minors may elect to choose 300-level courses from one of the Compass Points; see your adviser for information.",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=hist",
  "courses_html": "document.write('<p><strong>HIST-114 Europe 200-1300 (4 Credits)</strong><br/>(PP, G) This course will address crucial moments in late antiquity and the medieval era, including the collapse of the western Roman Empire, the flowering of Byzantium, periodic invasions and transmigrations of peoples, the development of medieval Christianity, and birth of the university. Special emphasis will be laid on developing students\\' ability to write their own historical interpretations through a critical use of eyewitness accounts. </p><p><strong>HIST-115 Europe 1300-1800 (4 Credits)</strong><br/>(PP, G) This course will address foundational moments in early modern Europe, including the Renaissance, the Reformation, voyages of global exploration, absolutism, the Scientific Revolution, the Enlightenment, and revolutions against absolute monarchies. Special emphasis will be placed on developing students\\' ability to write their own historical interpretations through a critical use of eyewitness accounts.</p><p><strong>HIST-115AP AP European History (4 Credits)</strong><br/></p><p><strong>HIST-115IB IB European History (4 Credits)</strong><br/></p><p><strong>HIST-116 Europe 1800-Present (4 Credits)</strong><br/>(PP,G) This course will address central moments in modern Europe, including the Industrial Revolution, WWI, fascism, WWII, the Holocaust, the birth and death of Soviet Communism, the Cold War, and the foundation of the European Union. Special emphasis will be placed on developing students\\' ability to write their own historical interpretations through a critical use of eyewitness accounts.</p><p><strong>HIST-116AP AP European History (4 Credits)</strong><br/></p><p><strong>HIST-116IB IB European History (4 Credits)</strong><br/></p><p><strong>HIST-120 Social Histories of the \\\"New\\\" World (4 Credits)</strong><br/>(PP, G) Social Histories of the &quot;New&quot; World, 1492-1820.   In 1492, Christopher Columbus set sail from Spain for the Indies, initiating a major sea change in world history that would see peoples from the Americas, Europe, and Africa come together in unprecedented ways. This class uses the lens of social history to survey the rich tapestry of the new societies that emerged in modern-day Latin America from the eve of European exploration to the stirrings for independence. Studying four units - the pre-colonial Atlantic World, encounter and conquest, the establishment and maturation of colonial society, and the crises of the late colonial period - course participants will explore themes such as conquest myths, conversion, honor, bigamy, revolt, rape, and murder, while paying close attention to race, class, gender, religion, and their intersections.</p><p><strong>HIST-121 Latin America, 1820-PRESENT (4 Credits)</strong><br/>(PP,G)Post-Colonial Problems and Conditions in Latin America, 1820-Present    As Spain, Portugal, and France\\'s New World colonies emerged from their respective independence struggles, each former colony would embark on a journey to build a national government, set borders, forge a distinct national identity, and exercise their sovereignty as equals on the world stage. Yet despite their best efforts, many found themselves increasingly hemmed in by a neo-colonial power - the United States. This class blends political and social history as it traces Latin America\\'s post-colonial journey and the accompanying continuities and changes in the everyday lives of Latin Americans from 1820 to the present. Broken up into three units - independence, the early national period, and the modern era - course participants will explore major trends such as nationalism, neo-colonialism, authoritarianism, and human rights, while attending to the ways race, class, gender, national identity and their intersection shaped dynamics internal and external to the region. </p><p><strong>HIST-123 Women/Gender in LA 1492-Present (4 Credits)</strong><br/>(PP, G)Women/Gender in Latin America, 1492-Present    This course traces the continuities and changes in the lives of Latin American women through the lens of gender from the colonial era to the present. While the Spanish and Portuguese brought a set of normative gender values and sexual practices with them to the New World, these norms were contested, even in Iberia, and collided with indigenous and African beliefs about the roles and behavior of men and women in society in the centuries following conquest. Participants in the class consider these norms, their transfer to the Americas, and the various ways in which women - elite and non-elite, white and non-white - embraced and challenged them in Latin America and later in the United States. This inquiry will be guided by a variety of themes, including gender as an analytical category, intersectionality, hegemony, patriarchy, honor and virtue, feminism, marginality, violence, the border, and political power. </p><p><strong>HIST-124 Shades of Black/Brown (4 Credits)</strong><br/>(PP, G) Shades of Black and Brown: Afro-Latin American and Afro-Latino Experiences, 1492-present   In Seven Myths of the Spanish Conquest, Matthew Restall challenges our understanding of conquest and the very image of the conquistador by noting the presence of Africans who also bore arms for the Spanish King. In doing so, he calls attention to an important fact: Africans and their descendants, enslaved and free, have been present in Latin America and the Caribbean since its earliest days. Moreover, they can still be found in virtually every nation in Latin America and the Caribbean - from Mexico to Argentina, from core to periphery. As a result, they have played an important role in the establishment and development of Latin American society, culture, and identity. Cognizant of these facts, this course examines the experiences of Africans and their descendants in Latin America and the Caribbean from the 1500s to the early twenty-first century over three units - black life during enslavement, the fight to live as equals after abolition in Latin America, and the experiences of Afro-Latin Americans/Latin@s in the United States. After gaining an in-depth understanding of the concepts of diaspora and Afro-Latin America, participants will explore processes and themes such as acculturation, social death, agency and resistance, the meaning of citizenship, race and national inclusion, and the migrations of Afro-Latin American to the U.S.</p><p><strong>HIST-130 Rethinking American Hist, to 1877 (4 Credits)</strong><br/>(PP)Rethinking American History, to 1877    Almost everything most people know about American history is at worst, wrong, and at best, oversimplified. This course examines enduring problems, powerful stories, and common misconceptions about the American past. Students will learn a set of problem-solving skills that historians use to make sense of the past, so that they can reach their own conclusions and recognize sense from nonsense.</p><p><strong>HIST-130AP AP Amer History (4 Credits)</strong><br/></p><p><strong>HIST-131 Rethinking American Hist, 1877-Present (4 Credits)</strong><br/>(PP)Rethinking American History, 1877-Present   Almost everything most people know about American history is at worst, wrong, and at best, oversimplified. This course examines enduring problems, powerful stories, and common misconceptions about the American past. Students will learn a set of problem-solving skills that historians use to make sense of the past, so that they can reach their own conclusions and recognize sense from nonsense.</p><p><strong>HIST-131AP AP American History (4 Credits)</strong><br/></p><p><strong>HIST-133 American Environment (4 Credits)</strong><br/>(PP)Introduction to environmental history, which is the study of human interaction with the natural world over time. Students will learn how Americans have shaped their environment, as well as how they are shaped by it. Particular emphasis will be placed on Americans\\' changing ideas about nature during the past two centuries. Students will compose landscape histories, analyze artwork from the Augustana Teaching Museum of Art, write about changes in human-animal relationships, and debate past environmental policies through roleplaying.</p><p><strong>HIST-150 Problems in East Asian History to 1600 (4 Credits)</strong><br/>(PP,G)The history of East Asia to roughly 1600 through a combined chronological and thematic approach. Beginning with Confucian thought as a worldview and political ideology, the course will then examine histories of the environment, of women, and of trade and commercial culture in the region. Taking for granted that it is impossible to adequately survey thousands of years of history in a single semester, the course takes as a central concern why certain historical narratives are given priority while others are marginalized or excluded. Guided by input from course participants, any given section may explore additional topics, such as Buddhism, military history, and material culture. </p><p><strong>HIST-151 East Asia Making Modern World (4 Credits)</strong><br/>(PP,G) Ever since East Asia played a crucial role in stimulating early modern globalization, East Asian countries, their empires, revolutions, wars, and social upheavals, have profoundly shaped our world. This course places East Asia at the center of modern world history while also investigating the internal social, cultural, and environmental conditions that shaped historical change in China, Japan, and Korea since roughly 1600.   </p><p><strong>HIST-170 World History Since 1500 (4 Credits)</strong><br/>(PP,G)The initial contacts between various global populations and how these inter-continental, cross-cultural encounters played out over time and affected those involved. Explores organic processes and their external impetuses in order to situate peoples in a global context and to show how the world has become increasingly integrated, ultimately enabling us to historicize the current globalization phenomenon. </p><p><strong>HIST-170AP World History Ap (4 Credits)</strong><br/></p><p><strong>HIST-199 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of instructor.</p><p><strong>HIST-205 The French Revolution (4 Credits)</strong><br/>(PP,G) This J-Term course will intensively examine the French Revolution of 1789, with special attention to the problem of legitimizing authority amid rapid changes of regimes, from absolute monarchy through constitutional monarchy to the republican Reign of Terror and beyond.</p><p><strong>HIST-220 Hearing Hurstory:black Wmn in America (4 Credits)</strong><br/>Hearing HURstory: Black Women in America.   (PP, D) This course explores the lives of black women in the United States from 1619 to the present. It defines racism, patriarchy, slavery, and Jim Crow, as more than economic and social oppression, but as inherently political systems. These systems, and their legacies, have forged the web in which black women have found themselves entangled in the United States since the 1600s. As such, they have profoundly shaped the experiences of black women. With this in mind, we will employ an approach that foregrounds the identities of black women as they were shaped by, and attempted to shape, these systems over time. First, we will build an understanding of race, class/status, and gender, along with their intersections. After delving into these concepts, we will move on to explore a variety of themes, including hegemony and agency; the lives of ante-bellum black women - enslaved and free; the process of defining and enacting freedom; civil rights and black power; the womanist critique of feminism; and a variety of contemporary issues including colorism, hair politics, and violence against the black female body.</p><p><strong>HIST-230 Bodies of Evidence: Scientific Racism (4 Credits)</strong><br/>(PP,D)Bodies of Evidence: Scientific Racism in the U.S.    As a category that has been used to define and to assign power to groups of people, race has been a potent force in U.S. history. Combining reading, visual analysis, and museum visits, we\\'ll investigate how evolving scientific theories have been used as tools to mark difference and, often, to justify economic and social systems that profit from those differences. We\\'ll also discover how various individuals and groups harnessed the authority of science for themselves in order to undermine racist theory.</p><p><strong>HIST-232 Picturing the Other: American Indians (4 Credits)</strong><br/>(PA,D) Picturing the &quot;Other&quot;: American Indians and Visual Culture examines the way that visual depictions of &quot;the Indian&quot;- in paintings, photographs, and film--have functioned as a way of negotiating identity for both Euro-Americans and Indigenous Americans between colonization and the present. Beginning with early American images of indigenous people as &quot;noble savages&quot; and ending with postmodern reinterpretations of indigeneity by contemporary Native American artists, we\\'ll come to understand how imagery reinforces powerful narratives about race and empire even as it provides the terms through which Native Americans have always negotiated their own self- representation.</p><p><strong>HIST-235 Reel History (4 Credits)</strong><br/>(PP) Examines how the past is represented in feature length movies, while providing students with the basic tools needed for film analysis. Students will become familiar with the language used to analyze films, while better understanding how film techniques and genre conventions change how the public understands historical events. Students will view films in and out of class, compare films from different eras, and research the historical context for important films of their choice. By the end of the term, students should be able to produce historically-informed, sophisticated film criticism. The particular historical topic under study will vary by instructor.</p><p><strong>HIST-250 Parade of Nations (4 Credits)</strong><br/>(PP, D) The modern Olympic Games are a product of the age of the nation state. This course examines the Olympic Games as a stage for twentieth-century international politics, from the Nazi Olympics and the Cold War to the rise of East Asian countries as economic powerhouses.  The Olympics will also serve as a prism through which course participants will investigate the relationship between sports and society, including issues of gender, race, technology, and media. We will analyze primary sources from the digital archives of the International Olympics Committee, documentary and film, interviews of athletes and spectators, and academic scholarship.  D suffux became effective as of May 5, 2021.</p><p><strong>HIST-252 Epic China (4 Credits)</strong><br/>(PP, G) This course examines the history of imperial China through three epic narratives: the unification of the Warring States by the First Emperor in 221 BCE, the rise and fall of dynasties, including those founded by nomadic invaders, and the collapse of imperial rule in the early twentieth century. Each unit of the course will be anchored by a critical viewing of a film. As appropriate to a course called &quot;epic,&quot; storytelling is a central concern. In addition to films, students will examine an array of sources that can help or hinder attempts to tell reliable stories about the past. Students will also become responsible narrators of the special kind of story we call History.  Course offered with foreign travel only.</p><p><strong>HIST-260 Making a Museum (4 Credits)</strong><br/>(PP) This course acts as a hands-on history workshop, during which students will, in the space of a few short weeks, conceptualize, build, and display a public exhibition of historical materials. Sometimes students will create physical exhibits; at other times, they\\'ll create digital ones. The topic and form of the exhibition will change each term it is offered, largely due to the fact that the course will typically partner with a different community organization each time. After performing historical research themselves, students will consider best practices in museums, public, and digital history, then apply those skills immediately to their own exhibition.</p><p><strong>HIST-265 Introduction to Museum Studies (4 Credits)</strong><br/>(PH) An introduction to the history, purpose, and relationship of museums to society. Provides an overview of collecting practices, collections care, exhibitions, visitor experience, and education in museums.</p><p><strong>HIST-267 Archival Research & Implementation (4 Credits)</strong><br/>(PP, D) This course serves as an introduction to the archival resources located within Augustana College\\'s Special Collections and within other institutions and communities. Through readings, hands-on activities, and discussions, students will learn how to ethically locate, assess, and implement primary sources in teir research and creative projects. Further, students will also develop a critical understanding of the various tools and methods utilized for public engagement and collection development. Throughout the semester, we will discuss the silences and power structures present in cultural heritage institutions, as well as the ongoing movement and challenges towards equity and inclusion within them. By building their own research tool, students will gain a larger awareness of the value and limitations of archival data and research.</p><p><strong>HIST-280 History Field School (4 Credits)</strong><br/>The History Field School is an on-site learning experience joining travel with hands-on historical investigation such as oral history fieldwork, visits to museums, and/or archival research.</p><p><strong>HIST-299 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of instructor.</p><p><strong>HIST-300 Gateway: Historical Research (4 Credits)</strong><br/>Introduction to basic skills and methods of historical research and writing, including acquisition and analysis of primary and secondary sources. Required for majors; intended for students early in their historical studies. Prerequisite: any 100-level history course (not including AP or transfer courses). During the course, students will research important local, state, and regional events. Offered once per year.</p><p><strong>HIST-305 Ancient Greece (4 Credits)</strong><br/>(PP) A survey of the history and culture of the ancient Greeks from their beginnings in the Mycenaean Bronze Age, through the &quot;Golden Age&quot; of Classical Athens and the Peloponnesian War, down to the life and impact of Alexander the Great. Special attention is given to the types of source material, both material and literary, used by historians to reconstruct Greek history, and also to the problems and limitations of these sources.</p><p><strong>HIST-306 Ancient Rome (4 Credits)</strong><br/>(PP) A survey of the history and culture of the ancient Romans from their beginnings in the 8th cen. BCE, through the development and expansion of the Republic and its transformation into an Empire, down to the fall of Rome in the 5th cen CE.  Special attention is given to the types of source material, both material and literary, used by historians to reconstruct Roman history, and also to the problems and limitations of these sources.</p><p><strong>HIST-316 Germany 1500-1914 (4 Credits)</strong><br/>(PP,G)This course will explore the tumultuous course of German-speaking Europe, including the Reformation(s), religious warfare, the Thirty Years\\' War, absolutism, the Enlightenment, movements for unification, and Imperial Germany. We will examine the tensions between religious revival and the forces of secularization as well as the place of groups and individuals in a period of contested state-building and nation-building.  </p><p><strong>HIST-317 Germany 1914-Present (4 Credits)</strong><br/>(PP,G)This course will analyze the changing construction of the German nation in WWI, the Weimar Republic, WWII, the two Germanies during the Cold War, and the (re)unification of 1990. We will examine the processes of modernization and their persistent critics, the difficulties of establishing a flourishing democratic civil society, and the complexities of forming a German nation amid periodic regime collapses.</p><p><strong>HIST-323 Dictators, Death & Dirty Wars (4 Credits)</strong><br/>(PP,G)During the twentieth century, anti-democratic regimes spread throughout Latin America and the Caribbean at an astonishing rate, at times taking root in unexpected places. The form varied, from brutal, one-man populism to military states to familial &quot;dynasties&quot; to one-party rule. Yet regardless of the guise, dictatorial regimes always seem to strike us as an aberration, and as a result, leave us with many questions: How do authoritarian regimes come to power and legitimize their rule? How can we make sense of the often horrifying violence? How have citizens and members of the international community, particularly the  United States, aided anti-democratic governments? What happens in the dictatorship\\'s aftermath? And how do individuals as well as nations remember regimes past? We will grapple with these questions and others over the course of the semester as we examine the Trujillo regime in the Dominican Republic, the Guatemalan and El Salvadoran civil wars, Castro\\'s Cuba, and the Dirty War in Chile.</p><p><strong>HIST-324 Borders & Crossings 1830-PRESENT (4 Credits)</strong><br/>(PP, D)  Latin Americans and their descendants have been present in the geographical area we now understand to be the United States since the late 1500s, but the settlement of Anglo-Americans in northern Mexico and the subsequent Texas Revolution and Mexican-American War ushered in a new era in the Latin American experience. With the United States\\' incorporation of Mexicans living in what is now Texas, Latin Americans began to become Americans and Latino/a, with all the complications therein. This course uses both case study and comparative models of history to uncover and think deeply about the experiences of Latin Americans and Latinos/as of Mexican, Puerto Rican, Dominican, Cuban, and Guatemalan-descent in the United States from 1830 to the present. Thus, the key questions that animate the course are: What circumstances led to the presence of Latin Americans/Latinos in the United States? Who and what is Latino/a? How have Latin Americans become Latino/a? And how have historical circumstances, race, gender, and class affected these processes and definitions for each group?</p><p><strong>HIST-330 Public History and Memory (4 Credits)</strong><br/>(PP)Investigates the many and diverse ways in which history is put to work in the world. Includes basic principles for the collection, organization, preservation and public presentation of history in places like museums, archives, and public agencies, or through public projects, like oral and digital history. Includes both practical experience in the field and theoretical discussions of memory. During each term, students will apply what they\\'ve learned to two major public projects, both done in conjunction with other groups on campus and/or the community. </p><p><strong>HIST-333 Disease and Health (4 Credits)</strong><br/>(PP) Changing perceptions, effects, and treatments of illness throughout American history. Covers major epidemics, industrial poisons, and attempts to manage sickness through public regulations and both conventional medical and alternative health care. Will show that current public health and healing practices were not predestined, but were produced by real people because of changing ideas about disease, bodies, and environments. Students will learn to analyze documents and artifacts about healthcare. Although the focus will be on the U.S., comparisons will be made with developments around the world.</p><p><strong>HIST-335 Am West in Hist & Memory (4 Credits)</strong><br/>(PP) The American West is both a stunningly unique part of the country and a potent metaphor for the nation as a whole. Giving close attention to documentary film, this course examines the West in memory, popular culture, and historical scholarship. How has the American West been understood by the peoples, societies, and empires who shaped and reshaped the region? How do documentary filmmakers and historians today make sense of the history of the West? What stories have people told about the West, and who gets the story right? How does western history matter for the social, political, and environmental challenges we face today?</p><p><strong>HIST-336 A Consumer\\'s Republic (4 Credits)</strong><br/>(PP)Today, the dominant cultural experience for most Americans--and what people the world over think of as &quot;The American Way of Life&quot;--is the culture of consumption. This course examines the history of this new way of life: how it began, what it replaced; who benefited from it, who suffered; the development of its key institutions, rituals, practices, ideals, commodities, arenas, and power relations. Because ambivalence about wealth and luxury is one of the oldest American traditions, the building of a Consumers\\' Republic did not escape criticism. Critics have said that for the good of the planet and for our own well-being, we need to find ways of living that wreak less destruction on the Earth and build communities up instead of tearing them down. A key question of the course, then, is this: how does the history of American consumerism--and its critics--help us think better about how we want to live, but do not yet live?</p><p><strong>HIST-337 Images As History in US (4 Credits)</strong><br/>(PA) Whether defined as art, memento, or propaganda, images are powerful tools for telling stories. This course will examine the storytelling power of images, using historical thinking to unpack the meanings latent in images, focusing particularly on how images have been used to construct and critique ideas about race, class, gender, and nationality in the U.S. What impact did images have at the time they were created, and how do they continue to shape our understanding of history? How do historians use images to tell new stories?</p><p><strong>HIST-338 The Long Sixties (4 Credits)</strong><br/>(PP) Like the 1760s and 1860s, the 1960s casts a long shadow on American life. People don\\'t agree on what it was all about. Historians don\\'t agree. Liberals and conservatives don\\'t agree. Hawks and doves on the Vietnam War don\\'t agree. Men and women, church-goers and secularists, white radicals and black conservatives-people don\\'t agree on the stories to tell about the Sixties. The disagreements are profound because they cut to the heart of how we as a society think we ought to live. This course attempts to come to terms with the historical moment we call &quot;The Sixties,&quot; a watershed period in American history that continues to be celebrated, regretted, argued with, and debated. Most of all, it is misunderstood. This course addresses the following Big Questions: What is the best story for making sense of the Sixties? What stories about the Sixties are overlooked? What stories are unworthy of belief? What stories about the Sixties have not yet been told? How do historians justify the stories they tell to make sense of the past?</p><p><strong>HIST-340 Gender in U.S. History (4 Credits)</strong><br/>(PP,D)In this course you will develop skills for using gender as a category of analysis and as a tool for challenging the systems that perpetuate oppression and violence in the world we live in today. To that end, we will investigate how masculinity and femininity have changed over time, even as we question the universality of the categories &quot;woman&quot; and &quot;man.&quot; By understanding the ways that gender has always operated intersectionally with race, class, ethnicity, status, religion, and sexuality from the pre-colonial era to the present, we gain critical insight into the mechanisms of power, privilege, and resistance. </p><p><strong>HIST-345 African-American History (4 Credits)</strong><br/>(PP,D) Now a subfield of American history, African American history is American history that is  &quot;longer, larger, more various, more beautiful, and more terrible than anything anyone has ever said about it&quot; (James Baldwin). Since most people today learn their history at the movies, this course pays attention to how feature-length films tell the story of the African American past, asking: Has Hollywood got the story of African-American history right? What is the story of African-American history? How does one judge the quality of accounts of the past, whether told by filmmakers or historians?</p><p><strong>HIST-350 Modern China in a Century of Rev (4 Credits)</strong><br/>(PP,G)Modern China in a Century of Revolution.   In the twentieth-century, China was rocked by successive revolutions. From a nationalist revolt against a non-Chinese dynastic empire to a communist revolt against imperialism and class enemies, the history of modern China is a history of struggle. This course interweaves the political history of China\\'s revolutionary twentieth century with stories of other types of change, harder to pinpoint in time, but no less significant. Themes include the urban-rural divide, the rise of Chinese feminisms, youth rebellion, and competing visions of local community, national identity, and a utopian world.</p><p><strong>HIST-355 Japanese Empire & Its Ashes (4 Credits)</strong><br/>(PP,G) Japan is the only non-Western power to build an expansive colonial empire in the age of imperialism. This course examines Japan\\'s empire from the colonization of Taiwan in 1895 through the devastation of World War II and its aftermath. Emphasis will be placed on the ways in which everyday people experienced Japanese imperialism in Japan and in the colonies during times of war and times of peace. Course participants will also analyze legacies and memories of Japanese imperialism, from the discriminatory treatment of people of Korean descent in post-war Japan to the neo-nationalist views expressed in the manga On War.</p><p><strong>HIST-358 Perspectives From East Asia (4 Credits)</strong><br/>(PP, G) History vs. Heritage: Perspectives From East Asia  History and heritage both reference the past, but they have different purposes and standards of evidence. This course examines heritage making as a way of building community, defining cultural values, and exercising power through a selective engagement with the past. Through a series of case studies from the recent history of East Asia, the course will examine the ways in which the past has been used, abused, and contested to serve the needs of the present. In teasing out the differences between history and heritage, the course will demystify icons of East Asian culture, like the Japanese samurai and the Confucian sage. We will also examine powerful heritage institutions, such as the modern museum and the United Nations Educational, Scientific, and Cultural Organization (UNESCO) as they relate to the history of East Asian countries.</p><p><strong>HIST-370 European Revolutions in Comparison (4 Credits)</strong><br/>(PP) Modern Europe was frequently shaken by multiple revolutions, including the &quot;Glorious Revolution&quot; of 1688, several revolutions in France, the wide-spread revolutions of 1830 and 1848, the two Russian revolutions of 1917, and the revolutions that led to the end of Soviet communism. We will examine the causes, course, and consequences of at least three revolutions that reshaped civil societies and fundamental political structures in Europe.</p><p><strong>HIST-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>HIST-399 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of instructor.</p><p><strong>HIST-400 Independent Study (1-2 Credits)</strong><br/>Investigation of topics involving original research. Open only to seniors with a grade-point average in history of 3.0 or better, with consent of instructor.</p><p><strong>HIST-440 Senior Inquiry Practicum (2 Credits)</strong><br/>Majors will enroll in this course in the spring of their junior year. The course will meet once per week, during which time students will develop a proposal for their SI, to be conducted the following fall. Proposals must be approved by the department before students may enroll in HIST-450. Prerequisite: HIST-300 Offered once per year.</p><p><strong>HIST-450 Senior Inquiry (4 Credits)</strong><br/>Prerequisite: Successful completion of HIST440. The capstone seminar for students preparing to graduate with a history major. Students will first perform in-depth research on a significant topic, then they will begin drafting arguments, clarifying claims, and revising their writing. The final product will be a polished essay communicating the results of a significant project of historical research as well as a reflection about students\\' experience in the field of history.   Offered once per year.</p><p><strong>HIST-499 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of instructor.</p>');",
  "scrape_metadata": {
    "original_title": "History",
    "dept_slug": "history",
    "original_url": "https://augustana.edu/academics/areas-of-study/history",
    "courses_url": "https://augustana.edu/academics/areas-of-study/history/courses",
    "scrape_timestamp": "2025-09-26 19:58:21",
    "status": "success"
  }
}