{
  "program_title": "Japanese course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/japanese/courses",
  "faculty": [],
  "requirements": {
    "major_in": null,
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": "20 credits, including the following: ∙ Two core language courses: 2 JPN courses beyond 102 taken on campus (typically JPN201, 202) ∙ One additional JPN or JPST course: any upper-level JPN course beyond 202 or any JPST course. ∙ Two elective courses: any JPN courses, including JPN102 and beyond, any JPST courses, HIST355 (Japanese Empire), and KINS270 (Japan Sports & Culture). Participation in a study abroad in Japan is strongly recom mended. A maximum of 12 credits of coursework taken overseas may count toward the minor. For an interdisciplinary minor related to Japanese, see Linguistics and Asian Studies",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=jpn",
  "courses_html": "document.write('<p><strong>JPN-101 First Year Japanese I (4 Credits)</strong><br/>Introduction to Japanese language, both written and spoken. Includes study of the culture of Japan and an introduction to intercultural communication. For students with no prior study of Japanese.</p><p><strong>JPN-102 First Year Japanese II (4 Credits)</strong><br/>Fundamentals of spoken and written Japanese. Basic grammatical patterns and practical conversation skills with an emphasis on speaking, listening, writing, and reading.  Includes study of cultural aspects of Japanese society.  Prerequisite: JPN101 or the equivalent.</p><p><strong>JPN-120 First Level Japanese (8 Credits)</strong><br/>(G) An intensive language course offered at one of our partner universities in Japan. All language skills, including speaking, listening, writing and reading, the expansion of kanji/ vocabulary knowledge, and study of Japanese culture and society are emphasized. This course prepares students for Japanese Language Proficiency Test (JLPT), N5. Prerequisite: JPN101 or the equivalent.</p><p><strong>JPN-121 First Level Japanese (6 Credits)</strong><br/>(G) An intensive language course offered at one of our partner universities in Japan. All language skills, including speaking, listening, writing and reading, the expansion of kanji/ vocabulary knowledge, and study of Japanese culture and society are emphasized. This course prepares students for Japanese Language Proficiency Test (JLPT), N5. Prerequisite: JPN101 or the equivalent.</p><p><strong>JPN-201 Second Year Japanese I (4 Credits)</strong><br/>Continuation of the first-year sequence. Emphasis is placed on the development of practical conversation skills as students broaden their knowledge of vocabulary, kanji characters, more complex grammatical patterns, and Japanese culture and society. Prerequisite: JPN102 or JPN120 or the equivalent.</p><p><strong>JPN-202 Second Year Japanese II (4 Credits)</strong><br/>Continuation of JPN201. Emphasis is placed on the students broadening their knowledge of vocabulary, kanji characters, more complex grammatical patterns, and Japanese culture and society. Prerequisite: JPN-201 or the equivalent.</p><p><strong>JPN-211TR Japanese Elective (3-4 Credits)</strong><br/></p><p><strong>JPN-220 Second Level Japanese (8 Credits)</strong><br/>(G) An intensive language course offered at our partner universities in Japan. All language skills, including speaking, listening, writing and reading, the expansion of kanji/vocabulary knowledge, and study of Japanese culture and society are emphasized. This course aims at achieving Japanese Language Proficiency Test (JLPT) N4. Prerequisite: JPN102 or the equivalent.</p><p><strong>JPN-221 Second Level Japanese (6 Credits)</strong><br/>(G) An intensive language course offered at our partner universities in Japan. All language skills, including speaking, listening, writing and reading, the expansion of kanji/vocabulary knowledge, and study of Japanese culture and society are emphasized. This course aims at achieving Japanese Language Proficiency Test (JLPT) N4. Prerequisite: JPN102 or the equivalent.</p><p><strong>JPN-301 Third Year Japanese I (4 Credits)</strong><br/>Continuation of the second-year sequence, designed for students who have acquired elementary levels of Japanese. Continues to expand vocabulary, grammar, and kanji, and cultural understanding. This course completes the introduction of essential Japanese syntactic forms and sentence patterns. Prerequisite: JPN-202 or JPN 220 or the equivalent.</p><p><strong>JPN-302 Third Year Japanese II (4 Credits)</strong><br/>This course seeks to utilize, develop, and integrate skills acquired in the earlier stages of language learning, based on a variety of authentic texts. While continuing to expand vocabulary, grammar, and kanji, the course focuses on developing proficiency in using the language with the deeper understanding of its social and cultural references. The primary language in class is Japanese. Prerequisite: JPN-301,or the equivalent.</p><p><strong>JPN-320 Third Level Japanese (8 Credits)</strong><br/>(G) An intensive language course offered at our partner universities in Japan. All language skills, including speaking, listening, writing and reading, the expansion of kanji/ vocabulary knowledge, and study of Japanese culture and society are emphasized. This course aims at achieving Japanese Language Proficiency Test (JLPT) N3. Prerequisite: JPN202 or the equivalent.</p><p><strong>JPN-321 Third Level Japanese (6 Credits)</strong><br/>(G) An intensive language course offered at our partner universities in Japan. All language skills, including speaking, listening, writing and reading, the expansion of kanji/ vocabulary knowledge, and study of Japanese culture and society are emphasized. This course aims at achieving Japanese Language Proficiency Test (JLPT) N3. Prerequisite: JPN202 or the equivalent.</p><p><strong>JPN-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>JPN-399 Directed Study (1-2 Credits)</strong><br/></p><p><strong>JPN-401 Japanese Language Practicum I (2 Credits)</strong><br/>More guided practice in speaking, reading, listening and writing in Japanese while expanding vocabulary, kanji, idioms, grammatical patterns, cultural knowledge and comprehension. While oral communication practice is central in the classroom, the assignment emphasis is placed on higher level of reading and writing. Prerequisite: JPN301, JPN320, or the equivalent. May be repeated for credit.</p><p><strong>JPN-402 Japanese Language Practicum II (2 Credits)</strong><br/>More guided practice in speaking, reading, listening and writing in Japanese while expanding vocabulary, kanji, idioms, grammatical patterns, cultural knowledge and comprehension. While oral communication practice is central in the classroom, the assignment emphasis is placed on higher level of reading and writing. Prerequisite: JPN302, JPN320, or the equivalent. May be repeated for credit.</p><p><strong>JPN-420 Fourth Level Japanese (8 Credits)</strong><br/>(G) An intensive language course offered at our partner universities, in Japan. All language skills, including speaking, listening, writing and reading, the expansion of kanji/ vocabulary knowledge, and study of Japanese culture and society are emphasized. This course prepares students for Japanese Language Proficiency Test (JLPT), N2.</p><p><strong>JPN-421 Fourth Level Japanese (6 Credits)</strong><br/>(G) An intensive language course offered at our partner universities in Japan. All language skills, including speaking, listening, writing and reading, the expansion of kanji/ vocabulary knowledge, and study of Japanese culture and society are emphasized. This course prepares students for Japanese Language Proficiency Test (JLPT), N2. Prerequisite: JPN310 or the equivalent.</p><p><strong>JPN-INTR Japanese Internship (0-12 Credits)</strong><br/>JPN-INTR Academic Internship (0-12)   Prerequisite: a declared minor in JPN. Departmental internships must be approved by the department. DEPT-INTR are letter-graded unless noted otherwise. A maximum of 4 internship credits may be applied toward the JPN minor. See the Internships page for detailed information.</p>');",
  "scrape_metadata": {
    "original_title": "Japanese",
    "dept_slug": "japanese",
    "original_url": "https://augustana.edu/academics/areas-of-study/japanese",
    "courses_url": "https://augustana.edu/academics/areas-of-study/japanese/courses",
    "scrape_timestamp": "2025-09-26 19:58:32",
    "status": "success"
  }
}