{
  "program_title": "Kinesiology Course Catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/kinesiology/courses",
  "faculty": [],
  "requirements": {
    "major_in": null,
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": null,
    "gpa_note": null,
    "other_sections": {
      "courses_hdr": ""
    }
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=kins",
  "courses_html": "document.write('<p><strong>KINS-100 Intro to Kinesiology (4 Credits)</strong><br/>An overview of kinesiology, the interdisciplinary study of physical activity. Examines human motor behavior and its cultural forms such as sport from the physiological, psychological, sociological, historical, philosophical, and biomechanical perspectives.</p><p><strong>KINS-100L Lab for 100 (0 Credits)</strong><br/></p><p><strong>KINS-100TR Kinesiology Elective (1-9 Credits)</strong><br/></p><p><strong>KINS-200TR Kinesiology Elective (1-9 Credits)</strong><br/></p><p><strong>KINS-220 Issues in Sports (4 Credits)</strong><br/>Although we often consider sport and physical activity as recreational value-free activities, they often serve as a window into societal norms and as a space for social change. This course is designed for majors and non-majors alike to explore some of the contemporary controversies found within sport and physical activity. In exploring these controversies, we will debate different perspectives in order to critically examine these controversies in the broader context of social, political, and cultural changes.</p><p><strong>KINS-250 Sociology of Sport & Phys Culture (4 Credits)</strong><br/>(PS) To some, sport and physical culture seem to exist outside of society - somehow removed from the political, social, and cultural issues that shape our daily lives. This course seeks to challenge that separation: instead arguing that sport and physical culture are deeply intertwined with the values of our current socio-political moment. This course will ask you to think critically about a topic you may have taken for granted.  From the local sporting experiences of high school athletes to the giant spectacles of the OIympics, we will investigate and interrogate the often overlooked exceptionalism of sport and physical culture. In the first module we will lay out the contemporary landscape of sport and physical culture and examine the ideologies, philosophies, and assumptions that we bring to these spaces. In the second module, we will explore the social construction of individual identities and groups, and how those groups both create, and are created by, their involvements in sport and physical activity. Finally, we will explore sport and physical activity\\'s power to bring diverse groups together, and examine the ways in which that can be used for equitable and inequitable practices.  As we delve into the complexities of sport and physical culture, you will take on the role of a potential agent of change. How can you, within your current and future spheres of power, help make sport and physical culture better for everyone?</p><p><strong>KINS-251 Anat & Phys for KINS (4 Credits)</strong><br/>This course will cover the structure and function of the human body as it relates to the field of kinesiology. Topics will include the physiology and anatomy of the cardiovascular, nervous, musculo-skeletal, endocrine, and digestive systems.</p><p><strong>KINS-270 Japan Sport & Culture (4 Credits)</strong><br/>(PS, G) This course will introduce students to the sporting culture and history of Japan while traveling to Japan during J-term. While our focus will be on physical culture, sport, and the active body, we will also engage in cultural activities and field trips to develop a greater understanding of broader Japanese culture. Through a combination of classroom study, guided experiences, and observation, students will develop a deeper understanding of Japanese culture. The topics and reading materials closely relate to each destination and include history, religion, social system, ritual, and contemporary issues. Finally, being in a different culture provides an opportunity for us to reflect on our own culture - examining the things we often accept as &quot;normal&quot; in our day to day lives.  Taught in English. No prerequisite.</p><p><strong>KINS-300 Exercise Physiology (4 Credits)</strong><br/>Building on previous coursework in anatomy and physiology, the exercise physiology course critically examines the body\\'s responses and adaptations to exercise. Particular emphasis will be placed on the interaction between different physiological systems in healthy individuals during exercise, and changes that occur within those systems due to aging, disease, and lifestyle differences. Using primary scholarly articles, experimentation, and discussion, we will explore the ways that exercise and other forms of physical activity affect our body\\'s capacity for performance. Prerequisite: KINS-100 and either KINS-251 or BIOL-362.</p><p><strong>KINS-300L Lab for 300 (0 Credits)</strong><br/></p><p><strong>KINS-320 Sporting Hollywood (4 Credits)</strong><br/>Sporting Hollywood is a course that seeks to shed light on an often overlooked, and quite powerful, form of narrative - the sport film. Sport films create stories that show a &quot;version&quot; of the truth that is dramatized and made accessible to a wide viewership. While some sport films attempt to recreate the past, others tell tales that could be true, but often are not. From the all-American rags to riches story of Rocky to the heavily embellished A League of Their Own, sport films are delightful myths filled with social, cultural, and political meanings.</p><p><strong>KINS-330 Biomechanics Human Mvmnt (4 Credits)</strong><br/>Even as we marvel at the capabilities of the human body, it remains governed by the fundamental principles of physics. During this course, we will examine the structure and function of the human body from the perspective of classical mechanics. Through an emphasis on quantitative analysis of the features and qualities of human movement, we will explore the relationship between movement (kinematics) and the causes of that movement (kinetics). We will investigate these relationships at both the full-body level and at the tissue level. We will then look at the implications of these interactions on both human performance and injury risk Prerequisite: KINS-100 or Permission of Instructor.</p><p><strong>KINS-330L Lab for 330 (0 Credits)</strong><br/></p><p><strong>KINS-336 Impact of Footwear on Athletic Perform (4 Credits)</strong><br/>Locomotor movements are governed by the interaction between our feet and the ground. Consequently, what we have on our feet affects our movements. By influencing the interaction between our feet and the ground, footwear attempts to do one of two things: reduce risk for injury or improve performance. In this course, we will investigate the role of footwear in sport. By first establishing the mechanical basis of locomotor movements with an emphasis on the foot and lower extremity, we will be able to investigate the effects that footwear can have on those movements. Through an emphasis on laboratory assessment and scientific literature, we will learn how to effectively collect data in a lab setting. This will allow us to evaluate footwear and objectively determine the ways in which it can help an athlete perform at their highest ability.</p><p><strong>KINS-350 Strength & Conditioning (4 Credits)</strong><br/>This advanced level course explores the principles and practices of strength and conditioning based on the content required to take the National Strength and Conditioning Association\\'s (NSCA) Certified Strength and Conditioning Specialist certification exam. Participants will delve into the science behind strength training, exploring topics such as exercise testing and prescription, the principles of progressive overload, and working with special populations. Through a combination of lectures, practical demonstrations, and hands-on training sessions, students will learn how to design safe and effective strength training programs tailored to individual needs and goals.  Prerequisite: KINS-100 or Permission of Instructor.</p><p><strong>KINS-380 Special Topics (4 Credits)</strong><br/>This course explores the principles and practices of strength and conditioning as it relates to combative and tactical populations. Based on the content required to take the NSCA Tactical Strength and Conditioning Facilitator (TSAC-F) certification exam, participants will examine the physical demands of tactical professions such as military, law enforcement, and fire and rescue. Demands that require those workers to be in top physical condition to perform their jobs well and decrease the risk of injury. Additionally, participants will examine the unique demands required of combative (grappling, standing, mixed) athletes from training to making weight for competition.Through a combination of lectures, scientific literature, and practical hands-on demonstrations, participants will learn to use this knowledge to develop training programs tailored to their needs and goals.</p><p><strong>KINS-464 Senior Inquiry (4 Credits)</strong><br/>The Senior Inquiry is a culminating experience for students in the Kinesiology program. This course provides students an opportunity to explore an area of selected interest within the discipline while also examining issues relevant to the field.</p><p><strong>KINS-ELEC Kinesiology Elective (1-12 Credits)</strong><br/></p>');",
  "scrape_metadata": {
    "original_title": "Kinesiology",
    "dept_slug": "kinesiology",
    "original_url": "https://augustana.edu/academics/areas-of-study/kinesiology",
    "courses_url": "https://augustana.edu/academics/areas-of-study/kinesiology/courses",
    "scrape_timestamp": "2025-09-26 19:58:35",
    "status": "success"
  }
}