{
  "program_title": "Mathematics course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/mathematics/courses",
  "faculty": [],
  "requirements": {
    "major_in": "34 credits at the Calculus level or above, including MATH 160, MATH 250, MATH 260, MATH 350, MATH 410, MATH 450, MATH 490 and two electives at least one of which must be at the 300 – 400 level. At most 2 credits of directed/independent study can count towards major. Recommended supporting course: CSC 201 Recommended supporting course: PHIL 300 34 credits in MATH at the Calculus level or above, including MATH 160, MATH 220, MATH 250, MATH 260,MATH 320, MATH 340, MATH 460 and MATH 330 or MATH 350, plus one of MATH 360, MATH 410, MATH 430, MATH 440, MATH 450 or MATH 480. At most 2 credits of directed/independent study can count toward the major. In addition students must take CSC 201 and 8 additional credits from outside of MATH to provide an area of specialization. 32 credits in MATH, including MATH 160, MATH 220, MATH 230, MATH 250, MATH 330, MATH 350, MATH 410, MATH 450 and MATH 470. Recommended supporting course: CSC201",
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": "20 credits at the Calculus level or above, including MATH 160, MATH 250, MATH 350, and two electives at least one of which must be at the 300-400 level. At most 2 credits of directed/independent study can count toward the minor. Students who received Calculus AP credit with a score of 4 or above will receive 4-6 credits toward the major or minor. Commercially available software is integrated into most of our classes. A graphing calculator is generally required for MATH 140, MATH 160 and MATH 220. The department uses the Texas Instruments TI-84 Plus in MATH 140 and MATH 160 and the TI-89 Titanium in MATH 220 and other courses. (Students planning to take MATH 220 may use the TI-89 in MATH 140 and MATH 160, so need not purchase both.)",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=math",
  "courses_html": "document.write('<p><strong>MATH-090 Preparation for College Math (4 Credits)</strong><br/>This course focuses on algebra skills needed to be successful in future college math classes. Credit for this course does count toward current load, but does not count toward the credit total for graduation. Students will see these credits appear on the transcript and factor into the grade point average, but because the credits do not count toward graduation, students will note they do not appear in credits earned in their program evaluation. Students who are placed in MATH-090 will have to complete the coursework with a grade of B+_ in order to be allowed to register for MATH-140 Pre-Calculus. MATH-090 is for incoming students only.</p><p><strong>MATH-095 Supported Math Review (1 Credits)</strong><br/>This 1-credit course is designed for students who need to review their math skills before starting a college level math class. It is intended for students whose ALEKS placement score is close to the cut-off for their desired math class. The goal is to ensure each student start their math experience at the right level. Credit for this course will count toward full time status and financial aid, but not toward the 124 credits needed to graduate.</p><p><strong>MATH-110 Mathematics for Elementary Teachers (4 Credits)</strong><br/>(Q) This course explores elementary school math topics, with emphasis placed on using various approaches to explain why standard and non-standard methods are valid and why incorrect methods are invalid.  Topics covered include: addition, subtraction, multiplication and division of whole numbers, integers, fractions and decimals, ratio and elementary number theory, geometry, measurement, area and perimeter. Enrollment limited to majors in elementary education. Prerequisite: three years of high school math (Geometry, Algebra I and II) or equivalent.</p><p><strong>MATH-120 Quantitative Reasoning (4 Credits)</strong><br/>(Q) In this course students develop their quantitative reasoning skills through the study of topics important for engaged citizens in today\\'s world. Topics include working with large numbers, percentages used to describe change, interest rates and exponential growth, group decision making, analyzing and making charts, probability and statistics.  Not applicable to the Mathematics major or minor. </p><p><strong>MATH-130 Statistics for Health Professionals (4 Credits)</strong><br/>(Q) Statistics is a powerful tool for making informed decisions. The goal of this course is to provide students the background to be able to read and understand research results, specifically those involving health and the practice of medicine. The course will start with the planning and organization of a study, then back up to talk about collecting and managing data followed by probability, distributions, hypothesis testing and confidence intervals. Analysis of variance, linear, multilinear and logistic regression are introduced in the context of actual medical studies. How to access the strengths and weaknesses of conclusions drawn from scientific studies is a central theme. This course will finish with a brief introduction to the language of risk, survival concepts, clinical trials, epidemiology and Bayesian statistics.  Credit may not be earned for more than one of MATH-130 BUSN-211, PSYC-240, or SOAN-227,</p><p><strong>MATH-135 Pre-Calculus Support (2 Credits)</strong><br/>This 2-credit course is designed for students who need extra support to be successful in Pre-Calculus. Taking this class will allow students who missed the ALEKS placement for Pre-Calculus and students who have completed MATH 095 Supported Math Review with a grade of C or better to register concurrently for MATH 140 Pre-Calculus. Other students may be considered based on the recommendations of their advisor and previous instructors.</p><p><strong>MATH-140 Pre-Calculus (4 Credits)</strong><br/>(Q)Linear, exponential, logarithmic, power, periodic, polynomial and rational functions are compared, contrasted, transformed, and combined in the context of real world problems. May not be taken for credit after the completion of any mathematics course numbered 160 or above.  Prerequisite:  B+ in MATH 090 or placement into Pre-Calculus</p><p><strong>MATH-150 History of Math (4 Credits)</strong><br/>(PP) This course will focus on the lives and works of diverse mathematicians throughout history. Topics will include some subset of ancient mathematicians (e.g., Pythagoras), European mathematicians (e.g., Alan Turing), South Asian mathematicians (e.g., Brahmagupta), women mathematicians (e.g., Ada Lovelace), and modern day mathematicians (e.g., Terence Tao). Students will be able to explore the lives and potential obstacles of these mathematicians, as well as their mathematical work and its applications to modern day mathematics. The course has no prerequisites, so anyone with an interest in mathematics is welcome.</p><p><strong>MATH-160 Calculus (4 Credits)</strong><br/>(Q) Calculus is the precise and quantitative study of change. This course explores the notions of an instantaneous rate of change and accumulation of infinitesimally small quantities. This course emphasizes conceptual understanding, not just computational fluency, and students will reason about the concepts in applied, numerical, graphical, algebraic/analytic, and verbal contexts. Topics include derivatives, definite integrals, and the Fundamental Theorem of Calculus. Prerequisite: C or better in MATH 140 or placement into Calculus</p><p><strong>MATH-160AP AP Calculus (4 Credits)</strong><br/></p><p><strong>MATH-199 Math Support (1 Credits)</strong><br/></p><p><strong>MATH-201TR Math Transfer Elective (3-4 Credits)</strong><br/></p><p><strong>MATH-220 Integration Methods (2 Credits)</strong><br/>In this course students learn methods of anti-differentiation including integration by parts and partial fractions.  Students construct applications of the definite integral and are introduced to differential equations.  Prerequisite:  C  or better in MATH 160. Course can count as a lower level elective for the mathematics major.</p><p><strong>MATH-220AP AP Integration Methods (2 Credits)</strong><br/></p><p><strong>MATH-230 Infinite Series (2 Credits)</strong><br/>In this course students learn how to carefully work with infinite sums, determining when they converge and how to use them to approximate differentiable functions and model infinite processes.  Prerequisite:  C or better in MATH 160. Course can count as a lower level elective for the mathematics major.</p><p><strong>MATH-230AP AP Infinite Series (2 Credits)</strong><br/></p><p><strong>MATH-250 Discrete Mathematics (4 Credits)</strong><br/>(Q) An introduction to mathematical proof; students will develop skills for exploring patterns, parsing and using definitions, constructing and validating arguments, working with quantifiers, and communicating mathematical thinking with others. Discrete mathematics is the study of finite and countable phenomena including graph theory, modular arithmetic, and some sets and functions, which are both familiar and new enough to support learning about proof, contrast with the continuous phenomena studied in calculus, and support future work in modeling and computer science. Prerequisite:  C or better in MATH 160</p><p><strong>MATH-260 Multivariable Calculus (4 Credits)</strong><br/>(Q) In this course students apply the concepts of Calculus to functions that live in 3 or more dimensions.  This will require an understanding of vectors and parametrically defined functions. Topics include partial derivatives, nested integrals and extensions of the Fundamental Theorem of Calculus. Prerequisite:  C or better in MATH 160</p><p><strong>MATH-282TR Differential Equations Transfer (3-4 Credits)</strong><br/></p><p><strong>MATH-285TR Linear Algebra Transfer (3-4 Credits)</strong><br/></p><p><strong>MATH-299 Directed Study (1-2 Credits)</strong><br/></p><p><strong>MATH-310 Introduction to Cryptography (4 Credits)</strong><br/>How can we establish trust and security of information in an inherently distrustful and insecure world?  This course provides an introduction to traditional and modern forms of cryptography.  Topics may include: public/private key encryption, one-way hash functions, ciphers, psuedo-random number generators, zero-knowledge, and applications of cryptography including blockchains.   Prerequisite: Discrete Math and CSC 201. Course can count as an upper level elective for the applied mathematics major.</p><p><strong>MATH-320 ODEs and Linear Systems (4 Credits)</strong><br/>A study of modeling continuous physical systems using differential equations of the first and second orders. Techniques for finding analytic solutions, numeric solutions, and the use of Laplace transforms.  Series solutions and/or linear systems of differential equations are also discussed. Prerequisite: Grade of C or better in MATH 220.</p><p><strong>MATH-330 Probability and Statistics (4 Credits)</strong><br/>In this course students use the principles of counting and probability to develop the foundations of Statistics from the ground up,  learning both the  theory and applications.  Topics include confidence intervals and hypothesis testing and Experimental design.  Prerequisite:  Grade of C or better in MATH-250</p><p><strong>MATH-340 Mathematical Modeling (4 Credits)</strong><br/>Discrete modeling with an emphasis on computation.  Topics include difference equations, stochastics, Markov chains, simulations, graph theory, linear programming and optimization methods.   Grade of C or better in MATH-250 and CSC-201.</p><p><strong>MATH-350 Linear Algebra (4 Credits)</strong><br/>In this course students discover the connections between solutions to linear equations, subspaces of vector spaces, linear transformations and matrix properties. Topics include linear independence, spanning and eigenvectors. Prerequisite:  Grade of C or better in MATH-250</p><p><strong>MATH-360 Complex Variables (4 Credits)</strong><br/>Calculus of functions of a complex variable.  Proof of the fundamental theorem of algebra, a study of residue calculus and the use of residues to compute improper real integrals.  Prerequisite:  Grade of C or better in MATH-260.</p><p><strong>MATH-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>MATH-399 Directed Study (1-2 Credits)</strong><br/></p><p><strong>MATH-400 Independent Study (1-2 Credits)</strong><br/>Prerequisites: 18 upper-division credits in mathematics and consent of department chair.</p><p><strong>MATH-410 Real Analysis (4 Credits)</strong><br/>This proof-based course explores infinite processes carried out on the real line. Using the axiom of completeness and several equivalent statements we establish important topological properties of the real line and functions acting on it. These in turn are used to establish important properties of the derivative and Riemann integral, culminating in the Fundamental Theorem of Calculus. Prerequisite: Grade of C or better in MATH-230 and MATH 350.</p><p><strong>MATH-420 Intro to Statistical Learning (4 Credits)</strong><br/>Statistical learning refers to a set of tools for making sense of complex data sets. In particular, this course will introduce statistical techniques for making predictions based on data. The course will concentrate on the application of these methods, with hands-on experience gained through labs and projects. Topics will include estimation of coefficients for various regression models: Ridge Regression, Lasso Regression, Regression Splines, and Generalized Additive Models, and classification with logit/probit models such as Logit and MLogit, naive Bayes and Bayesian Additive models, and survival analysis with censored data. Prerequisite: MATH-330</p><p><strong>MATH-430 Advanced Statistics (4 Credits)</strong><br/>In this course students solidify and build on their understanding of inferential statistics, both the theory and applications. Students also evaluate the role of statistics in society.  Topics include:  moment generating functions, single and multilinear regression, analysis of variance and non-parametric statistics. Prerequisite: Grade of C or better in MATH 330.</p><p><strong>MATH-440 Numerical Methods (4 Credits)</strong><br/>Numerical algorithms, roots of an equation, interpolation, curve-fitting and approximation of functions, numerical integration, solution of linear equations, solutions of systems of differential equations, programming of algorithms, use of computer software. Emphasis on determining uncertainty from numeric results. Prerequisites: Grade of C or better in MATH 260 and CSC 201</p><p><strong>MATH-450 Algebraic Structures (4 Credits)</strong><br/>This course explores the abstract ideas of structure and operation. When are two structures the same? What maps preserve structure? Topics include groups, rings, fields, generators, sub-objects, quotients, and morphisms. Prerequisite:   Grade of C or better in MATH 350.</p><p><strong>MATH-460 SI Applied Mathematics (4 Credits)</strong><br/>Senior capstone course for applied mathematics majors with a focus on advanced mathematical modeling.  Topics may include:  Partial differential equations, advanced linear algebra, advanced probabilistic or statistical models, or other appropriate topics.  The course emphasizes student research, reflection and presentation of mathematics. Prerequisites:  Grade of C or better in MATH 260, MATH 320 and MATH 340.</p><p><strong>MATH-470 Foundations of Geometry (4 Credits)</strong><br/>(PH) This course explores 2 dimensional geometry from an advanced perspective, emphasizing the philosophical and historical considerations of this perspective. What is the nature of geometric truth and knowledge, and what are its origins? The content and perspective of this course support future teachers. Prerequisite: Grade of C or better in  MATH 350.</p><p><strong>MATH-480 Advanced Topics (4 Credits)</strong><br/>This course will explore a topic outside of the existing curriculum. Prerequisite: MATH410, 450, 470 or permission of instructor. </p><p><strong>MATH-490 SI Mathematics (4 Credits)</strong><br/>Continued development of mathematical inquiry skills, including the formulation, exploration, and communication of questions of personal interest. This course will integrate the major experiences by asking questions that blend concepts and skills from across the curriculum; this course will integrate the college experiences by reflecting on growth and the relationships between mathematics and the rest of the liberal arts. Prerequisite: Grade of C or better in MATH 410 and MATH 450</p><p><strong>MATH-499 Directed Study (1-2 Credits)</strong><br/></p>');",
  "scrape_metadata": {
    "original_title": "Mathematics",
    "dept_slug": "mathematics",
    "original_url": "https://augustana.edu/academics/areas-of-study/mathematics",
    "courses_url": "https://augustana.edu/academics/areas-of-study/mathematics/courses",
    "scrape_timestamp": "2025-09-26 19:58:51",
    "status": "success"
  }
}