{
  "program_title": "Multimedia Journalism and Mass Communication course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/multimedia-journalism-and-mass-communication/courses",
  "faculty": [],
  "requirements": {
    "major_in": "30 credits, including three foundational courses (MJMC-215, MJMC-250 and MJMC-251); two advanced study courses (MJMC-301 and MJMC-382), senior inquiry (MJMC-450), an internship during junior or senior year taken for credit or no-credit and eight credits of elective courses; in addition to MJMC courses, COMM-230, COMM-240 and COMM-370 may be used to fulfill this requirement.",
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": "20 credits, including MJMC-215, MJMC-250, MJMC-251, and MJMC-301; at least 4 credits of MJMC electives.",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=mjmc",
  "courses_html": "document.write('<p><strong>MJMC-199 Directed Study (1-2 Credits)</strong><br/></p><p><strong>MJMC-200 Special Topics in Media (4 Credits)</strong><br/>Introduces methods and frameworks for considering the complex interrelationship between media and cultures/society. Topics will vary year to year and will integrate relevant approaches to help build understanding.</p><p><strong>MJMC-215 News Literacy (4 Credits)</strong><br/>(PH) Examines forces that shape news today and how the news media have changed. Prepares students to understand journalism and critically evaluate news sources as well as analyze their own roles as news consumers and communicators using current events as a backdrop. Assignments and discussion focus on topics such as: news values, detecting bias, source credibility, journalistic constraints, and media economics.</p><p><strong>MJMC-225 Strategic Comm in Society (4 Credits)</strong><br/>(PS) Strategic communication (journalism and mass communication-related concepts used in marketing, public relations, social media, crises communication, and advertising for the purpose of influencing behavior) is everywhere, yet if done right the consuming masses hardly notice the machinations. This course helps students identify strategic communication that occurs in their world, discover how it affects them and others, furthers their understanding through collaborative, creative role play, and asks them to consider the ethical implications of this booming profession.</p><p><strong>MJMC-235 Podcasting & Audio Storytelling (4 Credits)</strong><br/>(PA) Podcasting and Audio Storytelling is an immersive, hands-on course that will introduce you to the art and craft of modern audio storytelling. We\\'ll explore the history and concepts behind audio storytelling while introducing genres such as narrative nonfiction, creative storytelling, documentaries, analytical journalism, and professional communication. Then, using free, open-source software, you\\'ll produce engaging podcasts from conception to launch both individually and collaboratively. This is an ideal class for students interested in learning how to make content for the annual 1.3 billion people who use podcasts for entertainment, information, and education.</p><p><strong>MJMC-250 Visualizing Society (4 Credits)</strong><br/>(PA) Introduces a toolkit of conceptual and practical skills in multimedia journalism. Students learn about reporting in contexts that cut across the traditional barriers of online, broadcast, and print news. Students begin to consider journalism\\'s moral and ethical underpinnings and how those considerations interact with everyday professional considerations made by journalists.  PA was approved as of May 13, 2023.</p><p><strong>MJMC-251 Reporting Your World (4 Credits)</strong><br/>Builds upon the skills learned in Visualizing Society, reinforcing journalism production concepts that transcend any single technology system. Students will continue to master reporting, photojournalism, audio and video skills, and further integrate them in more in-depth multimedia projects. Prerequisite: 250 or Permission of Instructor.</p><p><strong>MJMC-299 Directed Study (1-2 Credits)</strong><br/></p><p><strong>MJMC-300TR +mjmc Elective (1-12 Credits)</strong><br/></p><p><strong>MJMC-301 Mass Communication Law (4 Credits)</strong><br/>(PP) Provides an overview of the ethical and legal issues affecting free expression, media and multimedia journalism and prepares students to understand and articulate how these laws apply to our everyday knowledge of how mass media is produced, consumed, and shapes our world. Students will engage at the intersection of what is legal and what feels &quot;right&quot;, and they will consider scenarios in which those two entities are in conflict with one another.</p><p><strong>MJMC-310 Specialized Reporting (2-4 Credits)</strong><br/>Introduces key concepts and conventions behind genre-specific reporting and production. Topics vary each term, but may include sports media, film/television criticism, and data journalism/visualization. Can be repeated.</p><p><strong>MJMC-345 Cultural History of Media (4 Credits)</strong><br/>(PP) The purpose of this course is to &quot;de-naturalize&quot; our understanding of U.S. broadcasting as &quot;the only way it could be&quot; or as &quot;the best way it could be.&quot; Using a historical approach, students examine the ever-changing complexity of media by considering the shifting relationships between institutions, politics, culture, social organization and technology. The course helps students develop critical knowledge as media consumers and (for some) future media producers and to gain the background knowledge necessary for more nuanced inquiry into mediated communication.</p><p><strong>MJMC-350 Contemporary Issues in Media (4 Credits)</strong><br/>This course examines the roles that media play in society, paying particular attention to some of the most controversial issues surrounding media ownership (e.g. globalization and media monopolies) and media content (e.g. indecency and violence). Exploring these issues from both legal and ethical perspectives, students will consider the effects of existing media practices, as well as the potential for industry change.</p><p><strong>MJMC-380 Special Topics in Media (4 Credits)</strong><br/>Building upon a foundational understanding of media, this class uses critical/cultural, sociological, historical, and economic paradigm to investigate the complex interrelationship between media and cultures/society. Topics will vary year to year.</p><p><strong>MJMC-382 Media Theory in Communication (4 Credits)</strong><br/>(PS)The central purpose of this course is to help students develop a sophisticated understanding of &quot;media&quot; and &quot;mass communication,&quot; and particularly how these crucially important human phenomena are theorized and researched by communication scholars from two broad perspectives: social science and critical/cultural studies. During the term, students explore the key highlights of this terrain, engaging significant advances in the history of mass communication and media theory, and especially locating important areas of similarity and difference between theories.</p><p><strong>MJMC-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>MJMC-399 Directed Study (1-2 Credits)</strong><br/>Working with a faculty member, students develop their own curriculum to study either a topic not typically covered within the department or a previously covered concept in greater detail. The student and faculty member consult on readings, a timeline, and assignments. The student will be expected to complete a final project as well as reflect on the process of developing a course. Prerequisite: Permission of Instructor.</p><p><strong>MJMC-400 Independent Study (1-2 Credits)</strong><br/>Original research in an area of particular interest not covered in regular courses. Normally requires weekly meetings with the supervising faculty member and some variety of spoken or written final presentation. Prerequisite: Permission of Instructor.</p><p><strong>MJMC-403 Public Relations (4 Credits)</strong><br/>Reviews current practices and emerging trends in public relations. Considers similarities and differences between working in corporate, nonprofit, and agency settings. Students will create a portfolio-quality public relations plan.</p><p><strong>MJMC-411 Seminar in Media (4 Credits)</strong><br/>In-depth analysis of media topics offered for advanced students. Typically reading and discussion-intensive, with an expectation that students take active roles in the classroom. Seminar topics change from year to year. Can be repeated.  Description for Fall Semester 2021-2022:  Discussion-based class that stimulates in-depth analysis of mass media\\'s representation of diverse groups and its effects on those groups and society.</p><p><strong>MJMC-420 Race, Gender & Media (4 Credits)</strong><br/>(D) The movies we watch, the news we read, the video games we play - all of the media we consume - influence the way we think about our own identities and shape our perceptions of others, especially those who are different from us. This discussion-based class stimulates in-depth analysis of mass media\\'s representation of diverse groups and their effects on those groups and society.  Prerequistie: Declared major in COMM or MJMC or permission of instructor.</p><p><strong>MJMC-450 Senior Inquiry (2 Credits)</strong><br/>Introduces students to reflective practices designed to learn from prior experiences and become more intentional about future actions.</p><p><strong>MJMC-499 Directed Study (1-2 Credits)</strong><br/>Working with a faculty member, students develop their own curriculum to study either a topic not typically covered within the department or a previously covered concept in greater detail. The student and faculty member consult on readings, a timeline, and assignments. The student will be expected to complete a professional-level final project that they can show prospective employers or graduate schools as well as reflect on the process of developing a course. Prerequisite: Permission of Instructor.</p>');",
  "scrape_metadata": {
    "original_title": "Multimedia Journalism and Mass Communication",
    "dept_slug": "multimedia-journalism-and-mass-communication",
    "original_url": "https://augustana.edu/academics/areas-of-study/multimedia-journalism-and-mass-communication",
    "courses_url": "https://augustana.edu/academics/areas-of-study/multimedia-journalism-and-mass-communication/courses",
    "scrape_timestamp": "2025-09-26 19:58:55",
    "status": "success"
  }
}