{
  "program_title": "Music course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/music/courses",
  "faculty": [],
  "requirements": {
    "major_in": "44 credits, including 17 credits in 110, 111, 112/112L, 211/211L, 212/212L; 12 credits in 300, 311, 312; 3 credits in 450, 451; 8 credits in one area of applied vocal or instrumental lessons; and 2 credits in applied piano or 4 credits in class piano. Ensemble requirements: eight terms participation. Non-credit requirements: Improvisation, Recital Attendance, Applied Lesson Level Attainment, and Piano Proficiency. 67 credits, including 17 credits in 110, 111, 112/112L, 211/211L, 212/212L; 12 credits in 300, 311, 312; 6 credits in 225, 320, 330; 4 credits in 360; 1 credit in 490; 3 credits 450, 451; 12 credits in applied composition lessons; 5 credits in one area of applied vocal or instrumental lessons; 1 credit of applied electronic music lessons; and 2 credits in applied piano or 4 credits in class piano;. Ensemble requirements: eight terms participation. Non-credit requirements: Improvisation, Recital Attendance, Applied Lesson Level Attainment, and Piano Proficiency.",
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": "21 credits, including 9 credits in 110, 111, 112/112L; 8 credits from 300, 302, 311, 312, 315, 316 or 317; and 4 credits in one area of applied vocal or instrumental lessons. Ensemble requirements: 4 terms participation. Non-credit requirement: Applied Lesson Level Attainment, Recital Attendance. 21 credits, including 9 credits in 110, 111, 112/112L; 4 credits in 317; 2 credits in 220; and 6 credits in applied jazz improvisation lessons. Ensemble requirements: 4 terms participation in Jazz Ensemble or Jazz Combo. Non-credit requirement: Applied Lesson Level Attainment, Recital Attendance. See Music Department Handbook for specific requirements 26 credits, including 9 credits in 110, 111, 112/112L; 4 credits from 300, 311, 312, 315, 316, or 317; 12 credits in one area of applied vocal or instrumental lessons; 1 credit 490. Ensemble requirements: 4 terms participation. Non-credit requirement: Applied Lesson Level Attainment, Recital Attendance. See Music Department Handbook for specific requirements 25 credits, including 9 credits in 110, 111, 112/112L; 4 credits from 312; 6 credits in 225, 320, 330; and 6 credits in applied composition lessons. Ensemble requirements: 4 terms participation. Non-credit requirement: Applied Lesson Level Attainment, Recital Attendance. Music students who successfully complete the music education degree and meet Illinois State requirements will be recommended for a Professional Educator License endorsed in K-12 music. See Department of Education and the Department of Music Handbook for specific requirements.",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors . Additional fees for lessons above and beyond tuition will be charged according to the lesson fees noted in the Schedule of Student Charges .Students may register for up to four credits of lessons; each credit equals one half-hour of instruction weekly. Students may register for chamber ensembles for 0 or 1 credits. Students may register for ensembles for 0 or 1 credits.",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=musc",
  "courses_html": "document.write('<p><strong>MUSC-080 Musicianship Placement (0 Credits)</strong><br/></p><p><strong>MUSC-101 Introduction to Music (4 Credits)</strong><br/>(PA) Exploration of the fundamental elements, various forms, and styles of music. Through listening, discussion, and live concert experiences, students will learn about music in various cultural and historical contexts. This course is not a part of the music major and no experience in music is required.</p><p><strong>MUSC-103 Class Voice (1 Credits)</strong><br/>Foundational skill building in singing and performing, diction and other vocal concepts.  Fall term permission of instructor required.</p><p><strong>MUSC-104 Music & the Brain (2 Credits)</strong><br/>What makes music so powerful? This course explores the different parts of the brain that are involved when we are listening to music, how different kinds of music affect our bodies and health, the therapeutic uses of music, and how we can strategically incorporate music in our daily lives for positive outcomes. This is a 7-week course.</p><p><strong>MUSC-107 Music in Worldwide Perspective (4 Credits)</strong><br/>(PA,G) Music in Worldwide Perspective. Introduction to ethnomusicology and survey of indigenous music of the various regions of the world. Does not apply to major in music.</p><p><strong>MUSC-108 Electronic Music (4 Credits)</strong><br/>(PA) In this course students will discover electronic music. Using audio software, students will explore sound synthesis, audio manipulation, and audio effects processing. Students will also consider basic compositional and sound design issues as they create original works. The class will also study important composers and pieces from the history of electronic music. The goal of the class is to help students build the foundations for creative engagement with electronic sound that can then be applied to a variety of musical styles. All experience levels are welcome.</p><p><strong>MUSC-110 Music Theory Rudiments (1 Credits)</strong><br/>Basic music theory concepts. Prerequisite: placement exam.</p><p><strong>MUSC-111 Musicianship I (4 Credits)</strong><br/>(PA) An introduction to the study of music and related skills: score-reading, sight singing, text analysis, conducting, composition, research, and writing. Primary focus is given to the development of notated music in Europe and America from the middle ages to the present day, with additional study of popular and non-western music.</p><p><strong>MUSC-112 Musicianship II (4 Credits)</strong><br/>The fundamentals of musical organization, ear training and performance skills through the study of music literature, melodic and harmonic structures and grammar, basic piano skills, singing and aural perception skills, composition, basic conducting, analysis and survey of music literature.</p><p><strong>MUSC-112L Musicianship II Lab (0 Credits)</strong><br/>Aural Skills, taken in conjunction with MUSC-112.</p><p><strong>MUSC-121 Class Piano I (1 Credits)</strong><br/>Beginning piano in a group setting. Prerequisite: piano assessment.</p><p><strong>MUSC-122 Class Piano II (1 Credits)</strong><br/>Beginning piano in a group setting. Prerequisite: piano assessment.</p><p><strong>MUSC-131 Music in Film (4 Credits)</strong><br/>(PA) This class immerses you in the history, people, and creative processes behind the music heard in movies. It traces the path from the not-so-silent era at the birth of film all the way to the high-tech world of making music for today\\'s big-budget blockbusters. The course goes behind the scenes with composers, directors, and musicians to learn about the art and craft of film music. The course includes extensive film viewing and basic analysis of music in film along with basic creative activities in adding music to film. Please note: In this course you may be exposed to films featuring adult themes, language, and visual depictions of nudity, sexual situations, violence including sexual violence, and drug use. </p><p><strong>MUSC-132 Music & Activism (4 Credits)</strong><br/>(PP) What do rock, gospel, country, heavy metal, jazz, hip-hop, rap, alternative, indie and every other possible type of music have in common? Activism. Social Consciousness. Justice. Change. Throughout history popular music and activism have joined forces to support a variety of social and political movements. Music and Activism: The Role of the Protest Song throughout History is an interdisciplinary course that emphasizes the relationships between society, music, songwriters, performers, and listeners. By exploring history through its sonic landscapes, specifically protest songs, this course will trace mainstream and radical responses to key movements in history with special emphasis on the tumultuous social, economic, and political challenges of the 20th century. Through text, audio, and video sources this course will focus on the role that protest songs play in activism, social justice, and change.</p><p><strong>MUSC-133 Video Game Music (4 Credits)</strong><br/>(PA) An introduction to the history and function of musical sound in video games.</p><p><strong>MUSC-134 Wagner\\'s Ring Cycle (4 Credits)</strong><br/>(PP) Wagner\\'s massive tetralogy, Der Ring des Nibelungen stands as one of the greatest artworks ever created in Western society. The breadth and scope of this work is more far reaching than any other work and its influence on past and future generations is undiminished. More than simply a mere work of art, this nineteenth-century epoch stands as testament to the genius of one man and countless others who have delved into its deeper meanings. This course will serve as an introduction to this work and hopefully inspire further exploration into this subject.</p><p><strong>MUSC-150 Rudiments of Improvisation (0 Credits)</strong><br/>Rudiments of Improvisation explores an important facet of music education and performance central to the life of a musician.</p><p><strong>MUSC-180 Special Topics (Arab Music) (4 Credits)</strong><br/>When approved by governance, this course will be a 200-level course in Arab Music, with a PA Learning Perspective and a G suffix.</p><p><strong>MUSC-199 Directed Study (1-2 Credits)</strong><br/></p><p><strong>MUSC-211 Musicianship III (4 Credits)</strong><br/>Continuing fundamentals of musical organization, ear training and performance skills through the study of music literature, melodic and harmonic structures and grammar, basic piano skills, singing and aural perception skills, composition, basic conducting, analysis and survey of music literature</p><p><strong>MUSC-211L Musicianship III Lab (0 Credits)</strong><br/>Aural Skills, taken in conjunction with MUSC-211.</p><p><strong>MUSC-212 Musicianship IV (4 Credits)</strong><br/>Continuing fundamentals of musical organization, ear training and performance skills through the study of music literature, melodic and harmonic structures and grammar, basic piano skills, singing and aural perception skills, composition, basic conducting, analysis and survey of music literature.</p><p><strong>MUSC-212L Musicianship IV Lab (0 Credits)</strong><br/>Aural Skills, taken in conjunction with MUSC-212.</p><p><strong>MUSC-220 Topics in Jazz Styles and Analysis (2 Credits)</strong><br/>Topics in Jazz Styles and Analysis. Advanced study in the harmonic and melodic practices prevalent in jazz music. Investigation of major jazz styles through specific style period transcriptions and harmonic analysis. Prerequisite: successful completion of MUSC 112.</p><p><strong>MUSC-221 Class Piano III (1 Credits)</strong><br/>Beginning piano in a group setting. Prerequisite: piano assessment.</p><p><strong>MUSC-222 Class Piano IV (1 Credits)</strong><br/>Beginning piano in a group setting. Prerequisite: piano assessment.</p><p><strong>MUSC-225 Music Notation (2 Credits)</strong><br/>This course includes an overview of contemporary issues in music notation of works for students and professionals, and training in the use of music notation software. Prerequisite: MUSC 110 or permission of instructor.</p><p><strong>MUSC-231 Deep Listening (4 Credits)</strong><br/>(PH) In this course we will explore sound meditation using the Deep Listening practice developed by composer Pauline Oliveros. We will investigate sound as a technique to transcend the limits of discursive reason, language, and our culture\\'s hyper-visual orientation. The class will also study the ways sound has been used in contemplative disciplines and metaphysical speculations in various cultures. We will also see how some contemporary composers have been influenced by these ideas and how this has influenced their musical techniques and expressive goals. This is an experiential course: students will engage in daily Deep Listening exercises which will include focused listening, simple vocalizations, body movements, and journaling.</p><p><strong>MUSC-232 From Ashes to Immortality (4 Credits)</strong><br/>(PP) During the Holocaust, European fascists attempted to exterminate the Jewish people and their culture. Even before WWII, the Nazis banned so-called Degenerate Art (painting, music, literature) and used the arts as a propaganda tool. But for the Jews, the arts were a connection to their past, sustenance to feed creative hunger, and a salve to soothe spiritual wounds. We will explore the historical origins of anti-Semitism, the Jewish contribution to the arts in central Europe, and how the arts helped save a culture. Ultimately, we\\'ll seek to discover the centrality of the arts in our time and culture.</p><p><strong>MUSC-299 Directed Study (1-2 Credits)</strong><br/></p><p><strong>MUSC-300 World Music (4 Credits)</strong><br/>(PS,G) Advanced study in ethnomusicology, its origins, development, theories, methodologies, concepts, problems and questions.</p><p><strong>MUSC-302 Music of Paris (4 Credits)</strong><br/>(PA) Students will study music written in Paris from the Middle Ages to the early Twentieth Century and its cultural context. In addition students will explore the city of Paris to understand the draw it has had on artists, writers and thinkers. Taught as part of a Study Away Program.</p><p><strong>MUSC-305 Music & Culture of West Africa (4 Credits)</strong><br/>(PH,G) Investigation of musical traditions of various cultural groups in West Africa.</p><p><strong>MUSC-306 Music in Germany (4 Credits)</strong><br/>(PA) A survey of the most important musical figures in Germany. We will examine the culture, politics, and religious aspects of this country and how each played a part in shaping its music. This class will culminate with a trip to Germany and Switzerland where we will see important sites of German musical centers.</p><p><strong>MUSC-306A Music in Germany (2 Credits)</strong><br/>A survey of the most important musical figures in Germany. We will examine the culture, politics, and religious aspects of this country and how each played a part in shaping its music. This class will culminate with a trip to Germany and Switzerland where we will see important sites of German musical centers.</p><p><strong>MUSC-311 Music Styles & Literature I (4 Credits)</strong><br/>(PP) Music Styles and Literature I. Music literature and styles and their place in Western culture, 800 to the 19th Century. Prerequisite: Successful completion of MUSC-112 or permission of instructor.</p><p><strong>MUSC-312 Music Styles & Literature II (4 Credits)</strong><br/>(PP) Music Styles and Literature II. Music literature and styles and their place in Western culture, 19th Century to the present. Pre-requisite: Take MUSC-112 or permission of instructor.</p><p><strong>MUSC-315 Music in American History (4 Credits)</strong><br/>(PA,D) Music in American History. Indigenous American music traditions; their role in American life.</p><p><strong>MUSC-316 African-American Music (4 Credits)</strong><br/>(PA,D) African-American Music. A study of the emphasis on critical examination of African influence and various musical styles, performance practices, aesthetic considerations and social and cultural contexts.</p><p><strong>MUSC-317 Jazz History and Analysis (4 Credits)</strong><br/>(PA,D) Jazz History and Analysis. Study of major jazz periods and styles from 1900 to the present</p><p><strong>MUSC-320 Orchestration (2 Credits)</strong><br/>Intensive study of scoring techniques for instruments and voices, via score study, in-class demonstrations and independent creative projects. Prerequisite: MUSC-112 or consent of instructor</p><p><strong>MUSC-321 Piano Literature (2 Credits)</strong><br/>Survey of piano literature from J.S. Bach to the present. Includes score study, comparison of recorded examples and performance of selected standard works where applicable.</p><p><strong>MUSC-322 Piano Pedagogy (2 Credits)</strong><br/>Principles, methods and materials of individual and group piano instruction. Supervised teaching experience is required of each student.</p><p><strong>MUSC-323 Vocal Diction & Literature (2 Credits)</strong><br/>Basic IPA, English, French, German, and Italian diction and song literature for use in personal singing and teaching.</p><p><strong>MUSC-325 Vocal Pedagogy (2 Credits)</strong><br/>Principles, methods and materials of voice pedagogy. Supervised teaching experience is required of each student.</p><p><strong>MUSC-330 New Music Seminar (2 Credits)</strong><br/>Advanced course in new music. Through intensive examination of a series of works by living composers, students will develop skills for listening to, analyzing, and understanding recent music. Prerequisite: MUSC-212 or consent of instructor.</p><p><strong>MUSC-344 Creative Arts Therapies (4 Credits)</strong><br/>(PH) Topics in this course include foundational understandings of the aging process on individuals and communities, creativity in aging, dementia, grief and loss, how the arts are used and impact this population, and historical foundations of arts and creative therapies. This course has no prerequisites. It is suitable for majors in health professions and related fields.</p><p><strong>MUSC-360 Conducting I (4 Credits)</strong><br/>Beginning conducting techniques for choral, orchestral or wind ensembles</p><p><strong>MUSC-361 Conducting II (4 Credits)</strong><br/>Literature and advanced techniques of conducting for choral, orchestral or wind ensembles.</p><p><strong>MUSC-363 Ped. for Stgs, Ww, Brass, Gtr, Perc (1 Credits)</strong><br/>Pedagogy for Strings, Woodwinds, Brass, Guitar or Percussion. Survey of principles, methods and materials of instrument pedagogy.</p><p><strong>MUSC-364 Lit for Stgs, Ww, Brass, Gtr, Perc (1 Credits)</strong><br/>Literature for Strings, Woodwinds, Brass, Guitar or Percussion. Survey of literature for strings, woodwinds, brass, guitar or percussion. Includes score study and performances of selected works where applicable.</p><p><strong>MUSC-380 Music in Context (4 Credits)</strong><br/>In-depth study of music in the context of cultural history. Includes live concert experience and extensive individual study of critical listening. Prerequisite: completion of MUSC 101 or permission of instructor.</p><p><strong>MUSC-390 Junior Recital (1 Credits)</strong><br/>Preparation and performance of a program of music as specified in The Department of Music Handbook.  </p><p><strong>MUSC-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>MUSC-399 Directed Study (1-2 Credits)</strong><br/></p><p><strong>MUSC-400 Independent Study (1-2 Credits)</strong><br/></p><p><strong>MUSC-450 Senior Inquiry Seminar (2 Credits)</strong><br/>A proposal development seminar. Students engage in the skills and process of inquiry to successfully prepare their Senior Inquiry proposals in Performance, Composition or Research.</p><p><strong>MUSC-451 Senior Inquiry (1 Credits)</strong><br/>Final production of the written element of Senior Inquiry and public presentation of student\\'s work.</p><p><strong>MUSC-480 Seminar: Topics in Music (4 Credits)</strong><br/>Intensive investigation and examination of one particular music problem, genre, composer or period. May also include multicultural or interdisciplinary aspects as they affect the topic studies. The subject as well as the faculty will vary from year to year. Students may then repeat the course if the topic has changed. Prerequisite: MUSC-101, 111 or permission of the instructor.</p><p><strong>MUSC-490 Senior Recital (1 Credits)</strong><br/>Preparation and performance of a program of music.</p><p><strong>MUSC-499 Directed Study (1-2 Credits)</strong><br/></p>');",
  "scrape_metadata": {
    "original_title": "Music",
    "dept_slug": "music",
    "original_url": "https://augustana.edu/academics/areas-of-study/music",
    "courses_url": "https://augustana.edu/academics/areas-of-study/music/courses",
    "scrape_timestamp": "2025-09-26 19:58:57",
    "status": "success"
  }
}