{
  "program_title": "Philosophy course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/philosophy/courses",
  "faculty": [],
  "requirements": {
    "major_in": null,
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": null,
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=phil",
  "courses_html": "document.write('<p><strong>PHIL-100 Critical Reasoning (4 Credits)</strong><br/>Students will study the basic concepts of logic and learn to apply them in both real-world evaluation of arguments and the construction of their own arguments. Basic tools will include: fundamentals of propositional logic and inductive logic, informal fallacies, syllogistic logic, and Venn diagrams. In addition, students will read regular opinion articles written by professional philosophers as exemplars of clearly articulated reasoning on important social issues.</p><p><strong>PHIL-101 Knowing and Being (4 Credits)</strong><br/>(PH)Introduction to central topics in philosophy, such as ethical theory, metaethics, knowledge and skepticism, theology, free will, personal identity, and the nature of meaning. Attention is paid to the careful formation and critical evaluation of arguments.</p><p><strong>PHIL-101TR Transfer Elective (1-12 Credits)</strong><br/></p><p><strong>PHIL-103 Social Ethics (4 Credits)</strong><br/>(PS) An introduction to the philosophical examination of issues in three areas of social ethics-global problems, family matters, and societal policies. The following general questions will be considered in light of three moral theories (utilitarianism, rights, and the ethics of care): What do we owe the poor and starving in other countries? What do we owe our family members? How should we treat criminals in our society?</p><p><strong>PHIL-105 Life and Death (4 Credits)</strong><br/>(PH) An introduction to ethics, approached through an examination of the ethics of living, letting die, and killing. The course will introduce students to major theories of morality, such as utilitarianism and Kantian ethics, and apply these theories to issues that may include euthanasia, abortion, capital punishment, and just war.</p><p><strong>PHIL-110 History of Philosophy (4 Credits)</strong><br/>(PP) An introduction to the main ideas and figures in the tradition of Western Philosophy, from the Ancient Greeks to the present. Emphasis on theories and arguments in the areas of metaphysics, the theory of knowledge, and ethics.</p><p><strong>PHIL-120 Puzzles and Paradoxes (4 Credits)</strong><br/>(PH) An introductory survey of well-known paradoxes that arise in the philosophical study of logic, ethics, theology, metaphysics, epistemology, and decision theory. Also explored are paradoxes from other disciplines, such as psychology, physics, statistics, and economics. Through these paradoxes, the concepts of reason and rationality are examined.</p><p><strong>PHIL-122 Meaning of Life (4 Credits)</strong><br/>(PH) An exploration of philosophical efforts to answer the question posed by Socrates in Plato\\'s Republic: how should one live? We will investigate the roles of happiness, morality, and meaning in a well-lived human life, as well as the significance of death for us mortal creatures. Readings will range from classical thinkers such as Plato and Epicurus, to recent work by philosophers such as Robert Nozick and Susan Wolf.</p><p><strong>PHIL-124 Kinds of Minds (4 Credits)</strong><br/>(PH) This course surveys recent developments in the philosophy of animal minds. Students will be introduced to the basic methods of philosophy through an investigation of non-human animal mental lives. Topics will include animal consciousness, pain, reasoning, language, and sociality. Many of these topics will connect to broader questions about animal rights and reflections about human nature.</p><p><strong>PHIL-200 History of Great Ideas (4 Credits)</strong><br/>(PP) An introductory overview of the development of key philosophical ideas from the pre-Socratics to the present. Students will be exposed to major traditions and current trends in philosophy, and will be able to make connections with ideas in other disciplines such as the sciences, social sciences, arts, and humanities.</p><p><strong>PHIL-201 Classical Philosophy (4 Credits)</strong><br/>(PP) Study of the beginnings of philosophical thought in Classical Greece, with particular attention to the fragments of the pre-Socratics, the dialogues of Plato, and the treatises of Aristotle. Topics will include early physics and metaphysics, theories of knowledge, human nature, happiness and virtue ethics.</p><p><strong>PHIL-203 Modern Philosophy (4 Credits)</strong><br/>(PP) Studies in the Rationalist philosophical tradition of Descartes, Spinoza, Leibniz and the Empiricist tradition of Locke, Berkeley, Hume. Topics will include perception, knowledge and skepticism, mind and matter, the nature and existence of God, the character of reality.</p><p><strong>PHIL-300 Formal Logic (4 Credits)</strong><br/>(Q) Techniques of translation, proof, and analysis from ordinary language to sentential logic and first-order predicate logic with identity and functions. Additional topics may include modal logic, Peano arithmetic, and metalogic. For students of philosophy, mathematics, linguistics, law, and the sciences, but recommended for anyone interested in exactness of thought</p><p><strong>PHIL-301 Decision & Game Theory (4 Credits)</strong><br/>(PS,Q)This introduction to decision theory and game theory explores the nature of probability and utility and their use in decision-making. We examine puzzle cases where different approaches to decision-making yield different results, and the difference (if any) between decisions, where only one agent acts, and games, where the result depends on decisions by multiple agents. Applications to psychology, evolutionary biology, ethics, business, and political science are explored.</p><p><strong>PHIL-303 Metaphysics & Epistemology (4 Credits)</strong><br/>(PH) This course will survey some of the major theories and approaches in metaphysics and epistemology. Topics in metaphysics may include puzzles about material constitution, composition and identity, modality, general ontology. Topics in epistemology may include attempts to provide an analysis of the concept of knowledge, theories of justification, conceivability and possibility, a priori knowledge, and testimony.</p><p><strong>PHIL-305 Philosophy of Science (4 Credits)</strong><br/>(PP) Study of key episodes in the history of science, with a focus on philosophical issues. Primary source readings from scientists and philosophers from ancient Greece through the scientific revolution and up to the twentieth century. Concepts explored include methodology, the nature of scientific explanation, confirmation and falsification, empiricism, and scientific realism.</p><p><strong>PHIL-310 Philosophy of Mind (4 Credits)</strong><br/>(PH) Questions involving the nature of consciousness serve as the primary focus for this course. Key areas of examination will include the mind-body problem, the nature of mental representation, the nature of human subjectivity, and select issues in neurophilosophy.</p><p><strong>PHIL-312 Philosophy of Medicine (4 Credits)</strong><br/>(PH)An examination of the underlying metaphysical, epistemological, and ethical dimensions of the practice of medicine. Key issues of investigation will include concepts of health, goals of care, and trends toward population-based medicine.</p><p><strong>PHIL-314 Philosophy of Language (4 Credits)</strong><br/>(PH) Exploration of theories of language and its relation to the mind and the world. Topics will include meaning and reference, logic and necessity, propositional attitudes, communication and intention. Readings will be from such foundational figures as Frege, Russell, Wittgenstein, and later thinkers.</p><p><strong>PHIL-316 Philosophy of Religion (4 Credits)</strong><br/>(PH)Philosophical study of religious questions concerning the existence and nature of God, reason and faith, and the relation of divine commands and morality. Readings will be from such thinkers as Aquinas, Hume, and William James.</p><p><strong>PHIL-318 Philosophy of Art (4 Credits)</strong><br/>(PA) An examination of classical and contemporary theories of art and aesthetics, focusing on artistic creativity, the nature of art, and the reception of and response to works of art. Readings from Plato, Aristotle, Tolstoy, Collingwood. Examples from literature, painting, music, and film.</p><p><strong>PHIL-320 Moral Philosophy (4 Credits)</strong><br/>(PH) A detailed investigation of major philosophical theories in ethics and metaethics, rooted in a close study of primary texts. Topics will include consequentialist, Kantian, and virtue-based theories of ethics, as well as metaethical topics such as the debates between moral objectivism and skepticism. Readings will draw from authors such as Plato, Aristotle, Bentham, Kant, Mill, and Hume.</p><p><strong>PHIL-322 Political Philosophy (4 Credits)</strong><br/>(PH) A careful study of prominent philosophical investigations into the nature of a just society, rooted in a close reading of primary texts. Issues include the sources of legitimate political authority, the just distribution of economic goods, and the sources of, and limits to, individual rights. We will consider theoretical approaches including perfectionism, contractarianism, utilitarianism, and Marxism, and read texts by figures such as Plato, Hobbes, Locke, Mill, and Marx.</p><p><strong>PHIL-324 Philosophy of Law (4 Credits)</strong><br/>(PS) An introduction to, and careful study of, philosophical issues surrounding the nature of law. These issues include the nature of law itself (that is, what makes a law legitimate, and the disputes between natural lawyers and legal positivists on this issue), the nature and sources of rights, the source and extent of our moral obligation to obey the law (and if such an obligation exists), and judicial approaches to interpreting the law. Texts will be drawn from authors such as Aquinas, Austin, Hart, Dworkin, and Rawls.</p><p><strong>PHIL-330 Applied Ethics (4 Credits)</strong><br/>(PH) This course will center on a specific theme each term, as determined by the instructor. For example, themes might include ethics and information technology or bioethics. Specific topics within ethics and information technology might include privacy and data aggregation, the ethics of artificial intelligence, and the ethical dimensions of social media. The course may be repeated if the topic has substantially changed.</p><p><strong>PHIL-340 Enlightenment Philosophy (4 Credits)</strong><br/>(PP) Readings in the primary works of such major Enlightenment thinkers as Hume and Kant. Topics will be drawn from metaphysics, epistemology, ethics, and aesthetics.</p><p><strong>PHIL-342 Phenomenology & Existentialism (4 Credits)</strong><br/>(PH) A study of works from Continental thinkers such as Kierkegaard, Husserl, Heidegger, Sartre, and Camus. Central topics will include a study of the human condition and its ramifications on issues such as freedom, authenticity, and death.</p><p><strong>PHIL-360 Topics in Philosophy (2 Credits)</strong><br/>This course will focus on a particular theme each term, as determined by instructor and student interest. The course will be of primary interest to philosophy majors and minors who would like to explore a given topic in greater detail or link a topic more directly to a secondary major. The course may be repeated for credit if the topic has substantially changed.</p><p><strong>PHIL-399 Directed Study (1-2 Credits)</strong><br/>A close and critical study of a substantial philosophical text or group of texts under the guidance of a member of the philosophy faculty.</p><p><strong>PHIL-400 Independent Study (1-2 Credits)</strong><br/>Study of philosophical issues of major importance, selected by the student, done by arrangement with and under the direction of a member of the philosophy faculty.</p><p><strong>PHIL-440 Advanced Seminar (4 Credits)</strong><br/>An intensive investigation of a major philosopher or a specific problem in philosophy. The subject will vary from year to year, and students may repeat the course if the content has changed substantially.</p><p><strong>PHIL-450 Senior Thesis (2 Credits)</strong><br/>A two-term sequence Under the direction of a member of the philosophy faculty, the student researches and writes a substantial thesis, to be submitted and defended in the ensuing term. Student must have senior status. Strongly recommended for students intending to pursue graduate studies in philosophy or related fields. This course satisfies the Senior Inquiry requirement.</p><p><strong>PHIL-460 Senior Inquiry (1 Credits)</strong><br/>A revision and preparation of the philosophy senior essay, for submission to the philosophy department and presentation at the Spring Celebration of Learning.</p><p><strong>PHIL-499 Directed Study (1-2 Credits)</strong><br/>A close and critical study of a substantial philosophical text or group of texts under the guidance of a member of the philosophy faculty.</p>');",
  "scrape_metadata": {
    "original_title": "Philosophy",
    "dept_slug": "philosophy",
    "original_url": "https://augustana.edu/academics/areas-of-study/philosophy",
    "courses_url": "https://augustana.edu/academics/areas-of-study/philosophy/courses",
    "scrape_timestamp": "2025-09-26 19:59:12",
    "status": "success"
  }
}