{
  "program_title": "Political Science course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/political-science/courses",
  "faculty": [],
  "requirements": {
    "major_in": null,
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": null,
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=pols",
  "courses_html": "document.write('<p><strong>POLS-101 Intro to American Politics (4 Credits)</strong><br/>(PS) A study of constitutional principles and their implementation to create a functioning national government. Development of basic institutions--presidency, Congress, courts, bureaucracy. Analysis of Political Behavior -- political parties, campaigns, and interest groups. Examples from public policy are used to show the institutions and groups in action.</p><p><strong>POLS-101AP AP American Govt (4 Credits)</strong><br/></p><p><strong>POLS-103 Global Perspectives (4 Credits)</strong><br/>(PS,G) Examination of major issues of world politics from various theoretical and country perspectives. Considers issues -war and peace, international law and organization, economic globalization, climate change, nuclear weapon proliferation and human rights- which pose questions of justice or represent threats to the peace or to global survival.</p><p><strong>POLS-105 Democracy Across Countries (4 Credits)</strong><br/>(PS,G) This course explores the degree and quality of democracy in countries around the world. The course involves the comparative examination of important concepts in political science connected to democracy (culture, forms of government, regime types, poverty, identity, among others) and their application to both Western and non-Western nations.</p><p><strong>POLS-107 Contemporary Political Ideas (4 Credits)</strong><br/>(PH,D) Politics is ultimately the struggle over ideas. This course aims to pay close attention to this struggle by seeking to understand how these ideas (from classic liberalism to neoliberalism, conservatism, socialism, feminism, etc.) have influenced how we are living our social, political, cultural and economic lives today. This course will ask the following questions: How have our interpretations of liberalism shifted overtime? What does it mean to conserve politically, culturally, or economically? What is the proper balance between freedom, equality, and democracy? How do we see these ideas playing out in the politics of our day? The course focuses on primary texts from a variety of political traditions in an attempt to answer these questions.  D suffix approved as of November 1, 2019.</p><p><strong>POLS-199 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and instructor.</p><p><strong>POLS-203 Identity in American Politics (4 Credits)</strong><br/>(PS,D)  The evolution of governmental institutions, political socialization, and political processes in the United States are all rooted in a wide variety of issues related to identity. The United States has a system rooted in exclusion with a long history of incremental progress, despite resistance, for increased inclusion. Through analyses of the various intersections of identities such as race, gender, ethnicity, sexuality, and others in American society, a deeper understanding of political movements and policy outcomes can be developed.</p><p><strong>POLS-244TR Politics in Arab World Transfe (3-4 Credits)</strong><br/></p><p><strong>POLS-260 The Legal System (4 Credits)</strong><br/>(PS) A survey of American legal institutions in relation to their social and political context. We analyze the behavior of lawyers, police officers, judges, and juries. The course considers political issues and basic terminology related to civil and criminal law. We explore the impact of law on society and the way that social forces shape the legal system.</p><p><strong>POLS-299 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and instructor.</p><p><strong>POLS-317 International Law & Organization (4 Credits)</strong><br/>Examination of basic principles of international law and attempts to create international political institutions such as the United Nations and European Union. Special emphasis on the World Trade Organization and international trade laws but with case studies drawn from a wide range of regional and transnational organizations.</p><p><strong>POLS-318 China in World Affairs (4 Credits)</strong><br/>(PS,G) In-depth examination of China\\'s changing role in the world and its relations with key countries and regions, in particular the United States. Emphasis on the various determinants of China\\'s foreign policy, such as its history, culture, and the structure of its domestic decision-making system.  Foreign Study Only.</p><p><strong>POLS-320 American Foreign Policy (4 Credits)</strong><br/>This course is designed to acquaint students with the basics of the process of American foreign policy-making. Foreign policy decisions are the product of a historical context, a complex bureaucratic process, and an intertwined domestic and international political and economic environment. We will examine these components with a dozen contemporary cases of U.S. foreign policy-making. By the end of this class, students are expected to be equipped with the knowledge and skills to interpret, evaluate, and criticize past and present U.S. foreign policy decisions and process.</p><p><strong>POLS-325 Public Policy Process (4 Credits)</strong><br/>A survey of the policy making process, including the legislative and administrative phases. Considers how policy ideas are developed, enacted into law, and implemented. Focus on domestic policy in the United States.</p><p><strong>POLS-326 Environmental Policy (4 Credits)</strong><br/>(PS) An analysis of how political institutions, interests and ideologies shape environmental policy. Examples from major areas of environmental concern, such as air pollution, water quality, management of public lands, and global climate change are used to illustrate how political institutions and movements cope with local, regional and global threats to the environment. International as well domestic environmental politics are explored.</p><p><strong>POLS-330 American Political Participation (4 Credits)</strong><br/>An intensive study of various means and mechanisms of participation in the American political system with special focus on grassroots movements, interest groups, political parties, voting, and campaigns. The importance of public opinion, electioneering, campaigning and mass political behavior in the American political process will be examined while taking issues of gender, race, social class and other elements of identity in the American electorate into account.</p><p><strong>POLS-334 Race Wealth & Inequality (4 Credits)</strong><br/>(PS, D) An intensive survey and investigation of the impacts of race, wealth and inequality on American politics and public policy, specifically the ways in which the racial wealth gap impacts politics and public policy. Public policies and political actions that serve as the roots of the disparities along racial lines will be explored. Social and political factors that perpetuate the racial economic and political inequalities will also be examined.</p><p><strong>POLS-335 Gender & Sexuality in Amer Pol (4 Credits)</strong><br/>(PS,D)Historical and theoretical dimensions of the roles of gender and sexuality American politics with special focus on the intersections of gender, race, sexuality and social class. Analysis of U.S. women\\'s movements, perspectives on gender difference, women as candidates and in elected office, and the gendered character of public policy. Particular attention will be paid to issues of citizenship, representation, equality and differences of experiences and identities.</p><p><strong>POLS-338 The American Presidency (4 Credits)</strong><br/>An intensive study of the institution of the American presidency with special emphasis on the historical evolution of the office of the president, theories of presidential power, presidential campaigns, the permanent campaign, governing, the growth of the modern presidency, and other current issues of the presidency. The prominence of the presidency among the three branches of government in the modern context will be explored and unpacked to help students develop their discernment in processing political news pertaining to the presidency.</p><p><strong>POLS-344 Politics in the Arab World (4 Credits)</strong><br/>(PH,G) This course explores the political dynamics of the Arab world, with particular attention to the legacies of the Arab Spring and its long-term impact on governance, civil society, and regional politics. Topics include the historical roots of authoritarianism, the role of Islam in political life, and the evolving challenges and opportunities facing countries in the region today. The course also examines regional and international responses to ongoing political, social, and economic transformations.</p><p><strong>POLS-346 Politics in Latin America (4 Credits)</strong><br/>(PS,G) Study of politics and political change in Latin America, focusing on contemporary issues of democratization, political culture, social movements, and grassroots mobilization. Attention is paid to historical and cultural aspects of these issues and how they affect political institutions and behavior. Although country case studies are used, the course is organized in a thematic manner, emphasizing these issues in Latin American politics and comparing how different countries have addressed them. A significant focus of the course is on recent developments that have endangered the quality of democracy in the region.</p><p><strong>POLS-348 Politics in Brazil (4 Credits)</strong><br/>(PS, G) This course explores the lived experience of the African diaspora in Brazil from a multidisciplinary perspective. The course focuses on the particular configuration of race relations in the state of Bahia and the formation of Afro-Brazilian identity and its cultural, political, economic and social manifestations from a variety of historical and contemporary perspectives, with a special emphasis on the period since the reinstallation of democracy in 1985.  </p><p><strong>POLS-351 Foundations of Liberal Democracy (4 Credits)</strong><br/>(PH) The emergence of and debate over liberal democracy in modern political thought. Consideration of thinkers and texts (Hobbes, Locke, Rousseau, Mill, and others) that are important in the development of liberal democracy.</p><p><strong>POLS-352 Capitalism & Modernity (4 Credits)</strong><br/>(PH,D) Surveys theoretical approaches to &quot;modern&quot; societies, their relationship to capitalism, and the challenges of globalization in the post-cold war world. Classic texts from Marx and Weber are used to structure an approach to contemporary theorists.  &quot;D&quot; suffix was approved on 02/17/2020.</p><p><strong>POLS-353 Democracy & Mass Politics (4 Credits)</strong><br/>(PH) Examines the tensions that emerge between individuals and communities in 20th-century democracies. Classic democratic theory is used to structure readings and discussions from contemporary theorists, covering issues including citizenship, civil societies, rights claims and the emergence of new claims on democratic states.</p><p><strong>POLS-361 Constitutional Law I (4 Credits)</strong><br/>(PS) An analysis of judicial interpretation of the Constitution. Cases examined will cover issues such as freedom of speech and press, separation of church and state, due process of law, and federalism. Emphasis is placed on the evolution of legal doctrine in response to political forces. </p><p><strong>POLS-362 Constitutional Law II (4 Credits)</strong><br/>(PP,D)  A survey of the debate over equality in the development of American constitutional law, with particular emphasis on issues of racial equality. Court decisions and other documents from the founding period to the present are analyzed in relation to their political and social context. Debates over the interpretation of major civil rights statutes, such as the 1964 Civil Rights Act and Title IX, are also analyzed.</p><p><strong>POLS-364 Topics in Law & Politics (2 Credits)</strong><br/>This new course will be a vehicle for further study for students with an interest in political science or pre-law. Possible topics could include civil rights (based our current trimester course), environmental law, or criminal justice. This two credit course should be accessible for non-majors with an interest in law.</p><p><strong>POLS-380 Special Topics in Political Science (4 Credits)</strong><br/>Special Topics in Political Science. Intensive study of a particular aspect of the discipline of political science. Topics will draw on new developments in political science related to contemporary events and/or the research and teaching expertise of the instructor. May be repeated up to 8 credits.</p><p><strong>POLS-380A Special Topics in Political Science (2 Credits)</strong><br/>Intensive study of a particular aspect of the discipline of political science. Topics will draw on new developments in political science related to contemporary events and/or the research and teaching expertise of the instructor. May be repeated up to 4 credits.</p><p><strong>POLS-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>POLS-399 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and instructor.</p><p><strong>POLS-400 Independent Study (1-2 Credits)</strong><br/></p><p><strong>POLS-410 Senior Inquiry (2 Credits)</strong><br/>This course guides students through completing a 20-30 page capstone research paper in political science. It includes peer reviews, drafts, individual conferences, and a final presentation, culminating in a reflection essay on the research experience and disciplinary learning.</p><p><strong>POLS-450 Senior Thesis (4 Credits)</strong><br/>Under the direction of a member of the political science faculty, a student researches and writes a substantial thesis, to be submitted and defended in the ensuing term. This course serves as a Senior Inquiry experience by permission of the instructor only.</p><p><strong>POLS-499 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and instructor.</p><p><strong>POLS-INTR Political Science Internship (0-12 Credits)</strong><br/>POLS-INTR (0-12 Credits) Departmental internships must be approved by the department. A maximum of 4 credits may be applied toward the major or minor.</p>');",
  "scrape_metadata": {
    "original_title": "Political Science",
    "dept_slug": "political-science",
    "original_url": "https://augustana.edu/academics/areas-of-study/political-science",
    "courses_url": "https://augustana.edu/academics/areas-of-study/political-science/courses",
    "scrape_timestamp": "2025-09-26 19:59:17",
    "status": "success"
  }
}