{
  "program_title": "Psychology course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/psychology/courses",
  "faculty": [],
  "requirements": {
    "major_in": null,
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": null,
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=psyc",
  "courses_html": "document.write('<p><strong>PSYC-100 Introduction to Psychology (4 Credits)</strong><br/>(PS) A survey course of the major areas of interest within the field of Psychology (physiological, cognitive, clinical, and social), including fundamental principles and theories about human behavior as well as the scientific methods used by psychologists to draw these conclusions.</p><p><strong>PSYC-130 Survivor Advocacy (2 Credits)</strong><br/>This course is taught by staff from Family Resources Survivor Services and focuses on the dynamics and impact of domestic and sexual violence. Students will learn appropriate ways of supporting survivors in both acute and long-term interactions and receive the training and experience necessary to become a Survivor Advocate for Domestic Violence and Sexual Assault in Illinois and Iowa. Students will also complete 20 hours of volunteer work with Family Resources Survivor Services that may include work in the violent crimes shelter, staffing the crisis line, and serving as an advocate for a survivor at the hospital. This class will help students to grow in their ability to lead on campus and in the community through engaging in advocacy related to domestic and sexual violence. Students will relate to others who are different from themselves through the class and community engagement. Finally, students will be asked to respond to the societal crisis of domestic and sexual violence and work towards change.</p><p><strong>PSYC-180 Psyc of Activism (2-4 Credits)</strong><br/>This course will examine the principles of liberation psychology, a discipline that uses psychological approaches to understand oppression among individuals and groups and encourages empowerment, healing, and transformation. Throughout the course, we will partner to define activism, identify psychological factors that influence activism, and contextualize individual acts with larger social movements. In addition to engaging with selected readings, videos, and podcasts, we will speak with local community activists from multiple fields (e.g., art, music, youth development) about their experiences.</p><p><strong>PSYC-180F Joy of Sacks (2 Credits)</strong><br/>The neurologist Oliver Sacks had an insatiable curiosity, intellectually and otherwise, which he combined with a deep compassion for others and a desire to converse with them. In this course we will explore a number of his works in order to gain a new appreciation of who we are. Although the material might be especially appealing to students with interests in psychology, neuroscience, medicine, biology, and philosophy, anyone who has ever wondered about themselves and others is welcome to join.  No prerequisites.</p><p><strong>PSYC-180J Pysc of Activism (2-4 Credits)</strong><br/>This course will examine the principles of liberation psychology, a discipline that uses psychological approaches to understand oppression among individuals and groups and encourages empowerment, healing, and transformation. Throughout the course, we will partner to define activism, identify psychological factors that influence activism, and contextualize individual acts with larger social movements. In addition to engaging with selected readings, videos, and podcasts, we will speak with local community activists from multiple fields (e.g., art, music, youth development) about their experiences.  No prerequisties.</p><p><strong>PSYC-181 Tales of Brain Injury (4 Credits)</strong><br/>In this J-term course, we will explore stories of clinical neuroscience cases to understand the fascinating, unexpected, and sometimes devastating impact that injury and neurological diseases can have on the brain. Through readings, films, and podcasts, we will learn what happens when the brain is injured and the impact injuries can have on aspects of the visual system, memory, and emotion. No prerequisites.</p><p><strong>PSYC-182 Close Relationships (4 Credits)</strong><br/>The primary goal of this J-Term course is to familiarize students with basic psychological theory and research in the field of interpersonal relationships with a focus on close relationships between friends and romantic partners. Students will be challenged to critically think about and apply this research to the world around them. Specific topics will include attraction, relationship cognitions, love and intimacy, and relationship conflict. No prerequisites.</p><p><strong>PSYC-199 Directed Study (1 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and instructor.</p><p><strong>PSYC-200 Intro to Neuroscience (4 Credits)</strong><br/>Students will learn about the operations of the nervous system related to topics like movement, sensation and perception, learning and memory, emotions, decision making, and cognitive and social behaviors including language and consciousness. These topics will be explored at multiple levels of analysis (e.g., cellular, systems, and behavioral) and with reference to a variety of neuroscientific methods.  This is a required introductory course for Neuroscience majors and an elective for Psychology majors. Psychology majors are expected to take PSYC-100 prior to taking this course.</p><p><strong>PSYC-216 Human Development (4 Credits)</strong><br/>This course examines how biological, cognitive, social, and cultural factors shape development from conception through death. Students will analyze prominent concepts, theories, and methods to understand how earlier factors impact development later in life. Prerequisites: PSYC-100.</p><p><strong>PSYC-218 Psychology of Play (4 Credits)</strong><br/>The father of modern developmental psychology, Jean Piaget, once said, &quot;Play is the work of childhood.&quot; To better understand this work, this course will examine the psychology of play by addressing how play impacts the neurobiological, physical, cognitive, and socio-emotional development of children. Topics include who plays, what play is, when play occurs, where play is found, and why play is important. Throughout the term, students will gain a foundational understanding of play and child development, improve their ability to critically read and present empirical journal articles, and work to integrate information from different psychological domains through the lens of play.</p><p><strong>PSYC-222 Motivation & Emotion (4 Credits)</strong><br/>Evolutionary biology explains species\\' adaptations to their environment. Motivation and Emotion studies how these biological adaptations motivate individual members of the species, and provide the ability for individuals to make behavioral adaptations during the lifespan. Thus, the course can take on any basic need like hunger and examine the biological, experiential, cognitive, and sociocultural variables that initiate, sustain, and cease specific behaviors. Once students develop an understanding of the mechanisms for each topic (e.g., bonding, altruism, achievement), we are able to address societal problems and make research-based arguments about how we can support healthy psychological functioning.  Prerequisites: PSYC-100.</p><p><strong>PSYC-224 Psychological Disorders (4 Credits)</strong><br/>This course will focus on the most significant psychological disorders throughout the lifespan. Students understand the etiology, development, impact, assessment, and treatment of psychological disorders. We will discuss how biological, socio-cultural, cognitive, and developmental processes contribute to and are shaped by these disorders. Students will be introduced to empirically supported treatment approaches for these disorders. Prerequisites: PSYC-100.</p><p><strong>PSYC-226 Human Sexuality (4 Credits)</strong><br/>This course will examine the neurobiological, cognitive, social, historical, cultural, and evolutionary aspects and explanations of human sexuality. Topics such as hormones, reproduction, sexual orientation, attractiveness, and cross-cultural differences in attitudes and practices related to sexuality will be covered. Prerequisite: PSYC-100.</p><p><strong>PSYC-228 Psychology of Prejudice (4 Credits)</strong><br/>(D) An introduction to the social, historical, cognitive, motivational, neurological, and evolutionary aspects and explanations of stereotyping and prejudice. This course will examine why prejudice exists, why it persists, how it influences intergroup relations, how it impacts the targets of discrimination, and how it can be reduced. Prerequisites: PSYC-100.</p><p><strong>PSYC-240 Statistics (4 Credits)</strong><br/>(Q) Students learn to use statistical procedures to describe patterns and trends in data and to answer research questions. Basic proficiency in using statistical software is developed. Credit may not be earned for more than one of PSYC-240, BUSN-211, MATH-130, or SOAN-227. Permission of instructor. Note: students cannot register for this course directly. Do not submit an enrollment petition on your own. Placements are coordinated by the PSYC/NSCI advisor or, for students outside of this department, our administrative assistant, karameyer@augustana.edu. After placement has been confirmed, the course will appear on your course plan.</p><p><strong>PSYC-240S Statistics (4 Credits)</strong><br/>(Q) Students learn to use statistical procedures to describe patterns and trends in data and to answer research questions. Basic proficiency in using statistical software is developed. Credit may not be earned for more than one of PSYC-240, BUSN-211, MATH-130, or SOAN-227.</p><p><strong>PSYC-246 Research Methods (4 Credits)</strong><br/>An introduction to the basic logic and design of psychological research. Students will learn how to understand, evaluate, and use scientific methods to gather knowledge in the field of psychology. They will also learn how to read research articles and effectively write using APA style. Prerequisites: PSYC-100 (or PSYC-200 for NSCI majors) and PSYC-240. Permission of instructor.  Note: students cannot register for this course directly.  Do not submit an enrollment petition on your own.  Placements are coordinated by the PSYC/NSCI advisor.  After placement has been confirmed, the course will appear on your course plan.</p><p><strong>PSYC-280 Special Topics (2-4 Credits)</strong><br/>Consideration of topics of special interest to student and instructor. The topics may vary each year. Prerequisite: PSYC-100.</p><p><strong>PSYC-300 Professional Development (2 Credits)</strong><br/>Using insights from the discipline, students will explore their personal and professional values, interests, and competencies, and consider the way these intersect as they consider future plans. The course includes significant self-reflection and a consideration of the scientific understanding of self-knowledge (motivation, awareness, regulation, etc.) in psychology, promoting an awareness of and concern for others, and the ability to interact effectively with people of diverse backgrounds. Prerequisites: PSYC-100. Must be declared Psychology major, preferably in the junior year, or have permission of instructor.</p><p><strong>PSYC-322 Personality Psychology (4 Credits)</strong><br/>Students will learn the process by which psychologists identify and measure personality traits, including the necessary methods and statistical procedures. We will discuss the major traits that comprise much of human personality and the implications of those traits for important health, occupational, and relationship outcomes. Prerequisites: PSYC-246.</p><p><strong>PSYC-342 Cognition (4 Credits)</strong><br/>Students will examine major cognitive functions (memory, perception, language, imagination, and reasoning) with an interdisciplinary approach ranging from neuroscience to philosophy. This course also demonstrates how scientists develop this knowledge through laboratory experimentation on behavior, but also through neuropsychology, AI simulations, and other methodological approaches. Additionally, the course spends time on applications in fields such as medicine, education, and law. Prerequisites: PSYC-246.</p><p><strong>PSYC-343 Sensation & Perception (4 Credits)</strong><br/>This course explores how we relate to and engage with the world around us using our senses. Although considerable attention will be given to the experiences of humans, student understanding will also be enhanced through descriptions of relevant animal models. In addition to learning about our understanding of sensation and perception, students will come to appreciate the diverse ways in which these understandings have been achieved by focusing on the methods and practices of the field. Students will work with existing datasets to refine their skills with analysis, interpretation, and communication of scientific data. Prerequisites: PSYC-246.</p><p><strong>PSYC-346 Advanced Development (4 Credits)</strong><br/>This course focuses on social and/or cognitive development throughout the lifespan with special attention placed on developmental changes that occur in childhood. Emphasis is placed on understanding how researchers go about asking and answering developmental questions, and students will engage in the full process of research (design, data collection, analysis, and write-up). Prerequisites: PSYC-246. Students who have previously completed PSYC380 - Cognitive Development (4 cr) are not allowed to take this course.</p><p><strong>PSYC-347 Learning (4 Credits)</strong><br/>In this course students will re-examine and further explore the principles by which an organism\\'s behavior changes as a result of experience, primarily the unconscious forms of learning that impact our behavior every day. The course focuses on the research that has led to our understanding of these phenomena and the application of these learning principles to intentional modification of human behavior, including their use in psychotherapy and Applied Behavior Analysis. Students develop skills that are critical to performing, understanding, and communicating about research in Psychology through hands-on experiments and analysis of pre-existing data sets.  Prerequisites: PSYC-246.</p><p><strong>PSYC-349 Advanced Seminar in Neuroscience (4 Credits)</strong><br/>This upper-division seminar is focused on reading and discussing primary literature in neuroscience. Students will develop a literature review and grant proposal to investigate a novel hypothesis related to a topic of their interest. Required of Neuroscience majors and elective for others with the prerequisites. Prerequisites: PSYC-200, PSYC-246. NSCI students are encouraged to take this course during the junior year.</p><p><strong>PSYC-350 Social Psychology (4 Credits)</strong><br/>In this course, students will learn about the scientific study of the way individuals think about, feel about, and act toward other people. We will emphasize the use of scientific method to address these topics, and to that end students will be expected to read primary research articles, and to conduct research projects in small groups over the course of the term. Topics will include aggression, conformity, altruism, stereotyping and relationships. Prerequisites: PSYC-246.</p><p><strong>PSYC-352 Methods in Neuroscience (4 Credits)</strong><br/>Introduction to some of the primary methods used in neuroscience, from cellular/molecular methods to systems/behavioral neuroscience. Students will gain hands-on experience with select methods, including data collection, analysis, and interpretation. This course will be offered in J-term only. Required of Neuroscience majors and elective for others with the prerequisites. Prerequisites: PSYC-200, PSYC-246. NSCI students are encouraged to take this course during the junior year.</p><p><strong>PSYC-380 Social Neuroscience (4 Credits)</strong><br/>As part of the Neurophilosophy in Vienna study away program, we will explore topics in social and cognitive neuroscience. We will consider the possibility that the management of social relationships-real and imagined, immediate and remote, positive and negative-is not only one of the most important tasks our brain performs, but one of its most challenging. Course will be taken in conjunction with one in Philosophy and is restricted to students registered for the associated study away program.   Prerequisites: Permission of instructor.</p><p><strong>PSYC-382 Supervised Research (0-2 Credits)</strong><br/>Students will work in small teams to conduct research with faculty supervision. Students will engage with primary literature, discuss ethical situations in research, collect and analyze data, and communicate their findings via oral and poster presentations. May be repeated for credit, maximum of 6 credits, only 4 credits total of experiential learning (PSYC 382, PSYC 490, PSYC 385, internships) may count towards the PSYC major. (Credit-no credit only.) Cannot fulfill 300-level elective requirement. Prerequisites: Permission of instructor.</p><p><strong>PSYC-385 Research Practicum (0-2 Credits)</strong><br/>Students will work directly with faculty on faculty supervised research projects. The faculty member and student will create an agreed upon plan for the type of research and outcomes of the project. This course does not count towards faculty teaching load. May be repeated for credit, maximum of 6 credits, only 4 credits total of experiential learning (PSYC 382, PSYC 490, PSYC 385, internships) may count towards the PSYC major. (Credit-no credit only.) Cannot fulfill 300-level elective requirement.  Prerequisites: Permission of instructor.</p><p><strong>PSYC-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>PSYC-399 Directed Study (1-2 Credits)</strong><br/>Prerequisites: 100 and permission of Department Chair and Instructor.</p><p><strong>PSYC-400 Independent Study (1-2 Credits)</strong><br/></p><p><strong>PSYC-400TR Psychology Elective (1-12 Credits)</strong><br/></p><p><strong>PSYC-405 Risk & Resilience (2 Credits)</strong><br/>The purpose of this class is to develop a deeper understanding of how the context of children\\'s lives influences their development by studying how it occurs within developing countries. Such study will enable us to better understand our own contexts as well as to respect and appreciate cultural differences. The class prepares students for a study abroad experience during J-Term to Guatemala and is open only to students involved in the Guatemala Study Abroad Program. Prerequisites: PSYC-100 or permission of instructor. Minimum of junior standing.</p><p><strong>PSYC-406 Childhood in Guatemala (4 Credits)</strong><br/>(G) This class examines psychological development, particularly factors impacting risk and resilience; in children and families in Guatemala. This course includes a 10-14 day trip to Guatemala where students will learn intensively about topics including education, trauma and violence, child labor, community risks and supports, cultural competence, and social responsibility. Prerequisites: PSYC-405 and permission of instructor. G suffix awarded after completion of PSYC-405 and PSYC-406. Minimum of junior status.</p><p><strong>PSYC-412 Counseling Psychology (4 Credits)</strong><br/>Students will be introduced to clinical interventions for psychological concerns. We will discuss empirically supported psychological approaches to problems clients face, including motivational interviewing, psychodynamic, behavioral, cognitive, and acceptance/mindfulness approaches. Part of this discussion will include the scientific foundations of these approaches and the manner in which their effectiveness is evaluated. Issues related to ethical practice and working with clients from a diversity of backgrounds will be emphasized. Students will begin to develop basic counseling skills necessary for a wide range of professional settings. Prerequisites: PSYC-100. Minimum of junior status.</p><p><strong>PSYC-416 Psych of Gender (4 Credits)</strong><br/>This course will examine the centrality of sex and gender in our lives using an empirical scientific lens.  The aim of this course is to come to understand and reduce the biases surrounding gender identification. Not only will students consider the social and historical beliefs about women and their experiences, they will also explore the literature on men and masculinity along with the expanding literature on transgender, nonbinary, and gender-nonconforming identities and experiences. This course takes a social psychological approach to these issues while still considering the Biopsychosocial model to fully explore how we understand gender and its consequences. Prerequisites: PSYC-100. Minimum of junior status.</p><p><strong>PSYC-418 Drugs & Addiction (4 Credits)</strong><br/>Addiction is a public health crisis that poses challenges for afflicted individuals, family members, health care providers and policy-makers alike. In this course, we discuss the mechanisms by which drugs alter different brain structures and how those changes impact behavior. Students will evaluate the evidence for a variety of biological and environmental factors that impact the cycle of addiction and learn about different pharmacological and psychological therapies. Which therapies are most successful? Are there early interventions that we should endorse based on the evidence about risk factors for developing addiction? Is addiction a disease and how much control do individuals with addiction have over their actions? There are no easy answers to these questions. Students will read a variety of sources including scientific literature and personal memoirs to develop their understanding of these complex topics. Prerequisites: PSYC-100 or PSYC-200. Minimum of junior status.</p><p><strong>PSYC-426 Cultural Psychology (4 Credits)</strong><br/>(PS,G) This course engages students in the scientific study of how culture shapes (and is shaped by) psychological functioning. Rather than just cataloging similarities and differences among cultures, students will learn how biological, social, and physical worlds interact to produce adaptive behavior among individuals and larger social groups. Prerequisite: PSYC-100 or Permission of instructor. Minimum of junior status.</p><p><strong>PSYC-452 SI-Research (4 Credits)</strong><br/>(SI) Students conduct an independent, empirical research project on a topic of their choosing. Students cannot take this course if they have successfully passed one of the other three SI options (Clinical, Psych &amp; Society, or Off-Campus Research). Prerequisites: PSYC-246 and Permission of Instructor. Minimum of junior status.</p><p><strong>PSYC-454 SI-Psych & Society (4 Credits)</strong><br/>(SI) During this course, we will start with a contemporary problem that emphasizes ethics and social responsibility and consider the role of psychology in understanding and addressing this problem. Students cannot take this course if they have successfully passed one of the other three SI options (Clinical, Research, or Off-Campus Research) Prerequisites: PSYC-246 and Permission of instructor. Minimum of junior status.</p><p><strong>PSYC-458 SI-Clinical (4 Credits)</strong><br/>(SI) In this capstone course, students conduct a comprehensive review of research on a practical question related to a psychology-related community experience. This SI should be preceded by a pre-approved internship or volunteer placement, completed within 6 months of beginning the SI. Products include both a paper and a formal presentation. Students cannot take this course if they have successfully passed one of the other three SI options (Research, Psych &amp; Society, or Off-Campus Research). Prerequisites: PSYC-246 and Permission of Instructor. Minimum of junior status.</p><p><strong>PSYC-466 SI-Off-Campus Research (4 Credits)</strong><br/>(SI) Advanced off-campus research experience in Psychology or Neuroscience to be completed in the summer following the junior year. Research experiences must be at least 8 weeks in duration, involve a full-time commitment (i.e., approximately 40 hours per week), and be approved by the PSYC/NSCI program coordinators.  Students cannot take this course if they have successfully passed one of the other three SI options (Clinical,  Research. or Psych &amp; Society). Prerequisites: PSYC-246 and  Permission of Instructor. Minimum of junior status.</p><p><strong>PSYC-480 Community Psychology (2-4 Credits)</strong><br/>This course explores advanced psychological theories, methods, and applications that promote the well-being of individuals, families, and communities. We will explore social problems including systemic racism, mass incarceration, educational inequalities, and healthcare disparities in oppressed communities. This course equips students with the skills and knowledge needed to make meaningful differences for individuals and their communities, with a focus on fostering resilience, empowerment, social justice, and advocacy for policy change.</p><p><strong>PSYC-481 Honors in PSYC/NSCI (0-2 Credits)</strong><br/>Students extend or improve upon research they completed in PSYC-452 (or other significant research) under supervision of a supervisory committee. Required of all students applying for honors in psychology or neuroscience. Prerequisites: Psychology or Neuroscience  major, completion of PSYC-452 or other significant research, and permission of instructor. Cannot fulfill elective requirement. Minimum of junior status.</p><p><strong>PSYC-490 Clinical Experience (2 Credits)</strong><br/>Clinical experience is an experiential learning opportunity that allows students to apply their psychological knowledge and skills in the &quot;real world.&quot; In the course, students work with an organization in the community throughout the term and engage in ongoing reflection related to their experiences. Through this experience students will build: an understanding of the nature and purpose of the organization including its role in the community, awareness of the knowledge, skills, and methods used by professionals within the field, application of principles learned through psychology coursework and experience, and insight into personal strengths, areas for growth, and career goals. Prerequisites: PSYC-100 and Permission of Instructor. Minimum of junior status.</p><p><strong>PSYC-499 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject in the curriculum under a faculty member\\'s direction. Prerequisites: 100 and permission of department chair and instructor.</p>');",
  "scrape_metadata": {
    "original_title": "Psychology",
    "dept_slug": "psychology",
    "original_url": "https://augustana.edu/academics/areas-of-study/psychology",
    "courses_url": "https://augustana.edu/academics/areas-of-study/psychology/courses",
    "scrape_timestamp": "2025-09-26 19:59:43",
    "status": "success"
  }
}