{
  "program_title": "Public Health course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/public-health/courses",
  "faculty": [],
  "requirements": {
    "major_in": null,
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": null,
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=pubh",
  "courses_html": "document.write('<p><strong>PUBH-100 Introduction to Public Health (4 Credits)</strong><br/>(PS) This course introduces the interdisciplinary field and application of public health. Students will explore the social, political, and environmental determinants of health, and will be introduced to the institutions that shape health outcomes at the local, national, and global levels. This course will also help students understand how public health impacts the health of populations on a daily basis. Course activities will examine a diverse range of topics such as community health organizations, ethics in public health practice, maternal and child health, control of chronic and infectious disease, health through the lifespan, mental health, nutrition, and more. This course has no prerequisites. First year or sophomore status required.</p><p><strong>PUBH-180 Health Disparities (4 Credits)</strong><br/>(PS,D) An introduction to the impacts of health disparities on child development, behavioral choices, and adult health status in the United States. The course focus may shift to include race/ethnicity, geography, SES, gender, sexual orientation, disability status, migration status, age, religion and spirituality depending on current issues in health at the time it is offered.   PS, D were approved October 29, 2021.</p><p><strong>PUBH-223 Public Health Mythbusters (4 Credits)</strong><br/>The challenges of false information are fairly ubiquitous in today\\'s society. This course is designed to provide students with the knowledge and skills to help address the ongoing challenges of the global &quot;infodemic.&quot; The impact of false health-related information goes well beyond the current pandemic - and extends far further back into history than you might imagine. While the battle isn\\'t new, the impact of the internet and social media has definitely upped the game. What do we do now? How can we push back against misinformation and help ourselves, our families, and our friends from the risks of this information? The goal of this class is to help equip you to be a public health mythbuster. This class has no prerequisites.</p><p><strong>PUBH-247 Whole Person Health (4 Credits)</strong><br/>(PS, G) Whole Person Health students will learn about the intersection of physical, social, emotional, spiritual, economic, and vocational health and wellbeing in Sweden and Iceland. Students will identify how Swedish &amp; Scandinavian culture and infrastructure supports whole person health and compare human wellness outcomes to those of the United States. PUBH-247 does not have any prerequisites, but we strongly recommend an introductory-level social science course such as PUBH 100, SOAN 101 or 102, PSYC 100, etc. prior to enrolling in PUBH-247.</p><p><strong>PUBH-248 Whole Prsn Health Travel (1 Credits)</strong><br/>(PEA) Whole Person Health, Travel Term students will learn about the intersection of physical, social, emotional, spiritual, economic, and vocational health and wellbeing in Sweden and Iceland. Students will identify how Scandinavian culture and infrastructure supports whole person health through immersive travel and hands-on experiences in Sweden and Iceland. Students will also dive deeper into the physical and spiritual aspects of whole person health through cultivating a personalized yoga and meditation practice. Prerequisite: PUBH-247.</p><p><strong>PUBH-248A Whole Health Travel A (0 Credits)</strong><br/>This is a 0 credit option of the June travel term in Scandinavia (which correlates with Spring 2023\\'s 4-credit Whole Person Health in Scandinavia course). This 0-credit option was developed for students who cannot pay for the 1-credit option of the travel term and/or need to graduate in May.</p><p><strong>PUBH-273 Reproductive Justice (4 Credits)</strong><br/>(PH,D) What is reproductive justice, and how is it different from reproductive rights and reproductive health? This immersive course will explore how gender, class, race, ability, sexual orientation, immigration status, criminalization status, and other multifaceted oppressions shape a person\\'s ability to self-determine their reproductive destiny. Students will utilize readings, films, guest speakers, and field trips to understand the socioeconomic and political contexts in which reproduction is situated. Topics include intersectional, anti-racism, feminist, and critical public health perspectives on abortion, adoption, childbirth, contraception, health care, infertility, parenting, pregnancy, and sterilization.</p><p><strong>PUBH-300 Epidemiology (4 Credits)</strong><br/>Epidemiology is the study of health-related events and conditions across populations of humans and/or animals (including infectious and chronic diseases, environmental events and conditions, and health related behaviors). Upon completion of the course, students will understand the basic concepts, methods, and terminology of epidemiology, and will be able to apply these concepts and methods to current public health issues. Course includes a weekly hands-on lab. Pre-requisites: PUBH-100 and Statistics (BUSN-211, MATH-130 MATH-315, PSYC-240 or SOC-230), and minimum of junior status. Permission of instructor only.</p><p><strong>PUBH-306 Sexuality & Health Education (4 Credits)</strong><br/>Sexuality includes diverse values and behaviors that are influenced by history, culture, environments, and identities. Students will explore the many challenges and strategies involved in developing education initiatives to achieve sexual and reproductive health. Topics include sexuality through the lifespan, gender identity, sexual orientation, sexually transmitted infections, pregnancy, contraception, sexual functioning, sexual violence, and sex work. An emphasis on community-based health education, sex positivity, and harm reduction perspectives encourage students to analyze complex public health issues that impact sexuality across diverse populations.  Prerequisite: PUBH-100 or Permission of Instructor.</p><p><strong>PUBH-350 Health Behavior & Promotion (4 Credits)</strong><br/>(PS) This course will highlight the role of health behavior in reducing the burden of diseases from preventable health conditions and improving health and wellness among communities and populations. Topics will include social and behavioral theories of health behavior change, community-based research methods and ethics, development of health promotion programs, and interventions and program planning frameworks. Team-based projects will result in health promotion proposals for the Augustana College community. Prerequisite: PUBH-100 and minimum of junior status. Permission of instructor only.</p><p><strong>PUBH-365 Professionalism in PH Practice (2 Credits)</strong><br/>This course introduces students to the core competencies for public health professionals, a set of skills required for public health practice, to help prepare for working in a variety of public health settings, including the internship required for the Public Health major SI sequence. Students will explore their unique interests within the field, examine how they apply to the essential services of public health, and describe how the liberal arts approach at Augustana College can prepare them for a future in public health practice. Multiple methods of instruction will include activities, readings, peer-led discussion, guest speakers, and site visits to examine the many ways public health is practiced in the QC community and beyond.  Prerequisite: PUBH-100, Public Health major, Junior status only, and Permission of Instructor.</p><p><strong>PUBH-380 Special Topics in Public Health (4 Credits)</strong><br/>May be taken more than once as topics change. Each Special Topics course is an in-depth treatment of an area of study in Public Health. The topic will be announced for each offering. Prerequisite: PUBH-100 and at keast Sophomore status or Permission of Instructor.</p><p><strong>PUBH-399 Directed Study (1-2 Credits)</strong><br/></p><p><strong>PUBH-400 Independent Study (1-2 Credits)</strong><br/></p><p><strong>PUBH-450 SI Sequence I (2 Credits)</strong><br/>Part 1 of the Senior Inquiry Sequence. This course expands the learning environment beyond the traditional classroom to an applied setting aligned with each student\\'s public health career goals. You will explore the internship site\\'s mission, outreach, and needs while working to promote the health and well-being of the population they serve. Ongoing analysis of relevant literature will help you ground your organization\\'s work in public health research and practice. You will work with your preceptor(s) to identify and develop a plan for a deliverable that will benefit the organization\\'s work and population served. See the &quot;SI Sequence Handbook&quot; for more details about the internship and Senior Inquiry process. Public Health Senior majors only. Prerequistie: PUBH-350. Permission of instructor only.</p><p><strong>PUBH-460 SI Sequence II (2 Credits)</strong><br/>Part 2 of the Senior Inquiry Sequence. PUBH 460 will provide students a culminating experience that synthesizes, integrates, and applies what they have learned through their PUBH coursework and internship. Students will conduct an applied research project based on their proposal developed during the SI internship. This project requires integrating evidence-based public health research methods, theories, and practice strategies and will result in a deliverable for the internship site, a final paper, and a professional presentation delivered during Augustana\\'s Celebration of Learning student symposium. The project will be of interest to the student, relevant to public health practice, and useful to the internship site. Completion of this course after PUBH-450 will satisfy the SI requirement for the Public Health major. Prerequisites: PUBH-350 and PUBH-450. Public Health Senior majors only. Permission of instructor only.</p>');",
  "scrape_metadata": {
    "original_title": "Public Health",
    "dept_slug": "public-health",
    "original_url": "https://augustana.edu/academics/areas-of-study/public-health",
    "courses_url": "https://augustana.edu/academics/areas-of-study/public-health/courses",
    "scrape_timestamp": "2025-09-26 19:59:45",
    "status": "success"
  }
}