{
  "program_title": "Religion course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/religion/courses",
  "faculty": [],
  "requirements": {
    "major_in": null,
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": null,
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=relg",
  "courses_html": "document.write('<p><strong>RELG-150 Encountering Religion (4 Credits)</strong><br/>(D) A comparative approach to the academic study of religion and religious phenomena with some focus on religions as lived in the Quad Cities area. Required of majors and minors, as well as for the Interreligious Leadership program.</p><p><strong>RELG-199 Directed Study (1-2 Credits)</strong><br/></p><p><strong>RELG-201 Christian Origins (4 Credits)</strong><br/>(REF) An examination of the origins of Christianity and its transformation from a Judean grassroots household-based religious movement to an official Roman political religion with special attention to the varieties of, and conflicts between, various movements dedicated to following Jesus.</p><p><strong>RELG-202 Jewish & Christian Scriptures (4 Credits)</strong><br/>(REF) An introduction to the biblical texts of Judaism and Christianity, their origins, and history of interpretation in their initial contexts and key contexts in the history of their interpretation. Students will focus on the varieties of canons and the communities who use them, as well as the many ways in which these communities appeal to the authority of their scriptures.</p><p><strong>RELG-203 Christian Ethics (4 Credits)</strong><br/>(REF)An examination of Christian and other perspectives on ethical decision-making and on issues such as sexual ethics, abortion, war and peace, and the environment.</p><p><strong>RELG-204 Christian Theology (4 Credits)</strong><br/>(REF) An examination of primary Christian understandings of God, sin, salvation, suffering, and hope, with an eye to how they can address contemporary social issues, including environmental degradation, racism, sexism, consumerism, and violence.</p><p><strong>RELG-205 American Christianities (4 Credits)</strong><br/>(REF) An exploration of Christianities in the United States and the ways in which Americans have put a distinctively &quot;American&quot; spin on their churches and faith. Special attention is given to the intersecting realities of race, gender, religion, and the struggle for inclusion and justice from the 1960s until today.</p><p><strong>RELG-206 Reformers & Radicals (4 Credits)</strong><br/>(REF) An examination of several Christians (such as Luther, Kierkegaard, Bonhoeffer, Soelle, or others) who root their thought in the Lutheran tradition while drawing on that tradition to work for social justice.</p><p><strong>RELG-207 Jesus & Discipleship, Then & Now (4 Credits)</strong><br/>(REF) An examination of the historical Jesus and the Christ of Faith, with focus on the counter-cultural discipleship of early Christians and of contemporary Christians such as Catholic Workers and members of neo-monastic religious communities.</p><p><strong>RELG-208 Literature & Theology (4 Credits)</strong><br/>(REF) An examination of the &quot;existential&quot; experiences of suffering, sin, doubt, faith, despair, and hope through the careful interpretation of fiction.</p><p><strong>RELG-209 Global Christianities (4 Credits)</strong><br/>(REF) An exploration of how the world religions of Christianity and Islam have interacted and shaped one another throughout history. The course includes an intro to both religions and a comparison of core theological beliefs about God, Jesus Christ, and Prophet Muhammad, comparing the Bible and Qur\\'an, early Christian-Muslim debates, religious violence (holy war, jihad), and contemporary interfaith dialogues.</p><p><strong>RELG-210 Sages, Mystics & Philosophers (4 Credits)</strong><br/>(REF) Students explore how Christian, Hindu &amp; Muslim mystics think about Ultimate Reality (God, Brahman, Allah) through both logic &amp; faith and how they undertake spiritual journeys toward mystical union with Him/Her/It. Students consider contemporary issues about Yoga, mystical tourism, &quot;spiritual but not religious&quot; &amp; the challenge of studying religions through one\\'s own biases.</p><p><strong>RELG-211 Religion and Film (4 Credits)</strong><br/>(REF) A consideration of major themes in Religion (focusing especially on Christianity, Judaism, and Islam) using the study of film.</p><p><strong>RELG-212 The Disciplined Life (4 Credits)</strong><br/>(REF) The Disciplined Life: Asceticism in Buddhism, Christianity and Hinduism is a comparative study of the disciplined life focusing on asceticism in the religious traditions of Buddhism, Christianity, and Hinduism</p><p><strong>RELG-213 Called to Work and Sabbath Rest (4 Credits)</strong><br/>(REF) Students will reflect on meaningful work (or vocation) with respect to sabbath rest, as fleshed out by the Jewish and Christian traditions. Special attention given to the challenges for religious observance and intentional work and rest, given the totalizing demands of work in the modern world. In addition to reading and writing about sabbath practices and vocational discernment, members of the class will adopt practices of stillness, boundary setting, media fasts, and other practical means of inhabiting &quot;slow time&quot; and reflecting on meaning and purpose.</p><p><strong>RELG-214 Angels and Demons (4 Credits)</strong><br/>(REF) The interactions of paganism and Christianity are examined through Greek and Latin literature of the 4th-5th centuries CE--from Diocletian\\'s Great Persecution to the triumph and establishment of Christianity, including the momentous and controversial reigns of Constantine the Great and Julian the Apostate. Study of the encounter highlights tradition and innovation in literary genres, dialogue, and conflict in the relations between the two traditions. In the end, the establishment of Greco-Roman paganism and Christianity as twin poles in an ongoing tension continues to produce new ways of thinking about their relationship. By permission only.</p><p><strong>RELG-215 Philosophy & Theology (4 Credits)</strong><br/>(REF) Students will rationally examine their faith - their religious commitments if any concerning the existence and nature of God - through philosophical analyses and argumentation in support or criticism of theistic religious doctrines.</p><p><strong>RELG-216 Disability & Religion (4 Credits)</strong><br/>(REF) Faith is an important part of many people\\'s lives; however, it is often difficult for disabled people to fully participate in their faith communities. We will explore reasons why disabled people might be excluded, as well as ideas that impact the experiences disabled people have in their religious communities. Students will be challenged to consider their own personal faith, as well as the ways in which practices of social justice may help alleviate some of the disparities faced by disabled people.</p><p><strong>RELG-217 Religion and the Vocation of Business (4 Credits)</strong><br/>(REF) Primarily for students majoring in business administration and interested in the new BESLA program, this course offers the chance to think through the intersection of business and the economy with Christianity and other accounts of &quot;the good life.&quot; Through careful examination of texts, writing projects, interviews, and participation in three BESLA dinner and dialogue events, students will be able to articulate how religion informs the way we think about work and develop a personal philosophy that guides their choices in college and career.</p><p><strong>RELG-259 Environmental Ethics (4 Credits)</strong><br/>(PH) A philosophical and theological examination of the moral relationship between human beings and non-human creatures and species, with attention to the ethical principles and religious worldviews through which the natural world might be preserved/sustained, and to the moral and religious status of earth and its inhabitants.</p><p><strong>RELG-263 Sexual Ethics (4 Credits)</strong><br/>(PH) An examination of terms and concepts, exploration of diverse frameworks for sexual ethics, and opportunities for students to demonstrate their understanding of sexuality as historically and politically situated.</p><p><strong>RELG-270 Luther: Life, Thought, Legacy (4 Credits)</strong><br/>(PP) An examination of Martin Luther and the Lutheran Reformation, both in terms of the late medieval church and as they influence contemporary understandings of church, vocation, God, grace, ethics, religious pluralism, and the common good.</p><p><strong>RELG-273 Jesus of Nazareth (4 Credits)</strong><br/>(PP) An historical critical examination of the life and teachings of Jesus of Nazareth focusing primarily on the New Testament gospels and other early Christian texts, including examination of key ideas about/reconstructions of Jesus in scholarship and popular culture.</p><p><strong>RELG-284 Buddhism and Film (4 Credits)</strong><br/>(PH,G)  Engaging with written texts, films, and contemplative practice, this course focuses on how Buddhist religious traditions address ethical and existential issues including questions about suffering, gender, sexuality, karma, life, and death.  Students will learn about different schools of Buddhism such as Theravada, Zen and Tibetan Buddhism, the controversy about the ordination of nuns, and issues pertaining to the representation of Buddhism through film. In this course, students will be expected to engage in mindfulness meditation practices.  May not take RELG-284 if RELG-384 has already been taken.</p><p><strong>RELG-285 Islam: An Introduction (4 Credits)</strong><br/>(PH,G) A scholarly critical examination of global Islam through history. Students first learn how to study religion from an academic perspective. Course content focuses on the origins of Islam, the Qur\\'an, the historical Muhammad, Islamic sects, Sunni schools of thought, Twelver and Ismaili Shi\\'ism, Muslim debates about God\\'s existence and attributes, Islamic law (sharia) and rituals, Islamic Mysticism (Sufism), sexuality and gender, and Muslim views of war and peace. No prior knowledge of Islam or religious studies is required.</p><p><strong>RELG-287 Religion & Philosophy of India (4 Credits)</strong><br/>(PP, G) An introduction to religions and philosophies originating in the Indian subcontinent, including traditions such as Hinduism, Buddhism and Jainism and a study of  texts, devotional practices, and more modern developments such as the impact of colonialism and Gandhi\\'s political activism.</p><p><strong>RELG-299 Directed Study (1-2 Credits)</strong><br/></p><p><strong>RELG-304 Reasoned Examination of Faith (4 Credits)</strong><br/>(REF) Reasoned Examination of Faith will include a critical examination into the ways in which faith and reason challenge and enrich each other through the academic study of Christianity, ethical theories, and other worldviews. Each iteration will explore a particular topic according to special opportunities, public events, the interests of the professor and students.</p><p><strong>RELG-355 Medical Ethics (4 Credits)</strong><br/>(PH) An exploration of issues at the intersection of medicine and ethics, including allocation of scarce healthcare resources, health reform and financing of health care, advance directives and end-of-life decisions, cloning and other forms of artificial reproduction, CRISPR and gene editing, gene therapy and genetic enhancement, expressed consent and presumed consent in organ donation, and xenotransplantation. The course focuses particular attention of Jewish, Christian and Muslim perspectives on these issues.</p><p><strong>RELG-356 Business Ethics (4 Credits)</strong><br/>(PH,G) Ethical issues pertaining to the business world and of the relationship between Christian ethical ideals and economic concerns, focusing particular attention on the ethics of globalization and its impact on marginalized populations in China, Mexico, Bangladesh, Ethiopia, Liberia and other countries, and on supplier codes of conduct and other measures that can be taken to ensure high ethical standards in business.</p><p><strong>RELG-360 Creator, Creation & Calling (4 Credits)</strong><br/>(PH) An examination of the relationship between God, the natural world, and human vocation as they intersect with scientific knowledge, ecological degradation and restoration, salvation, personal commitment, and communities such as Holden Village (WA) or Covenant Point Camp (MI).  This is a study away program course and students should apply for the program through IOP.</p><p><strong>RELG-362 Race, Ethnicity, Religion (4 Credits)</strong><br/>(PS,D) An investigation into the historical construction of race and religion from the modern to contemporary period.</p><p><strong>RELG-363 Sexual Ethics (4 Credits)</strong><br/>(PH) An examination of terms and concepts, exploration of diverse frameworks for sexual ethics, and opportunities for students to demonstrate their understanding of sexuality as historically and politically situated.</p><p><strong>RELG-370 Suffering, Death & Hope (4 Credits)</strong><br/>(PH) A theological, existential, and practical investigation into the crisis of meaning brought about by radical suffering and how religious communities respond. Students analyze the Book of Job, contemporary debates about theodicy (&quot;the problem of evil&quot;), and various understandings of the afterlife. </p><p><strong>RELG-371 Theological Investigations (4 Credits)</strong><br/>(PH) Exploration of Christian theology focused on revisiting traditional doctrines for contemporary communities.</p><p><strong>RELG-372 Restorative Justice (4 Credits)</strong><br/>(PH) An exploration of theological and political themes related to redemption, sin, suffering, salvation, reconciliation, repentance, healing, and restorative models of social justice. When taught as an &quot;inside/out&quot; J- Term course in conjunction with the Augustana Prison Education Program (APEP), the course is by permission of instructor, after application process and contingent on security clearance from the Illinois Department of Corrections.</p><p><strong>RELG-374 Gender and the Bible (4 Credits)</strong><br/>(PL) An examination of the concepts of masculinity and femininity as they are represented in the Bible and treated in popular and scholarly analysis of the Bible. The course pays special attention to how biblical authors and their interpreters draw upon, construct, reinforce, and challenge gender performances in ancient and modern contexts.</p><p><strong>RELG-384 Buddhism and Film (4 Credits)</strong><br/>(PH,G)  Engaging with written texts, films, and contemplative practice, this course focuses on how Buddhist religious traditions address ethical and existential issues including questions about suffering, gender, sexuality, karma, life, and death.  Students will learn about different schools of Buddhism such as Theravada, Zen and Tibetan Buddhism, the controversy about the ordination of nuns, and issues pertaining to the representation of Buddhism through film. In this course, students will be expected to engage in mindfulness meditation practices.  May not take RELG-384 if RELG-284 has already been taken.</p><p><strong>RELG-385 Islamic Ethics in Literature (4 Credits)</strong><br/>RELG-385 Islamic Ethics in Literature (4 Credits) (PL, G). An exploration of Muslim ethical and intellectual traditions. The course begins with an intro to ethics and intro to Islam followed by a survey of how Muslims understand good and evil, objective morality, divine and human law, virtue ethics, and free will vs. predestination across different Muslim literatures. The latter include the Qur\\'an, Islamic theology and philosophy, Ismailism, Sufi literature, and feminist literature. The latter part of the course looks at applied ethics in philanthropy, bioethics, war and peace, and the problem of evil. No prior knowledge of Islam or religious studies is required.</p><p><strong>RELG-387 Religions of China and Japan (4 Credits)</strong><br/>(PL,G) An investigation of the beliefs of the religions of East Asia including Confucianism, Daoism, Shinto, and schools of East Asian Buddhism such as Pure Land and Zen, as expressed in religious texts and practices.</p><p><strong>RELG-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>RELG-399 Directed Study (1-2 Credits)</strong><br/>An opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisites: permission of instructor and department chair.</p><p><strong>RELG-400 Independent Study (1-2 Credits)</strong><br/>Guided study and research in religion. Prerequisites: permission of instructor and department chair.</p><p><strong>RELG-449 Theorizing Religion (2 Credits)</strong><br/>A multidisciplinary introduction to theories and methods for the academic study of religion. Required for majors and minors</p><p><strong>RELG-450 Senior Inquiry (2 Credits)</strong><br/>A consideration of methodological approaches to religion as context for and to support the completion of the research, writing, and public presentation of the Senior Inquiry project. Prerequisites: RELG 150 and RELG 449.</p><p><strong>RELG-499 Directed Study (1-2 Credits)</strong><br/>An opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisites: permission of instructor and department chair.</p>');",
  "scrape_metadata": {
    "original_title": "Religion",
    "dept_slug": "religion",
    "original_url": "https://augustana.edu/academics/areas-of-study/religion",
    "courses_url": "https://augustana.edu/academics/areas-of-study/religion/courses",
    "scrape_timestamp": "2025-09-26 19:59:48",
    "status": "success"
  }
}