{
  "program_title": "Sociology and Anthropology course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/sociology-and-anthropology/courses",
  "faculty": [],
  "requirements": {
    "major_in": null,
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": null,
    "gpa_note": null,
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=soan",
  "courses_html": "document.write('<p><strong>SOAN-101 Intro to Sociology (4 Credits)</strong><br/>(PS, D) A general introduction to society and culture, socially learned patterns of human behavior, formal and informal organization, collective behavior and social change.  Students will learn the tools, methods and key concepts sociologists use to study society.</p><p><strong>SOAN-102 Intro to Anthropology (4 Credits)</strong><br/>(PS, G) A general introduction to culture, diverse cultural systems and groups of people from around the globe, and a holistic examination of the many parts of culture. Students will learn the tools, methods and key concepts anthropologists use to study humanity.</p><p><strong>SOAN-102TR Anthropology Elective (1-5 Credits)</strong><br/></p><p><strong>SOAN-199 Directed Study (1-2 Credits)</strong><br/>Opportunities for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and instructor.</p><p><strong>SOAN-200TR SOAN Elective (1-12 Credits)</strong><br/></p><p><strong>SOAN-201TR Sociology Elective (1-5 Credits)</strong><br/></p><p><strong>SOAN-202TR Anthropology Elective (1-5 Credits)</strong><br/></p><p><strong>SOAN-222 Popular Culture (4 Credits)</strong><br/>(PS,D) Critical study of selected examples of popular culture, such as folklore, music, cinema, television, social media and more. Emphasis on the relation between popular culture, ideology, race, class, gender, intercultural identities, and political-economic processes. Offered in alternating years.</p><p><strong>SOAN-223 Families & Relationships in U.S. Society (4 Credits)</strong><br/>(PS,D) Examination of the social and psychological factors that influence interpersonal romantic relationships. This course considers topics like dating processes in contemporary U.S. society, marriage, long-term partnerships, and various conceptualizations of (dys)functional relationships.</p><p><strong>SOAN-225 Social Problems (4 Credits)</strong><br/>(PS) Examination of contemporary social issues as analyzed from a variety of sociological perspectives.</p><p><strong>SOAN-226 Ethnography (4 Credits)</strong><br/>(PS,G) This course investigates the ethnographic methods used by anthropologists to generate knowledge about human populations. We will explore a variety of issues and problems in the anthropological study of culture by reading and discussing ethnographies that depict communities in varied cultural, geographical, political and economic contexts.</p><p><strong>SOAN-227 Social Statistics (4 Credits)</strong><br/>(Q) An introduction to descriptive and inferential statistics, including frequencies, sampling, hypothesis testing, bivariate analysis, regression and correlation. The course will also discuss the use of statistics in society and the media, with an emphasis on the critical evaluation of social statistics. Prerequisite: SOAN-101 or 102 or permission of instructor.</p><p><strong>SOAN-228 Bystander Intervention (1 Credits)</strong><br/>This course addresses gender-based violence in our society, introduces students to bystander intervention approaches, and prepares students to provide bystander intervention education to college and high school students. Prerequisite: permission of instructor.</p><p><strong>SOAN-231 Culture Through Film (4 Credits)</strong><br/>(PS,G) This course uses film to explore other cultures and some of the common issues people face globally. The primary focus is on documentary and ethnographic films, but will also consider commercial and narrative films. The course examines both Western and non-Western societies, cross-cultural encounters, and Western and non-Western film traditions.  Students will explore topics like representation, point of view, bias, and ethnocentrism in film narratives and framing.  Offered in alternating years.</p><p><strong>SOAN-250 Human Origins (4 Credits)</strong><br/>(PP) Who are we, and where did we come from? What can &quot;bones and stones&quot; from the ancient past tell us about being human? In this course we will examine the biological evolution and cultural adaptations of the human species through the lens of Biological Anthropology. We will study the hominin fossil record, the physical variation and adaptation of primates, basic population genetics, and humankind\\'s place in world ecology. Using archaeological evidence, we will analyze the origins of human culture and society and consider how our most ancient ancestors continue to influence us today. Offered in alternating years.</p><p><strong>SOAN-299 Directed Study (1-2 Credits)</strong><br/>Opportunities for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and instructor.</p><p><strong>SOAN-300TR Soan Elective (1-12 Credits)</strong><br/></p><p><strong>SOAN-301 Social & Anthropological Theory (4 Credits)</strong><br/>A systematic introduction to sociological and anthropological theory, focusing on the intellectual and socio-political factors that shaped the thought of classic and contemporary theorists, and on the logics and rhetorics employed by thinkers attempting to comprehend the complexities of culture and society. Special emphasis on critical theoretical schools of thought from the 1960s to the present. Prerequisite: SOAN 101 or 102 or permission of instructor.</p><p><strong>SOAN-303 Social Science Research Methods (4 Credits)</strong><br/>Introduction to a range of qualitative and quantitative methods. Students will gain practical skills in doing and understanding research. Methodological approaches covered include (but are not limited to) interviews, participant observation, ethnography, and survey research. The course also covers epistemology, a critical examination of each method, ethical issues, data analysis, and the interplay of data, methods, and theory. Prerequisite: SOAN-101 or SOAN-102.</p><p><strong>SOAN-321 Native North America (4 Credits)</strong><br/>(PS, D) This class examines the indigenous peoples and cultures of North America; interdisciplinary ways of understanding Native peoples through ethnographic, biographical, and literary accounts; with a special emphasis throughout on contemporary issues and social movements across Native North America Prerequisite: SOAN 101 or 102 or permission of instructor.  Offered in alternating years.</p><p><strong>SOAN-324 Anthropology of Global Health (4 Credits)</strong><br/>(PS, G) Global health refers to health care systems, medical practices, and ideas about illness in cross-cultural contexts as well as issues of health development and global health inequities. This course will focus on key political, economic and sociocultural factors associated with the scope and magnitude of global health issues such as HIV/AIDS, tuberculosis, malaria and maternal health, with particular attention to how inequalities within and between populations shapes them in fundamental ways. We will also examine anthropology\\'s contributions to global health knowledge, debates and practice.  Prerequisite: SOAN 101, SOAN 102 or PUBH 100 or permission of instructor.</p><p><strong>SOAN-325 Global Connections (4 Credits)</strong><br/>(G) This course turns a critical lens onto the complex and increasingly interconnected interactions between societies and cultures. The course examines colonialism, migration, intercultural interactions, commodification and late capitalism, the fate of local communities within global economic and political systems, with a particular focus on critical tourism studies. Prerequisite: SOAN 101 or 102 or permission of instructor.  Offered in alternating years.</p><p><strong>SOAN-327 Gender in Society (4 Credits)</strong><br/>(PS,D) Examination of gender at the individual, interpersonal and socio-structural levels. Meanings of masculine and feminine and gender relations and corresponding responses of organizations and institutions are addressed through both women\\'s and men\\'s studies perspectives. The gender binary is critically examined to better understand gender non-conforming, trans, gender fluid, gender queer, men, and women.  Prerequisite: SOAN 101 or 102 or permission of instructor. Offered in alternating years.</p><p><strong>SOAN-329 American Race & Ethnic Relations (4 Credits)</strong><br/>(D) American Race &amp; Ethnic Relations. An overview of major sociological interpretations of the nature of ethnicity and ethnic relations; socio-historical analyses of the major racial and ethnic minorities in the United States; Native American, African, Latinx, Asian and European origin groups; an assessment of the role of race in American society; an exploration of the future significance of race and ethnicity. Prerequisite: SOAN 101 or 102 or permission of instructor.</p><p><strong>SOAN-330 Social Movements (4 Credits)</strong><br/>(PH,D) An investigation into the social science of social movements. Includes an overview of social movement strategies and tactics, a range of theoretical perspectives, growth and prospects for success, and social psychological dimensions of social movement activism. Prerequisite: SOAN 101 or 102 or permission of instructor. Offered in alternating years.</p><p><strong>SOAN-331 Self & Society (4 Credits)</strong><br/>An introduction to the study of the self, including inquiry into the relevance of philosophers and social psychologists to a distinctly sociological and anthropological approach to the self, with particular attention to the symbolic interactionist tradition and the study of emotions. Prerequisite: SOAN 101 or 102 or permission of instructor. Offered in alternating years.</p><p><strong>SOAN-333 Refugees,Rights,Responsibilities (4 Credits)</strong><br/>(PS,G) This seminar will explore the refugee experience from forced migration and displacement globally, to local resettlement. Students will examine: causes and consequences of displacement; international, state, and local responses to refugee situations; and refugee resettlement. Prerequisite: SOAN 101 or 102 or permission of instructor. Offered in alternating years.</p><p><strong>SOAN-334 Immigrants: Beyond Borders (4 Credits)</strong><br/>(PS,D) An exploration of the dynamics and impacts of global migration, past and present. The course examines this complex and often contested phenomenon, focusing on the forces that promote movement from one nation to another, the factors that contribute to or deter the integration of immigrants into the receiving society, and the role of the state and other actors in controlling migratory flows and defining incorporation regimes.  Prerequisite: SOAN 101 or 102 or permission of instructor. Offered in alternating years.</p><p><strong>SOAN-338 Magic, Ritual & Death: Anth of Relg (4 Credits)</strong><br/>(PH) An inquiry into the anthropology of religion, including an analysis of individual and social functions of religion, ritual &amp; magic, the experience of the supernatural world through practices like shamanism and altered states of consciousness, indigenous spiritual knowledge of the natural world, and the process and meaning of death and dying. Prerequisite: SOAN 101 or 102 or permission of instructor. Offered in alternating years.</p><p><strong>SOAN-340 Humans and the Environment (4 Credits)</strong><br/>(PS, D) This course investigates human relationships with the natural environment. Utilizing interdisciplinary theoretical perspectives and debates surrounding environmental issues, the course will concentrate on one or more thematic areas, such as: climate change, food and agriculture, resource conflicts, natural disasters, environmental justice, sustainability initiatives, and others. Prerequisite: SOAN 101 or 102 or permission of instructor. Offered in alternating years.</p><p><strong>SOAN-341 Crime and Society (4 Credits)</strong><br/>(PS) This upper-level seminar explores how crime manifests in contemporary American society through an analysis of the criminal legal system. This course explores topics like the media representation of criminals, privatization of prisons, juvenile offending, and solitary confinement. Prerequisite: SOAN 101 or 102 or permission of instructor. Offered in alternating years.</p><p><strong>SOAN-342 Sociology of Education (4 Credits)</strong><br/>(PS, D) An overview of the study of education from a sociological perspective. Topics will include the purpose of the educational system, the goals and benefits of the educational system, how school experiences vary for different groups in society, how social characteristics such as age, race, class, gender, and disability affect the educational experience, and how educational systems are similar and different across the globe.  Prerequisite: SOAN 101 or 102 or permission of instructor. Offered in alternating years.</p><p><strong>SOAN-343 Women and Crime (4 Credits)</strong><br/>(PS, D) This course will examine a range of experiences that women have with crime and the legal system. Throughout the semester, students will explore how theories of criminality have considered crime as a gendered phenomenon, the overlap between victimization and offending, especially as it relates to topics like sex work and drug use. Prerequisite: SOAN 101 or 102 or permission of instructor. Offered in alternating years.</p><p><strong>SOAN-344 Crimes of the Powerful (4 Credits)</strong><br/>(PS) This course explores the relationship between crime, power, and corruption. By examining case studies at national and international levels, the class will critically question definitions of crime and harm. Students will investigate topics like war crimes, genocide, modern slavery, labor exploitation, environmental harm, white collar, and corporate crimes. Prerequisite: SOAN 101 or 102 or permission of instructor. Offered in alternating years.</p><p><strong>SOAN-380 Special Topics Seminar (4 Credits)</strong><br/>Treatment in-depth of a topic of sociological interest not offered in the general curriculum. Topic announced for each offering. Students may take more than one special topics seminar.</p><p><strong>SOAN-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>SOAN-399 Directed Study (1-2 Credits)</strong><br/>Opportunities for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and instructor.</p><p><strong>SOAN-400 Independent Study (1-2 Credits)</strong><br/>Prerequisite: permission of instructor, agreement on topic and schedule of appointments</p><p><strong>SOAN-450 Senior Inquiry/Capstone (4 Credits)</strong><br/>Students will develop and complete an independent research project. The topic of each SI will be determined in collaboration with the instructor. Projects may follow one of three tracks: primary data collection with a significant emphasis on qualitative or quantitative methods and/or applied work, secondary qualitative or quantitative data with a significant emphasis on theoretical analysis, or tertiary data that is analyzed through three unique theoretical frameworks. Students will present the results of their project to the public. Prerequisite: SOAN-303.</p><p><strong>SOAN-499 Directed Study (1-2 Credits)</strong><br/>Opportunities for students to study a particular subject under a faculty member\\'s direction. Prerequisite: permission of department chair and instructor.</p>');",
  "scrape_metadata": {
    "original_title": "Sociology and Anthropology",
    "dept_slug": "sociology-and-anthropology",
    "original_url": "https://augustana.edu/academics/areas-of-study/sociology-and-anthropology",
    "courses_url": "https://augustana.edu/academics/areas-of-study/sociology-and-anthropology/courses",
    "scrape_timestamp": "2025-09-26 19:59:53",
    "status": "success"
  }
}