{
  "program_title": "Spanish course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/spanish/courses",
  "faculty": [],
  "requirements": {
    "major_in": null,
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": null,
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=span",
  "courses_html": "document.write('<p><strong>SPAN-100 First Year Spanish Refresher (2 Credits)</strong><br/>For students placed in 102 by Spanish placement test. These students may, with consent of the department, register for 100 and attend a 101 class (they cannot take 101), then continue with 102. Prerequisite: placement in 102 and consent of the department.</p><p><strong>SPAN-101 First Year Spanish I (4 Credits)</strong><br/>Introduction to Spanish language, both written and spoken. Includes study of the cultures of Spanish-speaking countries and an introduction to intercultural communication. No previous knowledge of Spanish is assumed. Students are immersed in a Spanish-only classroom in which instruction is given (almost) exclusively in Spanish.</p><p><strong>SPAN-102 First Year Spanish II (4 Credits)</strong><br/>Continued study of Spanish language, both written and spoken. Includes study of the cultures of Spanish-speaking countries and further development of intercultural communication skills. Students are immersed in a Spanish-only classroom in which instruction is given (almost) exclusively in Spanish. Prerequisite: SPAN-100, SPAN-101 or placement.</p><p><strong>SPAN-110TR Spanish Elective (1-5 Credits)</strong><br/></p><p><strong>SPAN-199 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisites: permission of department chair and instructor.</p><p><strong>SPAN-200 AP Spanish Lit (4 Credits)</strong><br/></p><p><strong>SPAN-200AP AP Spanish Language (4 Credits)</strong><br/></p><p><strong>SPAN-201 Second Year Spanish I (4 Credits)</strong><br/>This third course in the Spanish language sequence reinforces skills from SPAN-102 with additional emphasis on reading, composition and conversation in Spanish. Students explore the cultures and people of the Spanish-speaking world in greater depth. Students are immersed in a Spanish-only classroom in which instruction is given exclusively in Spanish and students are expected to exclusively use Spanish in return. Prerequisite: SPAN-102 or equivalent.</p><p><strong>SPAN-202 Second Year Spanish II (4 Credits)</strong><br/>(D) This fourth and final course in the Spanish language sequence reinforces reading, composition and conversation skills from SPAN-201. Students explore the cultures and people of the Spanish-speaking world in greater depth, with specific emphasis on U.S. Latino/Chicano literature, including reading a memoir in Spanish. Students are immersed in a Spanish-only classroom in which instruction is given exclusively in Spanish and students are expected to exclusively use Spanish in return. Prerequisite: SPAN-201 or equivalent.</p><p><strong>SPAN-210 Accelerated Intermediate Spanish (4 Credits)</strong><br/>This intensive-accelerated course reinforces reading, composition and conversation skills developed in SPAN-201 and SPAN-202, with specific emphasis on preparation for the advanced courses. Students explore the cultures and people of the Spanish-speaking world in greater depth, including U.S. Latino/Chicano cultures. Students are immersed in a Spanish-only classroom in which instruction is given exclusively in Spanish and students are expected to exclusively use Spanish in return. Designed for students who transfer credit for SPAN-202 but place below SPAN-301/302, or students who excel in SPAN-102 with the recommendation and permission of the instructors.</p><p><strong>SPAN-211TR Spanish Elective (3-4 Credits)</strong><br/></p><p><strong>SPAN-299 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisites: permission of department chair and instructor.</p><p><strong>SPAN-301 Spanish Composition & Conversation (4 Credits)</strong><br/>Students develop writing techniques in Spanish by analyzing authentic texts from varying genres then employing these techniques in their own written work: a fictional narrative and a final persuasive essay. Prerequisite: SPAN-202 or equivalent.</p><p><strong>SPAN-302 Intro to Hispanic Literature (4 Credits)</strong><br/>Introduction to Hispanic Literature prepares students to read and analyze texts in Spanish from a variety of genres, historical moments, and cultural contexts in the Spanish-speaking world. The course focuses on developing reading skills, learning terms and processes of literary interpretation, and cultivating one\\'s own critical voice through analytical writing. This course prepares students for deeper study of literature and other cultural artifacts in subsequent upper-level courses. Prerequisite: SPAN-202 or equivalent.</p><p><strong>SPAN-310 Conversational Spanish (2 Credits)</strong><br/>Spanish conversation designed to develop oral proficiency, working on grammatical competence, vocabulary, pronunciation and fluency of speech, and cross-cultural communication. Conversations will revolve around authentic video materials that students will be responsible of viewing outside of class and contemporary news from Spanish speaking countries. These texts will expose students to different features of conversational Spanish and culture. May be repeated for up to 4 credits.  Prerequisite: SPAN-202 or placement equivalent of SPAN-301.</p><p><strong>SPAN-311 Advanced Spanish Grammar (2 Credits)</strong><br/>Intensive study and practice of Spanish language structure, concentrating on the aspects that cause more difficulty for students to move to the advanced level, such as accurate past tense formation and choice of aspect, hypothetical speech, reported or indirect speech, and constructing arguments in all subjunctive tenses. Contrast between English and Spanish structures are taught and practiced explicitly. Prerequisites: one course from SPAN-341, SPAN-342, SPAN-343 or SPAN-344 or permission of instructor. Required for teaching majors.</p><p><strong>SPAN-318 Spanish for Business Professionals (4 Credits)</strong><br/>This course provides specialized instruction in Spanish for students pursuing careers in business fields. Students study vocabulary and grammatical topics necessary to prepare a résumé, to contact potential employers, to interview for jobs in Spanish, and to encounter differing business customs throughout the Spanish-speaking world. SPAN-318 or SPAN-319 required for Professional Use majors. Prerequisite: SPAN-301 and SPAN-302. (Offered in alternate years.)</p><p><strong>SPAN-319 Spanish for Healthcare Professionals (4 Credits)</strong><br/>This course provides specialized instruction in Spanish for those students pursuing careers in the health sciences (including speech pathology and language development). Its intent, in part, is to problematize and address the growing need for multilingual and multicultural health professionals in an increasingly inclusive United States. To achieve this goal, students will explore the public health issues facing citizens of the Spanish-speaking world. Students will study- in Spanish- the vocabulary, grammar, sociocultural components and medical information necessary to accomplish this. While grammar is not the principal focus of this course, students will review and practice those linguistic aspects of Spanish most relevant to the realization of activities that further the above goals: e.g., asking questions, narrating in the past, deferential forms of address, domain-specific vocabulary. SPAN-318 or SPAN-319 required for Professional Use majors. Prerequisite: SPAN-301 and SPAN-302.  (offerend in alternate years.)</p><p><strong>SPAN-330 Introduction to Hispanic Linguistics (4 Credits)</strong><br/>Students are introduced to linguistics, the scientific study of human language, and explore its facets mostly through the lens of the Spanish language. Specifically, students examine such questions as: what does it mean to know (a) language?; what kinds of systematic knowledge are represented in the mind of a speaker?; and how is this knowledge stored cognitively? Based on the answers to these questions, students study proposed models of human language. The main goal of this course is to allow students to discover a new way of thinking about language based on analyses of the sounds (phonetics), the sound system (phonology), and the order (syntax) and structure (morphology) of words of Spanish, at times compared with English. Students will learn to think like a linguist in order to arrive at hypotheses about the nature of linguistic knowledge. Prerequisite: SPAN-301 and SPAN-302. Required for Spanish Teaching majors.</p><p><strong>SPAN-331 Spanish Phonetics & Phonology (4 Credits)</strong><br/>This course introduces the fundamental concepts of linguistics and, specifically, phonetics and phonology as they relate to Spanish. Linguistics is the scientific study of human language; when linguists analyze language(s), they seek answers to such questions as: what does it mean to know a language?; what kinds of systematic knowledge are represented in the mind of a speaker?; and how is this knowledge stored cognitively? Based on the answers to these questions, linguists propose models of human language. The goals of this course are to learn a new way of thinking about language and to answer the above questions based on students\\' analysis of the sounds (phonetics) and the sound system (phonology) of Spanish, at times compared with English. In a broader sense, students will learn to think like a linguist in order to arrive at hypotheses about the nature of phonological knowledge. Prerequisites: SPAN-301 and SPAN-302.</p><p><strong>SPAN-341 Culture of Spain I (4 Credits)</strong><br/>(PP, G) The course gives an overview of the history and culture of Spain from antiquity to the early modern era. Students go beyond the memorization of historical facts, synthesizing information so as to observe changes in the ideological, political, and artistic landscape across millennia. Secondary readings are complemented by study of authentic cultural artifacts and historical documents, especially of canonical literary texts that exemplify the trends identified in class discussions. Prerequisites: SPAN-301 and SPAN-302.</p><p><strong>SPAN-342 Culture of Spain II (4 Credits)</strong><br/>(PP, G) The course gives an overview of the history and culture of Spain from 1700 to the present. Students go beyond the memorization of historical facts, synthesizing information so as to observe changes in the ideological, political, and artistic landscape across several centuries. Secondary readings are complemented by study of authentic cultural artifacts and historical documents. Prerequisites: SPAN-301 and SPAN-302.</p><p><strong>SPAN-343 Latin/o American Culture (4 Credits)</strong><br/>(PP,G) Latin/o American Contemporary Culture I. The origin and development of Latin/o American cultures from the Indigenous Period through the Colonial Period (1800s). Students go beyond the memorization of historical facts, synthesizing information so as to observe changes in the ideological, political, and artistic landscape. Secondary readings are complemented by study of authentic cultural artifacts and historical documents, especially of canonical literary texts that exemplify the trends identified in class discussions. Prerequisites: SPAN-301 and SPAN-302.</p><p><strong>SPAN-344 Latin/o American Culture II (4 Credits)</strong><br/>(PP,G) Spanish-American Culture and Civilization II. The origin and development of Spanish-American culture and civilization from Independence to the present. Students go beyond the memorization of historical facts, synthesizing information so as to observe changes in the ideological, political, and artistic landscape across several centuries and countries. Secondary readings are complemented by study of authentic cultural artifacts and historical documents. Prerequisites: SPAN-301 and SPAN-302.</p><p><strong>SPAN-350A Adv. Composition (3 Credits)</strong><br/>Offered as part of the Spanish in the Andes Summer Program.  Equivalent to 301.</p><p><strong>SPAN-350B Latin American Culture (3 Credits)</strong><br/>Offered as part of the Spanish in the Andes Summer Program.  Equivalent to 326.</p><p><strong>SPAN-350C Adv. Spanish (3 Credits)</strong><br/>Offered as part of the Spanish in the Andes Summer Program. Equivalent to 3 elective credits.</p><p><strong>SPAN-351 Literature of Spain I (4 Credits)</strong><br/>(PL) Representative movements and works from the Medieval period through the Golden Age. Students make interdisciplinary connections to the literature of Spain through art, music, film, and build their Spanish language proficiency through critical thinking and analytical writing. Prerequisite: SPAN-341m SPAN-342, SPAN-343, or SPAN-44,or instructor permission. (Offered in alternate years.)</p><p><strong>SPAN-352 Literature of Spain II (4 Credits)</strong><br/>(PL) Representative movements and works from 18th century to the present. Students make interdisciplinary connections to the literature of Spain through art, music, film, and build their Spanish language proficiency through critical thinking and analytical writing. Prerequisite: SPAN-341, SPAN-342, SPAN-343, OR SPAN-344, or instructor permission. (Offered in alternate years.)</p><p><strong>SPAN-353 Latin/o American Literature (4 Credits)</strong><br/>(PL, G) Representative works of Spanish-American authors from discovery through modernism. Students make interdisciplinary connections to the literature of Latin American countries through art, music, film, and make thematic connections between texts of various genres and historical periods. Students continue to develop language proficiency across a full range of language skills, with special attention on language used in critical thinking and analytical writing. Prerequisite: SPAN-341 SPAN-342  SPAN-343 or SPAN-344, or instructor permission. (Offered in alternate years.)</p><p><strong>SPAN-354 Latin/o American Literature II (4 Credits)</strong><br/>(PL) Representative works in Latin/o American contemporary literature from modernism through the present. Students make interdisciplinary connections to the literature of Latin American countries through art, music, film, and make thematic connections between texts of various genres and historical periods. They build their Spanish language proficiency through critical thinking and analytical writing. Prerequisite: SPAN-341 SPAN-342 SPAN-343 or SPAN-344, or instructor permission. (Offered in alternate years.)</p><p><strong>SPAN-380 Topics in Spanish Studies (4 Credits)</strong><br/>An in depth exploration of specific topics in Peninsular or Latin American cultural studies, or Spanish linguistics as selected by the instructor. Topics will vary by instructor. May be repeated for credit with permission of instructor when the topics are different. Taught in Spanish. Prerequisite: SPAN-301 and SPAN-302.</p><p><strong>SPAN-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>SPAN-399 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisites: permission of department chair and instructor.</p><p><strong>SPAN-400 Independent Study (1-2 Credits)</strong><br/>Research project in Spanish language literature or civilization for departmental or divisional language majors. Prerequisite: consent of department chair.</p><p><strong>SPAN-451 Latin American Women Writers (3 Credits)</strong><br/>(PL) Offered on the Spanish in the Andes Summer Program.  Equivalent to SPAN-354.</p><p><strong>SPAN-454 Latin American History (3 Credits)</strong><br/>(PP) Offered on the Spanish in the Andes Summer Program.  Equivalent to SPAN-343.</p><p><strong>SPAN-457 Contemp Latin American Society (3 Credits)</strong><br/>Offered on the Spanish in the Andes Summer Program.  Equivalent to SPAN-344.</p><p><strong>SPAN-458 Literature & Culture of the Andes (3 Credits)</strong><br/>(PH) Offered on the Spanish in the Andes Summer Program.  Equivalent to SPAN-354.</p><p><strong>SPAN-480 Topics in Spanish Literature (4 Credits)</strong><br/>(PL). An in-depth exploration of specific topics in Peninsular or Latin American literature. Topics will vary by instructor. May be repeated for credit with permission of instructor when the topics are different. Taught in Spanish. Prerequisite: SPAN-301 and SPAN-302.</p><p><strong>SPAN-490 Senior Inquiry in Spanish (4 Credits)</strong><br/>(SI) This course is designed to assist and supervise Spanish majors as they develop, research, and write a capstone essay on a topic of their choice. Students will select research topics, conduct in depth research, and approach writing as a multi-step process as they work towards the production of an original research paper in Spanish. The class will also act as a forum in which students can share their experiences, work collaboratively towards common goals, and reflect upon their current research as well as their academic experience within the Spanish major. The course is taken at the end of the junior year or at the beginning of the senior year. Prerequisites: declared Spanish major and junior or senior standing.  (Offered in alternate years.)</p><p><strong>SPAN-499 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular subject under a faculty member\\'s direction. Prerequisites: permission of department chair and instructor.  </p>');",
  "scrape_metadata": {
    "original_title": "Spanish",
    "dept_slug": "spanish",
    "original_url": "https://augustana.edu/academics/areas-of-study/spanish",
    "courses_url": "https://augustana.edu/academics/areas-of-study/spanish/courses",
    "scrape_timestamp": "2025-09-26 19:59:56",
    "status": "success"
  }
}