{
  "program_title": "Master of Science Speech-Language Pathology course catalog",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/speech-language-pathology-master-science/courses",
  "faculty": [],
  "requirements": {
    "major_in": null,
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": null,
    "gpa_note": null,
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=slp",
  "courses_html": "document.write('<p><strong>SLP-500 Clinical Seminar 1 (1 Credits)</strong><br/>Procedures related to federal regulations (e.g., HIPAA, FERPA, Hi-Tech Act) will be discussed. Clinical methods and their applications will be explored. Students will learn about the supervision and certification processes and speech-language pathologists\\' Scope of Practice as determined by the American Speech-Language-Hearing Association (ASHA). They will learn to follow and interpret the ASHA Code of Ethics.  The intervention process from intake and interview through dismissal will be explored.</p><p><strong>SLP-501 Graduate Practicum 1 (3 Credits)</strong><br/>The primary objective for this internship course is for students to provide supervised intervention for up to four clients in individual and/or group weekly sessions at the Roseman  Center for Speech, Language, and Hearing. Student clinicians will complete documentation for each session for each client, write a plan of care and semester summary reports, participate in staffing sessions with their supervisors, and provide the highest level of individualized, evidence-based intervention for their clients. Student clinicians will have the opportunity to share information with and counsel clients\\' caregivers.  Students will review with a clinical supervisor or the Center Director one videotaped intervention session and will set personal goals for future semesters of intervention based on an exit interview session. This recording again will be reviewed along with an updated recording at the end of Clinical Practicum 4 so student clinicians can reflect on areas of clinical growth.</p><p><strong>SLP-502 Clinical Seminar 2 (1 Credits)</strong><br/>The primary objective of this course is to build upon principles introduced in Clinical Seminar 1. Student clinicians will complete an evidence-based practice assignment for a client seen in their Graduate Practicum. Considerations for eligibility for and dismissal from intervention services will be explored. Students will learn about telepractice service provision and the role of ASHA and other professional organizations. Strategies for clinical documentation writing, involving caregivers in their loved one\\'s care, and behavior management strategies will be emphasized in this seminar.</p><p><strong>SLP-503 Graduate Practicum 2 (3 Credits)</strong><br/>The primary objective of this internship course is to build upon content covered in Clinical Seminar 1 and clinical experiences developed in Graduate Practicum 1 to continue to provide supervised intervention for clients in individual and/or group weekly sessions at the Roseman Center for Speech, Language, and Hearing. Student clinicians will work with increasing independence to complete documentation for each session for each client, write semester summary clinical reports and provide the highest level of individualized, evidence-based intervention for their clients. Student clinicians will have the opportunity to share information with and counsel clients; caregivers.</p><p><strong>SLP-504 Clinical Seminar 3 (1 Credits)</strong><br/>The primary objective of this course is to build upon content introduced in Clinical Seminars 1 and 2. and clinical experience developed in Graduate Practicums 1 and 2. Various settings that speech-language pathologists work in will be explored, including school settings, healthcare settings, and early intervention. Laws and regulations pertaining to these settings will be reviewed. Interprofessional practice for different work settings will be discussed. Principles of mentoring will be reviewed.</p><p><strong>SLP-505 Graduate Practicum 3 (3 Credits)</strong><br/>The primary objective of this internship course is to build upon clinical experience developed in Graduate Practicums 1 and 2 to continue to provide supervised intervention for clients in individual and/or group weekly sessions at the Roseman Center for Speech, Language, and Hearing. Student clinicians will work with increasing independence to complete documentation for each session for each client, write semester summary clinical reports and provide the highest level of individualized, evidence-based intervention for their clients. Student clinicians will have the opportunity to share information with and counsel clients; caregivers.</p><p><strong>SLP-506 Clinical Seminar 4 (1 Credits)</strong><br/>The primary objective of this course is to build upon content introduced in Clinical Seminars 1, 2, and 3 and clinical experience developed in Graduate Practicums 1, 2, and 3. Specific areas of focus for this course include the process of obtaining ASHA certification, state licensure, and other relevant credentials and continuing education requirements. Professional expectations, workplace etiquette, and conflict resolution will be presented to prepare students for their future off-site adult and pediatric externship experiences and eventual professional practice.</p><p><strong>SLP-507 Graduate Practicum 4 (3 Credits)</strong><br/>The primary objective of this internship course is to build upon clinical experience developed in Graduate Practicums 1, 2, and 3 to continue to provide supervised intervention for clients in individual and/or group weekly sessions at the Roseman Center for Speech, Language, and Hearing. Student clinicians will work with increasing independence to complete documentation for each session for each client, write semester summary clinical reports and provide the highest level of individualized, evidence-based intervention for their clients. Student clinicians will have the opportunity to share information with and counsel clients; caregivers. Students will self-reflect on their clinical performance by reviewing recordings of their first term clinical work and set personal goals for their clinical externships during an exit interview with a clinical supervisor or the Center Director.</p><p><strong>SLP-508 Externship: Schools (8 Credits)</strong><br/>Student clinicians will engage in advanced clinical practice under supervision of an externship supervisor in a school setting. Students will participate actively in all aspects of service delivery and will accrue at least 100 direct clinical contact hours and at least 150 on-site work hours (the number of work hours required by some states for school/professional educator licensure). They will actively engage with their site mentors to learn about documentation, intervention, diagnostics, referrals, collaboration, and other aspects of the practice of school-based speech-language pathology. Students will reflect on their clinical performance and set personal future vocational goals.</p><p><strong>SLP-509 Externship: Adult (8 Credits)</strong><br/>Student clinicians will engage in advanced clinical practice under supervision of externship supervisors in a setting where adult clients are served (e.g., medical center, home health care agency, skilled nursing facility, outpatient rehabilitation clinic; education settings that serve young adults; settings in which at least 50% of the typical caseload include adults over the age of 18). Students will participate actively in all aspects of service delivery and will accrue at least 100 direct clinical contact hours. They will actively engage with their site mentors to learn about documentation, intervention, diagnostics, referrals, collaboration, and other setting-specific aspects of the practice of speech-language pathology. Students will reflect on their clinical performance and set personal future vocational goals.</p><p><strong>SLP-510 Counsel & Prof Issues (4 Credits)</strong><br/>The primary objective of this course is to provide students with an overview of the speech-language pathologist\\'s role in counseling individuals with communication impairments and their families. Students will learn about several specific skills such as active listening and collaborative problem-solving. They will also learn how to deliver news that is potentially difficult for clients to learn. Special consideration will be given to determining when clients should be referred to mental health professionals. Strategies will be derived from a variety of disciplines including psychology, social work, and communication studies. Other professional issues that will be covered in this course include mandatory reporting procedures and interprofessional interactions in pediatric and adult work settings.</p><p><strong>SLP-520 Adv Speech Sound Disorders (4 Credits)</strong><br/>The focus of this course is to examine and analyze competing theories of speech acquisition, as well as to recognize how a speech-language pathologist\\'s theoretical understanding influences the SLP\\'s speech sound diagnosis and treatment. A variety of diagnostic procedures and standardized measures will be analyzed, with students expected to develop a diagnostic protocol for a variety of speech sound disorders affecting children and adolescents. Dialectal differences and management options will be discussed, as will implications of the World Health Organization model for clinical service delivery, to increase cultural competence. A problem-based learning, case-based format will provide hands-on experiences to further develop critical thinking and collaboration skills in the evidence-based clinical evaluation and treatment of pediatric speech sound disorders.</p><p><strong>SLP-522 Adv Lang & Lit Disorders (4 Credits)</strong><br/>The primary objective of this course is for students to build upon concepts introduced in their undergraduate Language and Literacy Disorders course. Specifically, this course will focus on students applying principles of language science to inform oral and written language assessment and intervention. Students will complete a project related to a language client from their practicum caseload to complete a multi-phase evidence-based practice project. Best practices for family-focused intervention, early intervention, and school-based service delivery will be explored in-depth.  Interprofessional practice strategies for collaborating with reading teachers, teachers of English Language Learners, English/language arts educators, and regular and special educators also will be explored.</p><p><strong>SLP-524 Multicultural Persp in CSD (4 Credits)</strong><br/>The primary objective of this course is to provide a framework for students to serve individuals with communication disorders in a culturally responsive way by exploring concepts of multilingualism, cultural identification, public policy, systems of oppression, and evidence-based practice. Students will consider how factors such as age, gender, disability, socioeconomic status, and country of origin influence an individual\\'s interactions. Students will consider how their own cultural identity may influence their clinical interactions and decision-making. Strategies for determining eligibility for speech-language services in multicultural populations will be addressed. Students will learn to collaborate with others to best serve individuals from culturally diverse backgrounds.</p><p><strong>SLP-526 Motor Speech Disorders (4 Credits)</strong><br/>The primary objective of this course is for students to apply an understanding of the nervous system for the production of speech to a range of clinical skills: to distinguish the range of symptoms from multiple body systems associated with motor speech disorders, to differentiate motor speech disorders from other communication disorders that affect the production of speech, and to differentially diagnose the disorders. Auditory perceptual skills will be practiced for these purposes. Students will learn about etiologies of motor speech disorders. Management of the disorders and the decision-making process for determining the best outcomes for improved communication will be examined with an emphasis on the evidence of efficacy.</p><p><strong>SLP-530 Diagnostics (4 Credits)</strong><br/>The primary objective of this course is for graduate student clinicians to apply evidence-based principles of communication assessment through all phases of the diagnostic process for clients of all ages who have a variety of communication concerns. Students will complete clinical interviews and learn to integrate case history information and testing data into clinical decision-making. They will learn about standardized test development and will critique commercially available and informal assessment measures. Students will interpret psychometric data and will work collaboratively to assess pediatric and adult clients in areas including speech, language, voice, fluency, nonverbal intelligence, feeding, swallowing, and hearing. Students will incorporate standardized and informal or observational assessment data into treatment planning and goal setting. Special emphasis will be placed on interprofessional interactions in the diagnostic and assessment processes. Strategies for assessing and determining eligibility for services for multicultural and multilingual clients will be applied. Clinical report writing, ethical treatment of prospective clients, and maintaining patient confidentiality will be emphasized in this course.</p><p><strong>SLP-540 Aphasia (4 Credits)</strong><br/>The primary objective of this course is to examine the range and the patterns of deficit in speaking, listening, reading, and writing that individuals with aphasia may exhibit. This knowledge can then be considered to gain an understanding of the multiple aphasia classification systems and their rationales. Diagnosis of aphasia and aphasia types through standardized and informal procedures will be emphasized. A wide range of intervention strategies and the evidence for their efficacy will be examined for the continuum of recovery and treatment from the acute to the chronic stage.</p><p><strong>SLP-542 Dysphagia (4 Credits)</strong><br/>The focus of this course is normal and disordered deglutition and the diagnosis and treatment of dysphagia in infants, children,  and adults. Evaluation of the phases of deglutition by instrumental measures and bedside clinical examinations by the speech-language pathologist in consultation and collaboration with other medical team members will be addressed. Management of disordered swallowing using a multidisciplinary team approach also will be addressed. Management of swallowing disorders secondary to birth trauma, head and neck cancer, and neuromuscular disorders will be addressed, in addition to medical treatments currently available. Orofacial myology will be reviewed, with treatment of myofunctional disorders addressed. Clinical management and decision making will be based on the World Health Organization model and support available from evidence-based practice.</p><p><strong>SLP-550 Fluency Disorders (2 Credits)</strong><br/>The focus of this course is diagnosis and treatment of fluency disorders in individuals across the lifespan. Students will learn to distinguish between normal disfluencies, stuttering, and other fluency disorders. An emphasis will be on understanding factors that influence the development of fluency disorders, including genetics, neuroanatomy, neurophysiology, speech and language development, temperament, and environmental influences. Students will learn how to use differential diagnostic tools, formulate intervention goals and procedures reflecting both the motor component and the social/emotional aspects of a fluency disorder. They will demonstrate competence in a variety of stuttering modification and fluency shaping techniques.</p><p><strong>SLP-552 Advanced Research Methods (2 Credits)</strong><br/>The content in this course builds upon the content covered in undergraduate Research Methods courses. The primary objective of this course is to examine a variety of statistical measures, with an emphasis on study design, as well as on interpretation of statistical findings for evidence-based decision making in clinical practice.</p><p><strong>SLP-560 Acquired Disorders (4 Credits)</strong><br/>The acquired cognitive-communication disorders associated with traumatic brain injury, dementia, and right hemisphere disorder will be examined in this course. Neurophysiological implications of the disorders or disease processes will be presented. Students will gain an appreciation for the role of attention, memory and executive functions in supporting communication and how deficits in these cognitive processes result in communication disorders. To better understand assessment of and intervention for cognitive-communication deficits, models explaining these cognitive processes will be examined. Students will learn about specific assessment procedures and engage in the decision-making process for intervention planning. The social communication aspects of cognitive-communication disorders will also be examined.</p><p><strong>SLP-570 Comprehensive Exam (0 Credits)</strong><br/>Students must successfully pass the comprehensive examination that is designed to test their comprehensive knowledge of speech-language pathology. Grading will be Pass/No Credit.</p><p><strong>SLP-575 Master\\'s Thesis (0 Credits)</strong><br/>The primary purpose of this course is for MS-SLP students to learn about multiple aspects of the research process including research design, data collection, research ethics, critical thinking, and research writing and presentation of findings. Successful completion of a Master\\'s Thesis presentation satisfies the program\\'s requirement for oral comprehensive examinations.</p><p><strong>SLP-580 Low Incidence Disorders (2 Credits)</strong><br/>The focus of this online course is to explore low incidence disorders that effect speech and language in childhood, with primary attention on craniofacial disorders, including cleft lip and palate. Students will review typical and disordered development of facial anatomy and physiology in neonates, as well as early medical interventions available to address craniofacial dysmorphology. Emphasis is placed on the speech-language pathologist\\'s roles on a multidisciplinary team as a consultant, collaborator, and direct service provider. Also explored is research pertaining to evidence-based practice and the World Health Organization\\'s model to develop diagnostic and treatment procedures to address secondary disorders of articulation, language, as well as voice and resonance in various cultural contexts.</p><p><strong>SLP-582 Voice Disorders (2 Credits)</strong><br/>The focus of this course is diagnosis and treatment of a wide variety of voice disorders and differences in individuals across the lifespan. The importance of the speech-language pathologist as a member of a multidisciplinary team to differentially diagnose voice disorders will be emphasized. Interventions, including counseling, of individuals with voice disorders will be addressed. A survey of medical interventions currently available to treat voice disorders will be conducted. Clinical management and decision making will be based on the World Health Organization model and support available from evidence-based practice.</p><p><strong>SLP-584 Autism Spectrum Disorders (2 Credits)</strong><br/>The primary objective of this course is for students to learn about diagnostic criteria for autism spectrum disorders (ASD) and associated disorders and best practices for determining social-communication goals and intervention planning for affected individuals. The role of the family when one or more members is affected by ASD will be explored in-depth. Other topics that will be covered include the neurodiversity perspective of ASD, the SLP\\'s role on ASD diagnostic and intervention teams, coordination of services, current research about the etiology of ASD, and best practices for providing intervention for individuals with ASD.</p><p><strong>SLP-586 Augmentative & Alternat Comm (2 Credits)</strong><br/>The primary objective of this course is for students to determine instances in which AAC may be an appropriate primary or supplemental approach for clients with communication impairments across the lifespan. Students will learn about selection techniques, funding, low-tech and high-tech AAC, and how to collaborate with other professionals, clients, and family members to determine the most effective approach to take with clients who may benefit from AAC.</p><p><strong>SLP-588 Advanced Aural Rehabilitation (3 Credits)</strong><br/>Around 15% of the U.S. population is d/Deaf or hard-of-hearing (DHH) making it very likely that speech-language pathologists will encounter clients who have hearing loss.  This course focuses on intervention for DHH children, adults, and older adults, with an emphasis on clinical application of learned skills.</p><p><strong>SLP-590 Audiology for the SLP (1 Credits)</strong><br/>The focus of this seminar is on audiological diagnoses and interventions, and hearing science instrumentation for speech-language pathologists (SLPs). Topics include hearing screening, audiogram interpretation, hearing disorders, and hearing aids and cochlear implants. Includes in-class laboratory work.</p>');",
  "scrape_metadata": {
    "original_title": "Speech-Language Pathology (Master of Science)",
    "dept_slug": "speech-language-pathology-master-science",
    "original_url": "https://augustana.edu/academics/areas-of-study/speech-language-pathology-master-science",
    "courses_url": "https://augustana.edu/academics/areas-of-study/speech-language-pathology-master-science/courses",
    "scrape_timestamp": "2025-09-26 19:59:58",
    "status": "success"
  }
}