{
  "program_title": "Theatre",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/theatre-arts/courses",
  "faculty": [],
  "requirements": {
    "major_in": null,
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": null,
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=thea",
  "courses_html": "document.write('<p><strong>THEA-100 Intro to Theatre (4 Credits)</strong><br/>(PA) Introduction to Theatre. Theatre as a collaborative, vital and multi-faceted art form that reflects and impacts culture and society. Through study of theatre practice and various dramatic texts from Ancient Greece to contemporary times, this course will examine how the written word is translated into action and images on stage.</p><p><strong>THEA-100W Intro to Theatre (4 Credits)</strong><br/>(PA) Introduction to Theatre. Theatre as a collaborative, vital and multi-faceted art form that reflects and impacts culture and society. Through study of theatre practice and various dramatic texts from Ancient Greece to contemporary times, this course will examine how the written word is translated into action and images on stage.  This section will count toward the WGSS program.</p><p><strong>THEA-105 Theatre Practicum: Cast (0-1 Credits)</strong><br/>Participation in a college theatre production as a member of the acting ensemble. Each level in the theatre practicum sequence assumes a greater amount of production experience and a readiness for more important production responsibility. Prerequisite: permission of department. (May be repeated for 0 credit).</p><p><strong>THEA-106 Theatre Practicum: Crew (0-1 Credits)</strong><br/>Participation in a college theatre production as a member of the acting ensemble. Each level in the theatre practicum sequence assumes a greater amount of production experience and a readiness for more important production responsibility. Prerequisite: permission of department. (May be repeated for 0 credit).</p><p><strong>THEA-107 Theatre Practicum: Dramaturgy (0-1 Credits)</strong><br/>Participation in a college theatre production as a production dramaturg. Each level in the theatre practicum sequence assumes a greater amount of production experience and a readiness for more important production responsibility. Prerequisite: permission of department. (May be repeated for 0 credit).</p><p><strong>THEA-199 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular area of theatre under a faculty member\\'s direction. Prerequisite: permission of instructor.</p><p><strong>THEA-205 Theatre Practicum: Cast (0-1 Credits)</strong><br/>Participation in a college theatre production as a member of the acting ensemble. Each level in the theatre practicum sequence assumes a greater amount of production experience and a readiness for more important production responsibility. Prerequisite: permission of department. (May be repeated for 0 credit).</p><p><strong>THEA-206 Theatre Practicum: Crew (0-1 Credits)</strong><br/>Participation in a college theatre production as a member of the stage crew. Each level in the theatre practicum sequence assumes a greater amount of production experience and a readiness for more important production responsibility. Prerequisite: permission of department. (May be repeated for 0 credit).</p><p><strong>THEA-207 Theatre Practicum: Dramaturgy (0-1 Credits)</strong><br/>Participation in a college theatre production as a production dramaturg. Each level in the theatre practicum sequence assumes a greater amount of production experience and a readiness for more important production responsibility. Prerequisite: permission of department. (May be repeated for 0 credit).</p><p><strong>THEA-220 Collaborative Acts (4 Credits)</strong><br/>Intensive study of the collaboration process involved in producing a theatre event that is centered around a specific topic.  Students will work together to create a class performance that will include original, devised, or published work related to the theme.  This year\\'s topic is Disability in Theatre.  The class will also be invited to observe and participate in the Quad Cities Penguin Project January production, a performance that features young artists with disabilities.  Offered only in J-Term.</p><p><strong>THEA-240 Acting I (4 Credits)</strong><br/>(PA) Introduction to the acting process through study of its basic principles and development of fundamental performance skills. Studio work includes improvisational exercises, scene study and various performance projects. Emphasis on the use of creative imagination in the context of performance.</p><p><strong>THEA-241 Voice & Movement for the Stage (4 Credits)</strong><br/>A studio course for the actor in the fundamentals of training and achieving an expressive voice and body. Students explore many exercises and activities that lead to deeper self-awareness and control over their vocal and physical instrument, and to remedy poor habits that may be limiting their full range of vocal and physical expressiveness in the portrayal of emotions and characters on the stage. Participants will be encouraged to develop a personal regimen for continuing growth in their vocal and physical skills after the course is done.</p><p><strong>THEA-242 Directing (4 Credits)</strong><br/>Introduction to the directing process through study of directing theory and applied work in script analysis and interpretation, visual composition, communication processes and production styles. Focus on translating dramatic literature from the written page to the visual language of the stage.</p><p><strong>THEA-243 LGBTQ Theatre History (4 Credits)</strong><br/>(PP, D) This course provides an introduction to the history of LGBTQ theatre and dramatic literature in the United States over the 20th and 21st century. The class will focus on indepth reading of the plays, including coding and messaging for normative and queer interpretations, an understanding of the social and cultural pressures of the time(s) of publication and performance, and an opportunity for developing an artistic approach to one of the pieces from the representative dramatic literature.</p><p><strong>THEA-244 Intro Tech Theatre (4 Credits)</strong><br/>(PA) Introduction to the skills and vocabulary of technical theatre. Students will acquire a hands-on knowledge of the methods, principles and conventions of scenic production by way of lab and lecture periods. Basic skills and a working vocabulary in scenery and property construction, scene painting and lighting will be stressed. Lab hours to help construct the current production will reinforce terms and skills discussed in class.</p><p><strong>THEA-245 Intro to Costuming (4 Credits)</strong><br/>This course will take a look at the art of Costume Design in theatre. Sewing by hand and by machine, will be covered. The class will also cover employment and safety in this field.</p><p><strong>THEA-250 Jazz Dance I (2 Credits)</strong><br/>Beginning jazz dance class will include developing a knowledge base and understanding of fundamental jazz technique including core engagement, proper alignment, and basic terminology geared specifically for Musical Theatre. Investigating creating character and conveying a story through movement. Gain strength (especially in the core) and flexibility. Start to develop dance auditioning skills that will enhance the student\\'s marketability and ability to pick up choreography quickly.</p><p><strong>THEA-251 Basic Tap (2 Credits)</strong><br/>This class covers the basic steps of tap technique and how it applies to musical theatre. Students learn coordination, rhythmic variations, and performance skills through a series of tap combinations and exercises. Students will examine the relationship between music, rhythm, and syncopation, be able to apply and connect individual steps learned in class into a choreographed routine, identify the fundamental elements of musical theatre tap dance, and improve ability to pick up choreography quickly as well as to dance as a unified tap ensemble.</p><p><strong>THEA-299 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular area of theatre under a faculty member\\'s direction. Prerequisite: permission of instructor  </p><p><strong>THEA-301 Intro to Dramaturgy (4 Credits)</strong><br/>(PL) Introduction to the practice of dramaturgical research, including historical and social context, production information, and textual references in a variety of historical and modern plays. The course will focus on a survey of contemporary critical theories and interpretive techniques as they apply to the pre-production work of performers, directors, designers, and production dramaturgs. Close readings of a number of plays will be conducted and theories and techniques applied to these plays in order to learn the work of literary managers and dramaturgs. Prerequisite: sophomore status or permission of department.</p><p><strong>THEA-305 Theatre Practicum: Cast (0-1 Credits)</strong><br/>Participation in a college theatre production as a member of the acting ensemble. Each level in the theatre practicum sequence assumes a greater amount of production experience and a readiness for more important production responsibility. Prerequisite: permission of department. (May be repeated for 0 credit).</p><p><strong>THEA-306 Theatre Practicum: Crew (0-1 Credits)</strong><br/>Participation in a college theatre production as a member of the stage crew. Each level in the theatre practicum sequence assumes a greater amount of production experience and a readiness for more important production responsibility. Prerequisite: permission of department. (May be repeated for 0 credit).</p><p><strong>THEA-307 Theatre Practicum: Dramaturgy (0-1 Credits)</strong><br/>Participation in a college theatre production as a production dramaturg. Each level in the theatre practicum sequence assumes a greater amount of production experience and a readiness for more important production responsibility. Prerequisite: permission of department. (May be repeated for 0 credit).</p><p><strong>THEA-314 Scenic Design (4 Credits)</strong><br/>(PA) Introduction to the skills and vocabulary of stage design. Studio work includes elements and principles of scenery and costume design, drawing and drafting techniques and scaled-model building. Projects explore the presentation of visual information as it relates to the collaborative art of theatre. (Offered in alternate years.)</p><p><strong>THEA-315 Lighting and Sound Design (4 Credits)</strong><br/>(PA) Hands-on study of the methods, principles and conventions of design for lighting and sound for the stage. Theory and eventual practice of these methods will allow the students to obtain a better understanding of this theatre craft. Focusing on the design communications for both lighting and sound will help express ideas with other members of the collaborative theatre team. Projects will include assisting the lighting and sound designer for the current production. (Offered in alternate years.)</p><p><strong>THEA-340 Acting II (4 Credits)</strong><br/>Study of acting theory and development of advanced performance technique. Emphasis on character construction, scene study and the expressive use of the actor\\'s instrument. Projects include the presentation of character studies, performances from classic and modern texts and various exercises in the effective use of voice and movement. (Offered in alternate years.) Prerequisite: 240.</p><p><strong>THEA-341 Classical Ages in Theatre (4 Credits)</strong><br/>(PP,G) A historical and critical survey of dramatic literature and performance techniques from ancient ritual through early colonial America, with a primary focus on theatre history and representative play texts from different cultures and time periods.</p><p><strong>THEA-343 Modern & Contemporary Theatre (4 Credits)</strong><br/>(PH,D)A historical and critical survey of dramatic literature and performance techniques from early theatre of the Americas through 21st century contemporary theatre, with a primary focus on theatre\\'s diverse presentations of human values and existence.</p><p><strong>THEA-344 Musical Theatre History (4 Credits)</strong><br/>(D) This course will teach students the history of a purely American art form from its foundations in vaudeville, burlesque and operetta through its evolution from early musical comedy to the contemporary stage. Students will learn about famous composers, choreographers, directors and producers from the past and present Broadway scene and will study historical events that informed and shaped musical theatre.</p><p><strong>THEA-350 Jazz Dance II (2 Credits)</strong><br/>This Jazz dance course will focus on building awareness of technical skills, terminology, and technique learned in Jazz Dance I. We will focus on various choreography concepts commonly seen within Musical Theatre, development of flexibility and strength, and exploring various styles of dance auditions. This course will promote a better understanding and use of adapting each dancers body to the technique needed to sustain a healthy career in dance and becoming more familiar with various choreographic styles.</p><p><strong>THEA-360 Exploring World Theatre (4 Credits)</strong><br/>Immersive travel experience to a world theatre destination for study, training and practice in theatre arts. Offered only in J-Term. Consult department for topic.</p><p><strong>THEA-380 Special Topics in Performance (4 Credits)</strong><br/>Intensive study of a specific area of performance, design, technology or dramaturgical research. Consult the department for topics offered each year.</p><p><strong>THEA-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>THEA-399 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular area of theatre under a faculty member\\'s direction. Prerequisite: permission of instructor</p><p><strong>THEA-400 Independent Study (1-2 Credits)</strong><br/>Opportunity for independent study in theatre under a faculty member\\'s supervision. Prerequisite: permission of instructor.</p><p><strong>THEA-405 Theatre Practicum: Cast (0-1 Credits)</strong><br/>Participation in a college theatre production as a member of the acting ensemble. Each level in the theatre practicum sequence assumes a greater amount of production experience and a readiness for more important production responsibility. Prerequisite: permission of department. (May be repeated for 0 credit).</p><p><strong>THEA-406 Theatre Practicum: Crew (0-1 Credits)</strong><br/>Participation in a college theatre production as a member of a stage crew. Each level in the theatre practicum sequence assumes a greater amount of production experience and a readiness for more important production responsibility. Prerequisite: permission of department. (May be repeated for 0 credit).</p><p><strong>THEA-407 Theatre Practicum: Dramaturgy (0-1 Credits)</strong><br/>Participation in a college theatre production as a production dramaturg. Each level in the theatre practicum sequence assumes a greater amount of production experience and a readiness for more important production responsibility. Prerequisite: permission of department. (May be repeated for 0 credit).</p><p><strong>THEA-410 Stage Combat (4 Credits)</strong><br/>(PEA) Students will develop and exercise fundamental stage combat skills so they may safely and effectively perform staged violence with confidence and ease.  Although the focus of the course will be on the execution of stage combat techniques, the student will also be introduced to the special challenges of fight choreography.  While this course will fulfill the PEA activity course requirement, it does not count toward the 3-course limit in HEPE/PEA for the degree.</p><p><strong>THEA-460 Senior Inquiry (3 Credits)</strong><br/>Intensive study in selected area of theatre arts and development of a related capstone project, culminating in the documentation and public presentation or performance of the student\\'s work.</p><p><strong>THEA-499 Directed Study (1-2 Credits)</strong><br/>Opportunity for students to study a particular area of theatre under a faculty member\\'s direction. Prerequisite: permission of instructor.  </p>');",
  "scrape_metadata": {
    "original_title": "Theatre",
    "dept_slug": "theatre-arts",
    "original_url": "https://augustana.edu/academics/areas-of-study/theatre-arts",
    "courses_url": "https://augustana.edu/academics/areas-of-study/theatre-arts/courses",
    "scrape_timestamp": "2025-09-26 20:00:01",
    "status": "success"
  }
}