{
  "program_title": "Women, Gender, and Sexuality Studies Program",
  "catalog_year": "2025-26",
  "page_url": "https://augustana.edu/academics/areas-of-study/women-gender-and-sexuality-studies/courses",
  "faculty": [],
  "requirements": {
    "major_in": "WGSS 130: Introduction to Gender and Sexuality Studies (4 credits) WGSS 330: Feminist Theories (4 credits) or WGSS: 350: Queer Theories (4 credits) WGSS 430: Applied Gender/Sexuality Studies (4 credits) WGSS : Capstone presentation (0 credits; taken pass/fail) In place of WGSS-430, students may use a 4-credit Senior Inquiry project from another major, so long as the project involves analysis of gender/sexuality and is approved by the WGSS Working Board. The Senior Inquiry can take the form of a research paper, an internship, or activism project. All WGSS majors are required to enroll in the zero-credit capstone experience, which will prepare them to present their research at the annual WGSS Senior Tea Talk. 8 credits of additional WGSS program courses, with at least 4 credits at the 300 level 8 credits of WGSS electives, with at least 4 credits at the 300 level",
    "acs_major": null,
    "major_for_ed": null,
    "minor_in": "WGSS 130: Introduction to Gender Studies (4 credits) WGSS 330: Feminist Theories or WGSS 350: Queer Theories (4 credits) One additional WGSS program course at any level (4 credits) One WGSS elective course at any level (4 credits) Any of the following courses can contribute as electives to the WGSS major and minor. ▪ ART 374: African Art ▪ BIOL 310: Evolutionary Biology ▪ CLAS 212W/ CLAS 312W: Classical Mythology ▪ CLAS 228W/ CLAS 328W: Classical Epic ▪ CLAS 240/ CLAS 340: Women in Antiquity ▪ CLAS 345: Race & Ethnicity in Antiquity ▪ COMM 203: Listening (2 credits) ▪ COMM 204: Mediating Conversation (2 credits) ▪ COMM 205: Sustaining Dialogue (2 credits) ▪ COMM 240: Advertising and Consumer Culture ▪ COMM 210B: Sexual Communication ▪ COMM 331: Feminist Rhetoric ▪ DISA 200: Disability and Society ▪ ENGL 255: Women in Literature ▪ ENGL 295: Women, Health, South Asian Literature ▪ ENGL 345: Empire and Outsiders ▪ ENGL 355: Women Writers and Feminist Theory ▪ FREN 311: Masculinity in Rabelais ▪ FREN 361: French Women Writers ▪ HIST 123: Women and Gender in Latin America, 1492-Present ▪ HIST 220: Black Women in the U.S. ▪ HIST 230: Bodies of Evidence: Scientific Racism in U.S. History ▪ HIST 324: Borders and Crossings: Latin American and Latinos in the U.S., 1830- Present ▪ HIST 333: Disease and Health ▪ HIST 340: Gender in U.S. History ▪ MJMC 404: Advanced Multimedia Project ▪ MJMC 420: Race, Gender and Media ▪ POLS 335: Gender and Sexuality in American Politics ▪ POLS 355: Women and Politics ▪ PSYC 130: Victim Advocacy (2 credits) ▪ PSYC 135: Bystander Intervention (1 credit) ▪ PSYC 226: Human Sexuality ▪ PSYC 228: Psychology of Prejudice ▪ PSYC 416: The Psychology of Gender ▪ PUBH 273: Reproductive Justice ▪ PUBH 306: Sexuality and Health Education ▪ RELG 263/ RELG 363: Sexual Ethics ▪ RELG 284/384: Buddhism and Film ▪ RELG 362: Race, Ethnicity, Religion ▪ RELG 374: Gender and the Bible ▪ SOAN 221: Inequality in America ▪ SOAN 222: Popular Culture ▪ SOAN 322: Anthropology of Latin America ▪ SOAN 325: Global Connections ▪ SOAN 327: Gender in Society ▪ SOAN 328: Feminist Anthropology ▪ SOAN 329: American Race & Ethnic Relations ▪ SOAN 330: Social Movements ▪ SOAN 332: Love and Sex ▪ SPST 230: Women’s Narratives of the Spanish Civil War ▪ THEA 100W: Introduction to Theatre ▪ THEA 243: LGBTQ Theatre History ▪ THEA 343: Modern and Contemporary Theatre",
    "gpa_note": "All courses listed in the catalog as required courses for any major and/or minor, including those courses outside of the department or with a different subject coding, are considered part of the major and will count in the grade point average. Some departments may have additional grade requirements for the courses offered within their department. Recommended supporting courses that are optional and not required may also count in the major depending on the program. For more information see your department chair or the degree requirements for Bachelor of Arts and information on Majors/Minors .",
    "other_sections": {}
  },
  "courses_endpoint": "https://www.augustana.net/prebuilt/catalog/courselist.php?area=wgss",
  "courses_html": "document.write('<p><strong>WGSS-130 Intro to Gender Studies (4 Credits)</strong><br/>(PS) This course serves as an introduction to the interdisciplinary field of Women, Gender, and Sexuality Studies. Familiarizes students with key terms, authors, and debates, while paying special attention to how gender and sexuality intersect with race, ethnicity, class, age, religion, ability, and immigration status to create systems of oppression. Students examine intersectional feminism as a framework for engaging in social justice work.  PS became effect on 9/27/19.</p><p><strong>WGSS-200TR Transfer Elective (1-12 Credits)</strong><br/></p><p><strong>WGSS-230 Gender, Power (4 Credits)</strong><br/>(PS,G)  Interdisciplinary and cross-cultural study of girls\\' and women\\'s experiences of family, education, religion, work, political culture, gender and sexuality. The social, economic and legal statuses of the female are examined globally along with systems that link women around the world, such as media. The parallels and intersections of sex, race, social class and sexual orientation as given statuses within hierarchical societies are addressed as creators of both privilege and discrimination. This class will introduce intersectional theory and transnational intersectional theory.</p><p><strong>WGSS-235 Gender & Sexuality (4 Credits)</strong><br/>(PH, D) This course will introduce students to gender as a theoretical framework and a category of analysis in different disciplines. Through the lens of gender, we will examine social and cultural factors that influence the development of an individual\\'s gender and sexuality. The course emphasizes the intersectionality of gender, class, race/ethnicity and sexuality. The course will cover a broad range of issues for which gender dynamics hold special importance, including some of the following: sexual health and sexuality; representation; violence; chronic and communicable diseases; and occupational and reproductive health. </p><p><strong>WGSS-250 Critical Race Feminism (4 Credits)</strong><br/>(PH&lt; D) Critical Race Feminism is a theoretical and pragmatic movement that builds upon Critical Race Theory and Feminism as a means to correct the chasms of early human rights movements that have further marginalized oppressed populations. In the hierarchical microcosm of America there is a pervasive paradox that plagues race and gender discourse within the social justice arena. The Civil Rights movement and its successors have found empowerment and privilege Critical Race Theory frameworks, while proponents of elite white womanhood have found refuge in feminist theory. These movement have often been lauded as &quot;bastions of liberality&quot; with a trickle-down economy that will &quot;eventually&quot; reach those who are further down on the intersectional totem pole. However, in their respective challenges of race, gender, and power dynamics, both movements have often shut out those whose regional, global, and religious positionalities do not align with the &quot;mainstream&quot; narratives of oppression. This leaves Black women, women in third world countries, Asian women, Latinx women, African women, Indigenous women, Islamic women, poor women, and mentally disabled women silenced and vulnerable as they fight for equality and humanity in isolated and increasingly hostile environments. In this course, students will build a foundational knowledge of the movement and use a Critical Race Feminist lens to interrogate and challenge historical and contemporary issues that continue to disenfranchise women f</p><p><strong>WGSS-270 Queer Art (4 Credits)</strong><br/>(PA) In this studio-based class, we leverage the works of feminist and queer-identified artists as inspiration for making new work.  Students are encouraged to explore meaning-making within a wide range of creative processes.  $40.00 studio fee.</p><p><strong>WGSS-330 Feminist Theory (4 Credits)</strong><br/>(PH,D) This course will provide an overview of feminist theories as they have developed over the last two hundred and fifty years, concentrated mostly on the multiplicity of theories that have been developed and followed in the United States. The course will require students to think about the applicability of various feminist theories to historical and contemporary issues of concern, including gender and sexual identity, intersecting oppressions, legal rights, economic equality, work and consumption, marriage and family, domestic violence and war, sexual danger and pleasure, racial and sexual liberation, empowerment, and bodies. Pre-req: WGSS-130. New material for this course will include segments on indigenous, south and east Asian, Asian-American, Chicana, and Latina feminisms and one application project on one of those theories.</p><p><strong>WGSS-335 Masculinity in American Culture (4 Credits)</strong><br/>(PS,D) Masculinity in America. Exploration of the various meanings of masculinity as affected by cultural, historical and contemporary forces in post-modern society. Gender is one of life\\'s chief organizing principles, shaping identities, interactions and institutions in such areas as work, education, health and family. In this course, life experiences and opportunity structures among dominant and non-dominant groups of boys and men are examined, as is the performance and embodiment of masculinity among women and girls. Special attention will be given to the intersections of masculinity and class, race, ethnicity,  sexuality, ability, age, and other identifiers. Students will complete at least one project in which they critique hegemonic masculinity using an intersectional approach.</p><p><strong>WGSS-340 Global Masculinities (4 Credits)</strong><br/>(PS,G) A cross-cultural study of socialization of boys and men that examines how early learning prepares them for later interactions with women and other men. The examination includes analysis of the social institutions and processes that produce and reproduce definitions of masculinity within each culture. New global influences such as media and changing patterns such as migration and employment are considered as they shape meanings of masculinity.</p><p><strong>WGSS-350 Queer Theories (4 Credits)</strong><br/>(PL,D) This course expands and challenges understandings of queer-the noun, verb, and adjective-while engaging key themes and critical frameworks in queer theories. Focuses on exploration of foundational concepts as well as subfields and emerging streams of thought including queer of color critique, queer temporality, crip theory, and affect theory. Queer theories are read in conversation with cultural productions-from literature and cinema to music and activist campaigns-in ways that interrogate (and sometimes subvert) these very genre distinctions. Course also prioritizes time and space to reflect on the complexity of both our material realities and our contextually shifting lived experiences. Prerequisite: WGSS-130 or permission of instructor..</p><p><strong>WGSS-360 Grassroot Feminism India (4 Credits)</strong><br/>(PS, G) This course will focus on the history and culture of India, as well as the gender, class, and caste-related social issues of the country\\'s past and present, in order to prepare students for a study-away trip to the country. After introductions to the country and before preparing students for the organizations and activities they will witness on the trip, the class will look at how South Asian women understand their identities and use that understanding to create change within their own communities through focusing on South Asian women writers and social change activists, in both fiction and non-fiction. This class will include a richer introduction to the country\\'s history, to conversational Hindi, and to Skype conversations and visits to south Asian activists doing work in our country. </p><p><strong>WGSS-365 Reading Global, Thinking Local (4 Credits)</strong><br/>During the J-Term students will be visiting India for two weeks. They will be visiting different non-for-profit organizations like the Naz Foundation and The Guild Of Service. They will be attending lectures at Rajastha University. The post-trip meetings on campus are intended to bring last term\\'s course and travel to India &quot;full circle&quot; in order to help all of us understand how to work for change in our own communities (wherever that may lead us throughout our lives). Pre-requisite WGSS 360.</p><p><strong>WGSS-370 Gender & Social Justice (4 Credits)</strong><br/>(D) Course readings will provide an exploration of the multiple ways in which the law has contended with sexual difference, gender-based stereotypes, and the meaning of equality in domestic, transnational and international contexts.</p><p><strong>WGSS-393 International Study Colloquium (3-4 Credits)</strong><br/></p><p><strong>WGSS-400 Independent Study (1-2 Credits)</strong><br/></p><p><strong>WGSS-430 App Gender/Sexuality Studies (4 Credits)</strong><br/>Applied gender studies - may be research, internship, or an activism project that functions as a capstone project in the student\\'s area of concentration.  Students may substitute another SI project if it fulfills goals of SI in WGSS. Prereq: WGSS330.</p><p><strong>WGSS-499 Directed Study (1-2 Credits)</strong><br/></p><p><strong>WGSS-INTR Women Studies Internship (0-12 Credits)</strong><br/>WGST-INTR-Axx Academic Internship (0-12 credits.) Departmental internships must be approved by the department. Analysis of the background, structure and policy issues in the sponsoring organization. Prerequisites: declared major or minor in Women and Gender Studies.  WGST-INTR-Exx Experiential (0-12 credits.) Departmental internships must be approved by the department.</p>');",
  "scrape_metadata": {
    "original_title": "Women, Gender, and Sexuality Studies",
    "dept_slug": "women-gender-and-sexuality-studies",
    "original_url": "https://augustana.edu/academics/areas-of-study/women-gender-and-sexuality-studies",
    "courses_url": "https://augustana.edu/academics/areas-of-study/women-gender-and-sexuality-studies/courses",
    "scrape_timestamp": "2025-09-26 20:00:06",
    "status": "success"
  }
}